//民族
var nations = [{
		"id": '01',
		"name": '汉族'
	},
	{
		"id": '02',
		"name": '蒙古族'
	},
	{
		"id": '03',
		"name": '回族'
	},
	{
		"id": '04',
		"name": '藏族'
	},
	{
		"id": '05',
		"name": '维吾尔族'
	},
	{
		"id": '06',
		"name": '苗族'
	},
	{
		"id": '07',
		"name": '彝族'
	},
	{
		"id": '08',
		"name": '壮族'
	},
	{
		"id": '09',
		"name": '布依族'
	},
	{
		"id": '10',
		"name": '朝鲜族'
	},
	{
		"id": '11',
		"name": '满族'
	},
	{
		"id": '12',
		"name": '侗族'
	},
	{
		"id": '13',
		"name": '瑶族'
	},
	{
		"id": '14',
		"name": '白族'
	},
	{
		"id": '15',
		"name": '土家族'
	},
	{
		"id": '16',
		"name": '哈尼族'
	},
	{
		"id": '17',
		"name": '哈萨克族'
	},
	{
		"id": '18',
		"name": '傣族'
	},
	{
		"id": '19',
		"name": '黎族'
	},
	{
		"id": '20',
		"name": '傈傈族'
	},
	{
		"id": '21',
		"name": '佤族'
	},
	{
		"id": '22',
		"name": '畲族'
	},
	{
		"id": '23',
		"name": '高山族'
	},
	{
		"id": '24',
		"name": '拉祜族'
	},
	{
		"id": '25',
		"name": '水族'
	},
	{
		"id": '26',
		"name": '东乡族'
	},
	{
		"id": '27',
		"name": '纳西族'
	},
	{
		"id": '28',
		"name": '景颇族'
	},
	{
		"id": '29',
		"name": '柯尔克孜族'
	},
	{
		"id": '30',
		"name": '土族'
	},
	{
		"id": '31',
		"name": '达翰尔族'
	},
	{
		"id": '32',
		"name": '仫佬族'
	},
	{
		"id": '33',
		"name": '羌族'
	},
	{
		"id": '34',
		"name": '布朗族'
	},
	{
		"id": '35',
		"name": '撒拉族'
	},
	{
		"id": '36',
		"name": '毛南族'
	},
	{
		"id": '37',
		"name": '仡佬族'
	},
	{
		"id": '38',
		"name": '锡伯族'
	},
	{
		"id": '39',
		"name": '阿昌族'
	},
	{
		"id": '40',
		"name": '普米族'
	},
	{
		"id": '41',
		"name": '塔吉克族'
	},
	{
		"id": '42',
		"name": '怒族'
	},
	{
		"id": '43',
		"name": '乌孜别克族'
	},
	{
		"id": '44',
		"name": '俄罗斯族'
	},
	{
		"id": '45',
		"name": '鄂温克族'
	},
	{
		"id": '46',
		"name": '德昂族'
	},
	{
		"id": '47',
		"name": '保安族'
	},
	{
		"id": '48',
		"name": '裕固族'
	},
	{
		"id": '49',
		"name": '京族'
	},
	{
		"id": '50',
		"name": '塔塔尔族'
	},
	{
		"id": '51',
		"name": '独龙族'
	},
	{
		"id": '52',
		"name": '鄂伦春族'
	},
	{
		"id": '53',
		"name": '赫哲族'
	},
	{
		"id": '54',
		"name": '门巴族'
	},
	{
		"id": '55',
		"name": '珞巴族'
	},
	{
		"id": '56',
		"name": '基诺族'
	},
	{
		"id": '90',
		"name": '外籍'
	},
	{
		"id": '99',
		"name": '其他'
	}
];

// 国籍
var country = [{
	"id": "ABW",
	"name": "阿鲁巴岛"
}, {
	"id": "AFG",
	"name": "阿富汗"
}, {
	"id": "AGO",
	"name": "安哥拉"
}, {
	"id": "AIA",
	"name": "安圭拉"
}, {
	"id": "ALA",
	"name": "奥兰群岛"
}, {
	"id": "ALB",
	"name": "阿尔巴尼亚"
}, {
	"id": "AND",
	"name": "安道尔"
}, {
	"id": "ANT",
	"name": "荷属安地列斯群岛"
}, {
	"id": "ARE",
	"name": "阿拉伯联合酋长国"
}, {
	"id": "ARG",
	"name": "阿根廷"
}, {
	"id": "ARM",
	"name": "亚美尼亚"
}, {
	"id": "ASM",
	"name": "美属萨摩亚"
}, {
	"id": "ATA",
	"name": "南极洲"
}, {
	"id": "ATF",
	"name": "法属南部领地"
}, {
	"id": "ATG",
	"name": "安提瓜岛与巴布达岛"
}, {
	"id": "AUS",
	"name": "澳大利亚"
}, {
	"id": "AUT",
	"name": "奥地利"
}, {
	"id": "AZE",
	"name": "阿塞拜疆"
}, {
	"id": "BDI",
	"name": "布隆迪"
}, {
	"id": "BEL",
	"name": "比利时"
}, {
	"id": "BEN",
	"name": "贝宁"
}, {
	"id": "BFA",
	"name": "布基纳法索"
}, {
	"id": "BGD",
	"name": "孟加拉国"
}, {
	"id": "BGR",
	"name": "保加利亚"
}, {
	"id": "BHR",
	"name": "巴林群岛"
}, {
	"id": "BHS",
	"name": "巴哈马群岛"
}, {
	"id": "BIH",
	"name": "波斯尼亚与黑塞哥维那"
}, {
	"id": "BLR",
	"name": "白俄罗斯"
}, {
	"id": "BLZ",
	"name": "伯利兹"
}, {
	"id": "BMU",
	"name": "百慕大群岛"
}, {
	"id": "BOL",
	"name": "玻利维亚"
}, {
	"id": "BRA",
	"name": "巴西"
}, {
	"id": "BRB",
	"name": "巴巴多斯岛"
}, {
	"id": "BRN",
	"name": "文莱"
}, {
	"id": "BTN",
	"name": "不丹"
}, {
	"id": "BVT",
	"name": "博维特岛"
}, {
	"id": "BWA",
	"name": "博茨瓦纳"
}, {
	"id": "CAF",
	"name": "中非共和国"
}, {
	"id": "CAN",
	"name": "加拿大"
}, {
	"id": "CCK",
	"name": "科科斯群岛"
}, {
	"id": "CHE",
	"name": "瑞士"
}, {
	"id": "CHL",
	"name": "智利"
}, {
	"id": "CHN",
	"name": "中国"
}, {
	"id": "CIV",
	"name": "科特迪瓦"
}, {
	"id": "CMR",
	"name": "喀麦隆"
}, {
	"id": "COD",
	"name": "刚果（金）"
}, {
	"id": "COG",
	"name": "刚果"
}, {
	"id": "COK",
	"name": "库克群岛"
}, {
	"id": "COL",
	"name": "哥伦比亚"
}, {
	"id": "COM",
	"name": "科摩罗"
}, {
	"id": "CPV",
	"name": "佛得角"
}, {
	"id": "CRI",
	"name": "哥斯达黎加"
}, {
	"id": "CUB",
	"name": "古巴"
}, {
	"id": "CXR",
	"name": "圣诞岛"
}, {
	"id": "CYM",
	"name": "开曼群岛"
}, {
	"id": "CYP",
	"name": "塞浦路斯"
}, {
	"id": "CZE",
	"name": "捷克共和国"
}, {
	"id": "DEU",
	"name": "德国"
}, {
	"id": "DJI",
	"name": "吉布提"
}, {
	"id": "DMA",
	"name": "多米尼加"
}, {
	"id": "DNK",
	"name": "丹麦"
}, {
	"id": "DOM",
	"name": "多米尼加共和国"
}, {
	"id": "DZA",
	"name": "阿尔及尔"
}, {
	"id": "ECU",
	"name": "厄瓜多尔"
}, {
	"id": "EGY",
	"name": "埃及"
}, {
	"id": "ERI",
	"name": "厄立特里亚"
}, {
	"id": "ESH",
	"name": "西撒哈拉"
}, {
	"id": "ESP",
	"name": "西班牙"
}, {
	"id": "EST",
	"name": "爱沙尼亚"
}, {
	"id": "ETH",
	"name": "埃塞俄比亚"
}, {
	"id": "FIN",
	"name": "芬兰"
}, {
	"id": "FJI",
	"name": "斐济"
}, {
	"id": "FRA",
	"name": "法国"
}, {
	"id": "FRO",
	"name": "法罗群岛"
}, {
	"id": "FSM",
	"name": "密克罗尼西亚"
}, {
	"id": "GAB",
	"name": "加蓬"
}, {
	"id": "GBR",
	"name": "英国"
}, {
	"id": "GEO",
	"name": "乔治亚州"
}, {
	"id": "GGY",
	"name": "格恩西岛"
}, {
	"id": "GHA",
	"name": "加纳"
}, {
	"id": "GIB",
	"name": "直布罗陀"
}, {
	"id": "GIN",
	"name": "几内亚"
}, {
	"id": "GLP",
	"name": "瓜德罗普岛"
}, {
	"id": "GMB",
	"name": "冈比亚"
}, {
	"id": "GNB",
	"name": "几内亚比绍"
}, {
	"id": "GNQ",
	"name": "赤道几内亚"
}, {
	"id": "GRC",
	"name": "希腊"
}, {
	"id": "GRD",
	"name": "格林纳达"
}, {
	"id": "GRL",
	"name": "格陵兰"
}, {
	"id": "GTM",
	"name": "危地马拉"
}, {
	"id": "GUF",
	"name": "法属圭亚那"
}, {
	"id": "GUM",
	"name": "关岛"
}, {
	"id": "GUY",
	"name": "圭亚那"
}, {
	"id": "HKG",
	"name": "中国香港"
}, {
	"id": "HMD",
	"name": "赫德和麦克唐纳群岛"
}, {
	"id": "HND",
	"name": "洪都拉斯"
}, {
	"id": "HRV",
	"name": "克罗地亚"
}, {
	"id": "HTI",
	"name": "海地"
}, {
	"id": "HUN",
	"name": "匈牙利"
}, {
	"id": "IDN",
	"name": "印度尼西亚"
}, {
	"id": "IMN",
	"name": "曼恩岛"
}, {
	"id": "IND",
	"name": "印度"
}, {
	"id": "IOT",
	"name": "英属印度洋领地"
}, {
	"id": "IRL",
	"name": "爱尔兰"
}, {
	"id": "IRN",
	"name": "伊朗"
}, {
	"id": "IRQ",
	"name": "伊拉克"
}, {
	"id": "ISL",
	"name": "冰岛"
}, {
	"id": "ISR",
	"name": "以色列"
}, {
	"id": "ITA",
	"name": "意大利"
}, {
	"id": "JAM",
	"name": "牙买加"
}, {
	"id": "JEY",
	"name": "泽西岛"
}, {
	"id": "JOR",
	"name": "约旦"
}, {
	"id": "JPN",
	"name": "日本"
}, {
	"id": "KAZ",
	"name": "哈萨克斯坦"
}, {
	"id": "KEN",
	"name": "肯尼亚"
}, {
	"id": "KGZ",
	"name": "吉尔吉斯斯坦"
}, {
	"id": "KHM",
	"name": "柬埔寨"
}, {
	"id": "KIR",
	"name": "基里巴斯"
}, {
	"id": "KLK",
	"name": "福克兰群岛"
}, {
	"id": "KNA",
	"name": "圣基茨和尼维斯"
}, {
	"id": "KOR",
	"name": "韩国"
}, {
	"id": "KWT",
	"name": "科威特"
}, {
	"id": "LAO",
	"name": "老挝"
}, {
	"id": "LBN",
	"name": "黎巴嫩"
}, {
	"id": "LBR",
	"name": "利比里亚"
}, {
	"id": "LBY",
	"name": "利比亚"
}, {
	"id": "LCA",
	"name": "圣卢西亚岛"
}, {
	"id": "LIE",
	"name": "列支敦士登"
}, {
	"id": "LKA",
	"name": "斯里兰卡"
}, {
	"id": "LSO",
	"name": "莱索托"
}, {
	"id": "LTU",
	"name": "立陶宛"
}, {
	"id": "LUX",
	"name": "卢森堡"
}, {
	"id": "LVA",
	"name": "拉脱维亚"
}, {
	"id": "MAC",
	"name": "中国澳门"
}, {
	"id": "MAR",
	"name": "摩洛哥"
}, {
	"id": "MCO",
	"name": "摩纳哥"
}, {
	"id": "MDA",
	"name": "摩尔多瓦"
}, {
	"id": "MDG",
	"name": "马达加斯加岛"
}, {
	"id": "MDV",
	"name": "马尔代夫"
}, {
	"id": "MEX",
	"name": "墨西哥"
}, {
	"id": "MHL",
	"name": "马绍尔群岛"
}, {
	"id": "MKD",
	"name": "马其顿"
}, {
	"id": "MLI",
	"name": "马里"
}, {
	"id": "MLT",
	"name": "马耳他"
}, {
	"id": "MMR",
	"name": "缅甸"
}, {
	"id": "MNE",
	"name": "黑山"
}, {
	"id": "MNG",
	"name": "蒙古"
}, {
	"id": "MNP",
	"name": "北马里亚纳群岛自由联邦"
}, {
	"id": "MOZ",
	"name": "莫桑比克"
}, {
	"id": "MRT",
	"name": "毛利塔尼亚"
}, {
	"id": "MSR",
	"name": "蒙特塞拉特岛"
}, {
	"id": "MTQ",
	"name": "马提尼克岛"
}, {
	"id": "MUS",
	"name": "毛里求斯"
}, {
	"id": "MWI",
	"name": "马拉维"
}, {
	"id": "MYS",
	"name": "马来西亚"
}, {
	"id": "MYT",
	"name": "马约特岛"
}, {
	"id": "NAM",
	"name": "纳米比亚"
}, {
	"id": "NCL",
	"name": "新喀里多尼亚"
}, {
	"id": "NER",
	"name": "尼日尔"
}, {
	"id": "NFK",
	"name": "诺福克岛"
}, {
	"id": "NGA",
	"name": "尼日利亚"
}, {
	"id": "NIC",
	"name": "尼加拉瓜"
}, {
	"id": "NIU",
	"name": "纽埃岛"
}, {
	"id": "NLD",
	"name": "荷兰"
}, {
	"id": "NOR",
	"name": "挪威"
}, {
	"id": "NPL",
	"name": "尼泊尔"
}, {
	"id": "NRU",
	"name": "瑙鲁"
}, {
	"id": "NZL",
	"name": "新西兰"
}, {
	"id": "OMN",
	"name": "阿曼"
}, {
	"id": "PAK",
	"name": "巴基斯坦"
}, {
	"id": "PAN",
	"name": "巴拿马"
}, {
	"id": "PCN",
	"name": "皮特克恩岛"
}, {
	"id": "PER",
	"name": "秘鲁"
}, {
	"id": "PHL",
	"name": "菲律宾"
}, {
	"id": "PLW",
	"name": "帕劳岛"
}, {
	"id": "PNG",
	"name": "巴布亚新几内亚"
}, {
	"id": "POL",
	"name": "波兰"
}, {
	"id": "PRI",
	"name": "波多黎各"
}, {
	"id": "PRK",
	"name": "朝鲜"
}, {
	"id": "PRT",
	"name": "葡萄牙"
}, {
	"id": "PRY",
	"name": "巴拉圭"
}, {
	"id": "PSE",
	"name": "巴勒斯坦"
}, {
	"id": "PYF",
	"name": "法属波利尼西亚"
}, {
	"id": "QAT",
	"name": "卡塔尔"
}, {
	"id": "REU",
	"name": "留尼旺岛"
}, {
	"id": "ROU",
	"name": "罗马尼亚"
}, {
	"id": "RUS",
	"name": "俄国"
}, {
	"id": "RWA",
	"name": "卢旺达"
}, {
	"id": "SAU",
	"name": "沙特阿拉伯"
}, {
	"id": "SDN",
	"name": "苏丹"
}, {
	"id": "SEN",
	"name": "塞内加尔"
}, {
	"id": "SGP",
	"name": "新加坡"
}, {
	"id": "SGS",
	"name": "南乔治亚岛和南桑威奇群岛"
}, {
	"id": "SHN",
	"name": "圣赫勒拿岛"
}, {
	"id": "SJM",
	"name": "斯瓦尔巴岛和扬马延岛"
}, {
	"id": "SLB",
	"name": "所罗门群岛"
}, {
	"id": "SLE",
	"name": "塞拉利昂"
}, {
	"id": "SLV",
	"name": "萨尔瓦多"
}, {
	"id": "SMR",
	"name": "圣马力诺"
}, {
	"id": "SOM",
	"name": "索马里"
}, {
	"id": "SPM",
	"name": "圣皮埃尔和密克隆岛"
}, {
	"id": "SRB",
	"name": "塞尔维亚和黑山"
}, {
	"id": "STP",
	"name": "圣多美和普林西比"
}, {
	"id": "SUR",
	"name": "苏里南"
}, {
	"id": "SVK",
	"name": "斯洛伐克"
}, {
	"id": "SVN",
	"name": "斯洛文尼亚"
}, {
	"id": "SWE",
	"name": "瑞典"
}, {
	"id": "SWZ",
	"name": "斯威士兰"
}, {
	"id": "SYC",
	"name": "塞舌尔"
}, {
	"id": "SYR",
	"name": "叙利亚"
}, {
	"id": "TCA",
	"name": "特克斯和凯科斯群岛"
}, {
	"id": "TCD",
	"name": "乍得"
}, {
	"id": "TGO",
	"name": "多哥"
}, {
	"id": "THA",
	"name": "泰国"
}, {
	"id": "TJK",
	"name": "塔吉克斯坦"
}, {
	"id": "TKL",
	"name": "托克劳群岛"
}, {
	"id": "TKM",
	"name": "土库曼斯坦"
}, {
	"id": "TLS",
	"name": "东帝汶"
}, {
	"id": "TON",
	"name": "汤加"
}, {
	"id": "TTO",
	"name": "特立尼达和多巴哥"
}, {
	"id": "TUN",
	"name": "突尼斯"
}, {
	"id": "TUR",
	"name": "土耳其"
}, {
	"id": "TUV",
	"name": "图瓦卢"
}, {
	"id": "TWN",
	"name": "中国台湾"
}, {
	"id": "TZA",
	"name": "坦桑尼亚"
}, {
	"id": "UGA",
	"name": "乌干达"
}, {
	"id": "UKR",
	"name": "乌克兰"
}, {
	"id": "UMI",
	"name": "美属萨摩亚"
}, {
	"id": "URY",
	"name": "乌拉圭"
}, {
	"id": "USA",
	"name": "美国"
}, {
	"id": "UZB",
	"name": "乌兹别克斯坦"
}, {
	"id": "VAT",
	"name": "梵蒂冈"
}, {
	"id": "VCT",
	"name": "圣文森特和格林纳丁斯群岛"
}, {
	"id": "VEN",
	"name": "委内瑞拉"
}, {
	"id": "VGB",
	"name": "维尔京群岛（英属）"
}, {
	"id": "VIR",
	"name": "维尔京群岛（美属）"
}, {
	"id": "VNM",
	"name": "越南"
}, {
	"id": "VUT",
	"name": "瓦努阿图"
}, {
	"id": "WLF",
	"name": "瓦利斯群岛和富图纳群岛"
}, {
	"id": "WSM",
	"name": "萨摩亚群岛"
}, {
	"id": "YEM",
	"name": "也门"
}, {
	"id": "ZAF",
	"name": "南非"
}, {
	"id": "ZMB",
	"name": "赞比亚"
}, {
	"id": "ZWE",
	"name": "津巴布韦"
}]

var cardType = [{
	"id": "01",
	"name": "居民身份证(户口簿)"
}, {
	"id": "02",
	"name": "中国人民解放军军官证"
}, {
	"id": "03",
	"name": "中国人民武装警察警官证"
}, {
	"id": "04",
	"name": "香港特区护照/港澳居民来往内地通行证"
}, {
	"id": "05",
	"name": "澳门区护照/港澳居民来往内地通行证"
}, {
	"id": "06",
	"name": "台湾居民来往大陆通行证"
}, {
	"id": "07",
	"name": "外国人永久居留证"
}, {
	"id": "08",
	"name": "外国人护照"
}]

var status = [{
	"id": "01",
	"name": "已申领"
}, {
	"id": "12",
	"name": "照片审核失败"
}, {
	"id": "21",
	"name": "制卡中"
}, {
	"id": "35",
	"name": "制卡完成"
}, {
	"id": "41",
	"name": "发放中"
}, {
	"id": "45",
	"name": "卡片寄送到社区网点"
}, {
	"id": "70",
	"name": "已领卡"
}, {
	"id": "71",
	"name": "已开通"
}, {
	"id": "72",
	"name": "正式挂失"
}, {
	"id": "73",
	"name": "应用锁定"
}, {
	"id": "74",
	"name": "临时挂失"
}, {
	"id": "79",
	"name": "注销"
}]

var area = [{
	"id": "310000",
	"name": "上海市"
}, {
	"id": "319900",
	"name": "上海市市本级"
}, {
	"id": "310101",
	"name": "黄浦区"
}, {
	"id": "310104",
	"name": "徐汇区"
}, {
	"id": "310105",
	"name": "长宁区"
}, {
	"id": "310106",
	"name": "静安区"
}, {
	"id": "310107",
	"name": "普陀区"
}, {
	"id": "310109",
	"name": "虹口区"
}, {
	"id": "310110",
	"name": "杨浦区"
}, {
	"id": "310112",
	"name": "闵行区"
}, {
	"id": "310113",
	"name": "宝山区"
}, {
	"id": "310114",
	"name": "嘉定区"
}, {
	"id": "310115",
	"name": "浦东新区"
}, {
	"id": "310116",
	"name": "金山区"
}, {
	"id": "310117",
	"name": "松江区"
}, {
	"id": "310118",
	"name": "青浦区"
}, {
	"id": "310120",
	"name": "奉贤区"
}, {
	"id": "310230",
	"name": "崇明区"
}]

var bank = [{
	"id": "10200",
	"name": "中国工商银行"
}, {
	"id": "10300",
	"name": "中国农业银行"
}, {
	"id": "10400",
	"name": "中国银行"
}, {
	"id": "10500",
	"name": "中国建设银行"
}, {
	"id": "30100",
	"name": "交通银行"
}, {
	"id": "40300",
	"name": "中国邮政储蓄银行"
}, {
	"id": "30300",
	"name": "中国光大银行"
}, {
	"id": "30800",
	"name": "招商银行"
}, {
	"id": "31000",
	"name": "上海浦东发展银行"
}, {
	"id": "32000",
	"name": "上海农村商业银行"
}, {
	"id": "40129",
	"name": "上海银行"
}]

var job = [{
	"id": "11",
	"name": "国家公务员（包括参照、依照公务员管理的人员）"
}, {
	"id": "12",
	"name": "机关工勤人员"
}, {
	"id": "13",
	"name": "事业单位管理人员"
}, {
	"id": "14",
	"name": "事业单位专业技术人员"
}, {
	"id": "15",
	"name": "事业单位工勤人员"
}, {
	"id": "21",
	"name": "企业经营管理人员"
}, {
	"id": "22",
	"name": "企业专业技术人员"
}, {
	"id": "24",
	"name": "工人"
}, {
	"id": "27",
	"name": "农民工"
}, {
	"id": "31",
	"name": "学生"
}, {
	"id": "37",
	"name": "现役军人"
}, {
	"id": "51",
	"name": "自由职业者"
}, {
	"id": "54",
	"name": "个体经营者"
}, {
	"id": "70",
	"name": "无业人员"
}, {
	"id": "80",
	"name": "退(离)休人员"
}, {
	"id": "81",
	"name": "外国人"
}]