var perjsonStr1 = [
	    {
	        "stuffName": "本市户籍失业登记",
	        "code": "310750019000",
	        "type":"bssydj",
	    
	    },
];
var perjsonStr4 = [
	    {
	        "stuffName": "本市户籍失业登记",
	        "code": "310750019000",
	        "type":"bssydj",
		    
		},
		{
		   "stuffName": "本市户籍失业登记续登",
	        "code": "310750019000",
	        "type":"bssydjxd",
	        
	    },
		{
		   "stuffName": "来沪人员失业登记",
	        "code": "310750019000",
	        "type":"lhsydj",

	    }

];
//办证单位地址
var bankList = [
	{
		key:'000001',
		val:'上海银行'
	},
	{
		key:'000002',
		val:'农业银行'
	},
	{
		key:'000003',
		val:'工商银行'
	},
	{
		key:'000005',
		val:'邮政局'
	},
	{
		key:'000011',
		val:'农村商业银行'
	},
	{
		key:'000018',
		val:'中国银行'
	},
	{
		key:'000008',
		val:'建设银行'
	}
	
];

//健康状况字典
var healthList = [
	{
		key:'1',
		val:'健康或良好'
	},
	{
		key:'2',
		val:'一般或较弱'
	},
	{
		key:'3',
		val:'有病'
	},
	{
		key:'4',
		val:'有生理缺陷'
	},
	{
		key:'5',
		val:'残疾'
	},
]

//失业原因字典
var unemploymentList = [
	
		{"key":"10","val":"年满16周岁，从各类学校毕业、肄业"},
		{"key":"20","val":"从企业、机关、事业单位等各类用人单位失业"},
		{"key":"21","val":"被企业解除或终止劳动关系"},
		{"key":"22","val":"企业破产倒闭终止劳动关系"},
		{"key":"23","val":"从机关事业单位被辞退解聘"},
		{"key":"24","val":"从各类单位辞职"},
		{"key":"31","val":"退出个体经营"},
		{"key":"32","val":"私营企业业主停业、破产停止经营"},
		{"key":"33","val":"退出灵活就业"},
		{"key":"40","val":"退出公益性岗位"},
		{"key":"50","val":"符合当地规定条件,承包土地被征用等情况（含转产渔民和牧民）"},
		{"key":"60","val":"军人退出现役且未纳入国家统一安置"},
		{"key":"70","val":"刑满释放、假释、监外执行"},
		{"key":"90","val":"其他"}
		
]
//求职意向
var intentionList =
 [
	{"key":"1","val":"单位就业"},
	{"key":"2","val":"灵活就业"},
	{"key":"3","val":"创业"},
	{"key":"4","val":"职业培训"}
]
//残疾等级
var disabilityList = [
	{"key":"01","val":"伤残一级"},
	{"key":"02","val":"伤残二级"},
	{"key":"03","val":"伤残三级"},
	{"key":"04","val":"伤残四级"},
	{"key":"05","val":"伤残五级"},
	{"key":"06","val":"伤残六级"},
	{"key":"07","val":"伤残七级"},
	{"key":"08","val":"伤残八级"},
	{"key":"09","val":"伤残九级"},
	{"key":"10","val":"伤残十级"},
	{"key":"11","val":"未达等级"}
	]
//失业保险标志
var unemployTagList = [
	{"key":"1","val":"是"},
	{"key":"2","val":"否"},
]
//目前意向
var nowIntentionList = [
	{"key":"0","val":"无需意向分类"},
	{"key":"1","val":"就业条件较弱"},
	{"key":"2","val":"有创业意向"},
	{"key":"3","val":"就业条件较好"},
	{"key":"4","val":"就业条件一般"}
	]