/*****脚本*****/
// 178社区
var shequ = [{
	"dept": '市残联',
	"itemname": '《上海市盲人证》申请',
	"url": '312090153000',
	"degree": '4'
}, {
	"dept": '市残联',
	"itemname": '《中华人民共和国残疾人证》申领',
	"url": '312090147000',
	"degree": '4'
}, {
	"dept": '市残联',
	"itemname": '听力、言语残疾人信息卡套餐服务申请',
	"url": '312090154000',
	"degree": '4'
}, {
	"dept": '市残联',
	"itemname": ' 视力残疾人固话优惠申请',
	"url": '312090155000',
	"degree": '4'
}, {
	"dept": '市残联',
	"itemname": '残疾人居家养护服务申请',
	"url": '312090145000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '城乡重残居民医保人员门急诊医疗费补贴申请',
	"url": '312090146000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '重残无业人员机构养护服务申请',
	"url": '312090148000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '贫困成年肢体残疾人及肢体残疾儿童肢体矫治手术补助申请',
	"url": '312090149000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '城乡重残居民医保人员门诊大病（住院）及住院起付线补贴申请',
	"url": '312090150000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '0-16岁残疾儿童阳光宝宝卡申领',
	"url": '312090170000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '0-16岁残疾儿童康复训练补贴申请',
	"url": '312090171000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '上海市残疾人交通补贴申请',
	"url": '312090152000',
	"degree": '2'
}, {
	"dept": '市残联',
	"itemname": '残疾评定预约日期查询、变更',
	"url": '312090191000',
	"degree": '1'
}, {
	"dept": '市档案局',
	"itemname": '婚姻登记档案查询',
	"url": '312090156000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '独生子女证档案查询',
	"url": '312090157000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '知青上山下乡档案查询',
	"url": '312090158000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '知青返城档案查询',
	"url": '312090159000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '知青子女入户档案查询',
	"url": '312090160000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '再生育子女审批档案查询',
	"url": '312090161000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '工伤认定档案查询',
	"url": '312090162000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '学籍档案查询',
	"url": '312090163000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '兵役档案查询',
	"url": '312090164000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '复员退伍军人档案查询',
	"url": '312090165000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '三峡移民档案查询',
	"url": '312090166000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '人才引进审批档案查询',
	"url": '312090167000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '涉外婚姻登记档案查询',
	"url": '312090187000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '市级人才引进审批档案查询',
	"url": '312090186000',
	"degree": '2'
}, {
	"dept": '市档案局',
	"itemname": '专业技术干部的农村家属迁往城镇审批档案查询',
	"url": '312090185000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '居住证签注',
	"url": '',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '居住证信息变更',
	"url": '312090003000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '上海市临时居住证退证',
	"url": '312090009000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡发放',
	"url": '312090173000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡开通',
	"url": '312090174000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡正式挂失',
	"url": '312090175000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡解挂失',
	"url": '312090176000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡即时补换',
	"url": '312090178000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡社保密码重置、修改和解锁',
	"url": '',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡卡内信息更新',
	"url": '312090180000',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '老版社保卡事务处理申请',
	"url": '',
	"degree": '3'
}, {
	"dept": '市公安局',
	"itemname": '居住证新办（发放）',
	"url": '312090001000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '居住证补卡',
	"url": '312090006000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '居住登记',
	"url": '312090007000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '居住登记信息变更',
	"url": '312090008000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '新版社保卡申领',
	"url": '312090172000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '敬老卡申领、发放',
	"url": '',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '户籍人户分离人员居住登记受理',
	"url": '312090016000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '户籍人户分离人员居住登记注销',
	"url": '312090017000',
	"degree": '2'
}, {
	"dept": '市公安局',
	"itemname": '居住证挂失',
	"url": '312090004000',
	"degree": '1'
}, {
	"dept": '市公安局',
	"itemname": '居住证解挂',
	"url": '312090005000',
	"degree": '1'
}, {
	"dept": '市公安局',
	"itemname": '老版社保卡挂失、解挂（激活）',
	"url": '',
	"degree": '1'
}, {
	"dept": '市经信委',
	"itemname": '市民网上实名认证服务',
	"url": '',
	"degree": '1'
}, {
	"dept": '市粮食局',
	"itemname": '副食品价格补贴申请',
	"url": '312090127000',
	"degree": '2'
}, {
	"dept": '市粮食局',
	"itemname": '副食品价格补贴补差申请',
	"url": '312090128000',
	"degree": '2'
}, {
	"dept": '市粮食局',
	"itemname": '副食品价格补贴补差金额调整申请',
	"url": '312090129000',
	"degree": '2'
}, {
	"dept": '市粮食局',
	"itemname": '在职少数民族副食品价格补贴申请',
	"url": '312090130000',
	"degree": '2'
}, {
	"dept": '市粮食局',
	"itemname": '凭帮困粮油供应卡享受的副食品价格补贴申请',
	"url": '312090131000',
	"degree": '2'
}, {
	"dept": '市粮食局',
	"itemname": '副食品价格补贴注销申请',
	"url": '312090132000',
	"degree": '2'
}, {
	"dept": '市粮食局',
	"itemname": '副食品价格补贴发放银行卡维护',
	"url": '312090133000',
	"degree": '2'
}, {
	"dept": '市粮食局',
	"itemname": '副食品价格补贴发放信息查询',
	"url": '312090134000',
	"degree": '1'
}, {
	"dept": '市民政局',
	"itemname": '救济对象定期定量补贴申请',
	"url": '312090018000',
	"degree": '3'
}, {
	"dept": '市民政局',
	"itemname": '城乡居民最低生活保障申请',
	"url": '312090019000',
	"degree": '3'
}, {
	"dept": '市民政局',
	"itemname": '因病支出型贫困家庭生活救助申请',
	"url": '312090020000',
	"degree": '3'
}, {
	"dept": '市民政局',
	"itemname": '住院医疗救助申请',
	"url": '312090021000',
	"degree": '3'
}, {
	"dept": '市民政局',
	"itemname": '重残无业人员生活补助申请',
	"url": '312090022000',
	"degree": '3'
}, {
	"dept": '市民政局',
	"itemname": '困难残疾人生活补贴',
	"url": '312090024000',
	"degree": '2'
}, {
	"dept": '市民政局',
	"itemname": '重度残疾人护理补贴',
	"url": '312090025000',
	"degree": '2'
}, {
	"dept": '市民政局',
	"itemname": '享受民政社会救助项目证明出具',
	"url": '312090023000',
	"degree": '1'
}, {
	"dept": '市人社局',
	"itemname": '失业登记（本市户籍）/（非本市户籍）',
	"url": '312090042000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '就业困难人员申请',
	"url": '312090057000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '就业困难人员退出申请',
	"url": '312090044000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '个人申领郊区农村富余劳动力跨区非农就业补贴申请',
	"url": '312090046000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '劳动者个人基本信息查询及维护',
	"url": '312090047000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '低收入农户就业补贴申请',
	"url": '312090048000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请失业补助金',
	"url": '312090052000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请协保人员就业岗位补贴',
	"url": '312090053000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请大龄失业就业岗位补贴',
	"url": '312090054000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请“就业困难人员”灵活就业社会保险费补贴',
	"url": '312090055000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请失业丧劳特困医疗补助',
	"url": '312090056000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请元旦、春节期间家庭生活困难失业人员一次性补助',
	"url": '312090058000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员办理养老保险个人账户转入',
	"url": '312090061000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员办理养老保险个人账户转出',
	"url": '312090063000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员养老保险个人账户封存',
	"url": '312090065000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '异地居住退休人员领取养老金资格协助认证',
	"url": '312090067000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '生育保险待遇申领',
	"url": '312090072000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）养老待遇封存',
	"url": '312090082000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '工伤人员工伤伤残待遇申领',
	"url": '312090084000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '工伤人员工伤保险医疗待遇申领',
	"url": '312090085000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '工伤人员一次性工伤医疗补助金待遇申领',
	"url": '312090086000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '工伤人员假牙配置费用申领',
	"url": '312090087000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '工伤保险待遇暂停',
	"url": '312090088000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '工伤保险待遇终止',
	"url": '312090090000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保养老待遇领取资格认证手续',
	"url": '312090107000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保暂停发放申报手续',
	"url": '312090108000',
	"degree": '4'
}, {
	"dept": '市人社局',
	"itemname": '因工死亡工伤保险待遇申领',
	"url": '312090073000',
	"degree": '3'
}, {
	"dept": '市人社局',
	"itemname": '个人办理养老待遇终止手续',
	"url": '312090074000',
	"degree": '3'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）养老保险个人账户终止',
	"url": '312090075000',
	"degree": '3'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）申领一次性计划生育奖励费',
	"url": '312090076000',
	"degree": '3'
}, {
	"dept": '市人社局',
	"itemname": '非因工死亡职工的遗属申领生活困难补助费',
	"url": '312090077000',
	"degree": '3'
}, {
	"dept": '市人社局',
	"itemname": '办理《就业创业证》（本市户籍）/（非本市户籍）',
	"url": '312090043000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业登记',
	"url": '312090045000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '来沪人员灵活就业登记',
	"url": '312090049000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请延长领取失业保险金',
	"url": '312090050000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请丧葬补助金和抚恤金',
	"url": '312090051000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员养老保险个人账户启封',
	"url": '312090066000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员、停止缴费人员完全丧失劳动能力提前退休申领养老金',
	"url": '312090068000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员、停止缴费人员特殊工种提前退休申领养老金',
	"url": '312090069000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员申领养老金',
	"url": '312090070000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '停止缴费人员申领养老金',
	"url": '312090071000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）养老保险个人账户关键信息调整',
	"url": '312090079000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）养老保险个人账户基本信息调整',
	"url": '312090080000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）申领一次性补充养老金',
	"url": '312090081000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）养老待遇启封',
	"url": '312090083000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '工伤保险待遇恢复',
	"url": '312090089000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '参保人员（个人）养老保险个人账户记账信息调整',
	"url": '312090091000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '传递《上海市因病劳动能力丧失程度鉴定申请表》',
	"url": '312090093000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保个人参保登记手续',
	"url": '312090094000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保个人变更登记手续',
	"url": '312090095000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请外省市城乡居保转入城乡居保手续',
	"url": '312090096000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请外省市职保转入城乡居保手续',
	"url": '312090097000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保个人缴费申报手续',
	"url": '312090099000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保个人补缴申报手续',
	"url": '312090100000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保退费申请手续',
	"url": '312090101000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保停止缴费申报手续',
	"url": '312090102000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保恢复缴费申报手续',
	"url": '312090103000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保延续缴费申报手续',
	"url": '312090104000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保预折算信息确认手续',
	"url": '312090105000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请领取城乡居保养老金手续',
	"url": '312090106000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保恢复发放申报手续',
	"url": '312090109000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保注销登记手续',
	"url": '312090110000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '申请办理城乡居保领取人信息变更手续',
	"url": '312090111000',
	"degree": '2'
}, {
	"dept": '市人社局',
	"itemname": '灵活就业人员办理社会保险登记参保',
	"url": '312090059000',
	"degree": '1'
}, {
	"dept": '市人社局',
	"itemname": '提供个市人社局会保险咨询和参保情况查询及个人参保资料（含个人缴费凭证）打印服务',
	"url": '',
	"degree": '1'
}, {
	"dept": '市人社局',
	"itemname": '养老金卡（折）调整',
	"url": '312090092000',
	"degree": '1'
}, {
	"dept": '市人社局',
	"itemname": '申请打印城乡居保核定表',
	"url": '312090112000',
	"degree": '1'
}, {
	"dept": '市税务局',
	"itemname": '城乡居民基本养老保险缴费银行卡信息采集',
	"url": '312090183000',
	"degree": '4'
}, {
	"dept": '市税务局',
	"itemname": '城乡居民基本养老保险缴费银行卡解除',
	"url": '312090184000',
	"degree": '4'
}, {
	"dept": '市税务局',
	"itemname": '城乡居民基本医疗保险缴费',
	"url": '',
	"degree": '4'
}, {
	"dept": '市卫健委',
	"itemname": '受理再生育子女申请',
	"url": '312090116000',
	"degree": '4'
}, {
	"dept": '市卫健委',
	"itemname": '申领年老退休时一次性计划生育奖励费',
	"url": '312090117000',
	"degree": '4'
}, {
	"dept": '市卫健委',
	"itemname": '申办《免费计划生育技术服务记帐通知单》',
	"url": '312090113000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '申领《独生子女父母光荣证》',
	"url": '312090114000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '换领《独生子女父母光荣证》',
	"url": '312090115000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '补领《独生子女父母光荣证》',
	"url": '312090118000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '《独生子女父母光荣证》注销和退回',
	"url": '312090121000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '办理来沪人员生育情况证明',
	"url": '312090119000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '申请享受生育保险待遇计划生育情况审核',
	"url": '312090120000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '办理《上海市生育登记服务单》',
	"url": '312090122000',
	"degree": '2'
}, {
	"dept": '市卫健委',
	"itemname": '打印流动人口电子婚育证明',
	"url": '312090123000',
	"degree": '2'
}, {
	"dept": '市医保局',
	"itemname": '办理互助帮困人员登记',
	"url": '312090028000',
	"degree": '4'
}, {
	"dept": '市医保局',
	"itemname": '办理互助帮困人员缴费',
	"url": '312090189000',
	"degree": '4'
}, {
	"dept": '市医保局',
	"itemname": '办理门诊大病事项登记及撤销',
	"url": '312090029000',
	"degree": '4'
}, {
	"dept": '市医保局',
	"itemname": '办理医保专项治疗登记与撤销',
	"url": '312090038000',
	"degree": '4'
}, {
	"dept": '市医保局',
	"itemname": '办理《社会保障卡（医疗保险专用）》制卡、补卡',
	"url": '312090026000',
	"degree": '2'
}, {
	"dept": '市医保局',
	"itemname": '办理互助帮困人员制卡',
	"url": '312090030000',
	"degree": '2'
}, {
	"dept": '市医保局',
	"itemname": '办理就医记录册的申领、更换、补发',
	"url": '',
	"degree": '2'
}, {
	"dept": '市医保局',
	"itemname": '办理离休干部定点医院变更及转诊手续',
	"url": '312090033000',
	"degree": '2'
}, {
	"dept": '市医保局',
	"itemname": '办理结算服务项目的相关手续',
	"url": '312090035000',
	"degree": '2'
}, {
	"dept": '市医保局',
	"itemname": '办理居民市医保局受理登记',
	"url": '',
	"degree": '2'
}, {
	"dept": '市医保局',
	"itemname": '办理参保人及委托人信息变更事项',
	"url": '',
	"degree": '1'
}, {
	"dept": '市医保局',
	"itemname": '办理医保网站密码申请及变更',
	"url": '312090032000',
	"degree": '1'
}, {
	"dept": '市医保局',
	"itemname": '办理医疗卡书面挂失及撤销',
	"url": '',
	"degree": '1'
}, {
	"dept": '市医保局',
	"itemname": '长期护理保险相关事务申请',
	"url": '312090037000',
	"degree": '1'
}, {
	"dept": '市医保局',
	"itemname": '办理就医关系转移相关手续',
	"url": '',
	"degree": '1'
}, {
	"dept": '市医保局',
	"itemname": '个人信息查询',
	"url": '',
	"degree": '1'
}, {
	"dept": '市医保局',
	"itemname": '办理跨省异地就医登记备案相关手续',
	"url": '',
	"degree": '1'
}, {
	"dept": '市住建委',
	"itemname": '居住房屋租赁合同登记备案',
	"url": '',
	"degree": '4'
}, {
	"dept": '市住建委',
	"itemname": '廉租住房申请审核',
	"url": '312090125000',
	"degree": '4'
}, {
	"dept": '市住建委',
	"itemname": '共有产权保障住房申请',
	"url": '312090126000',
	"degree": '4'
}, {
	"dept": '市住建委',
	"itemname": '个人住房公积金信息查询',
	"url": '',
	"degree": '1'
}, {
	"dept": '市总工会',
	"itemname": '本市支援外地建设退休（职）回沪定居人员帮困补助',
	"url": '',
	"degree": '4'
}, {
	"dept": '市总工会',
	"itemname": '《退休住院计划》给付受理',
	"url": '',
	"degree": '2'
}, {
	"dept": '市总工会',
	"itemname": '《退休住院计划》参保受理',
	"url": '312090135000',
	"degree": '1'
}, {
	"dept": '市总工会',
	"itemname": '《女职工特种计划》参保与给付受理',
	"url": '312090136000',
	"degree": '1'
}, {
	"dept": '市总工会',
	"itemname": '《特种重病计划》参保与给付受理',
	"url": '312090138000',
	"degree": '1'
}, {
	"dept": '市总工会',
	"itemname": '《在职住院计划》参保与给付受理',
	"url": '312090139000',
	"degree": '1'
}, {
	"dept": '市总工会',
	"itemname": '《意外伤害计划》参保与给付受理',
	"url": '312090140000',
	"degree": '1'
}, {
	"dept": '市总工会',
	"itemname": '《从业伤残计划》参保与给付受理',
	"url": '312090141000',
	"degree": '1'
}, {
	"dept": '市总工会',
	"itemname": '《退休住院计划》参保代扣款受理',
	"url": '312090142000',
	"degree": '1'
}, ];

// 事务受理中心
var center = [{
	"id": '31010100200001',
	"shortname": '南京东路街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010101300001',
	"shortname": '外滩街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010101500001',
	"shortname": '半淞园街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010101700001',
	"shortname": '小东门街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010101800001',
	"shortname": '豫园街道社区事务受理服务中心',
	"parentid": '310101000000'
}, {
	"id": '31010101900001',
	"shortname": '老西门街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010102000001',
	"shortname": '五里桥街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010102100001',
	"shortname": '打浦桥街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010102200001',
	"shortname": '淮海中路街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010102300001',
	"shortname": '瑞金二路街道社区事务受理中心',
	"parentid": '310101000000'
}, {
	"id": '31010400300001',
	"shortname": '天平路街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010400400001',
	"shortname": '湖南路街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010400700001',
	"shortname": '斜土路街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010400800001',
	"shortname": '枫林路街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401000001',
	"shortname": '长桥街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401100001',
	"shortname": '田林街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401200001',
	"shortname": '虹梅路街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401300001',
	"shortname": '康健新村街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401400001',
	"shortname": '徐家汇街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401500001',
	"shortname": '凌云路街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401600001',
	"shortname": '龙华街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010401700001',
	"shortname": '漕河泾街道社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010410300001',
	"shortname": '华泾镇社区事务受理中心',
	"parentid": '310104000000'
}, {
	"id": '31010500100001',
	"shortname": '华阳路街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010500200001',
	"shortname": '江苏路街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010500400001',
	"shortname": '新华路街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010500500001',
	"shortname": '周家桥街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010500600001',
	"shortname": '天山路街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010500800001',
	"shortname": '仙霞新村街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010500900001',
	"shortname": '虹桥街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010501000001',
	"shortname": '程家桥街道社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010501100001',
	"shortname": '北新泾街道社区事务受理服务中心',
	"parentid": '310105000000'
}, {
	"id": '31010510200001',
	"shortname": '新泾镇社区事务受理中心',
	"parentid": '310105000000'
}, {
	"id": '31010600600001',
	"shortname": '江宁路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010601100001',
	"shortname": '石门二路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010601200001',
	"shortname": '南京西路街道社区事务受理服务中心',
	"parentid": '310106000000'
}, {
	"id": '31010601300001',
	"shortname": '静安寺街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010601400001',
	"shortname": '曹家渡街道社区事务受理服务中心',
	"parentid": '310106000000'
}, {
	"id": '31010700500001',
	"shortname": '曹杨新村街道社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010701400001',
	"shortname": '长风新村街道社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010701500001',
	"shortname": '长寿路街道社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010701600001',
	"shortname": '甘泉路街道社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010701700001',
	"shortname": '石泉路街道社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010702000001',
	"shortname": '宜川路街道社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010710100001',
	"shortname": '真如镇街道社区事务受理服务中心',
	"parentid": '310107000000'
}, {
	"id": '31010710200001',
	"shortname": '长征镇社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010710300001',
	"shortname": '桃浦镇社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010713000001',
	"shortname": '万里社区事务受理中心',
	"parentid": '310107000000'
}, {
	"id": '31010800100001',
	"shortname": '天目西路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010800600001',
	"shortname": '北站街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010800700001',
	"shortname": '宝山路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010801200001',
	"shortname": '共和新路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010801300001',
	"shortname": '大宁路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010801400001',
	"shortname": '彭浦新村街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010801500001',
	"shortname": '临汾路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010801600001',
	"shortname": '芷江西路街道社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010810100001',
	"shortname": '彭浦镇社区事务受理中心',
	"parentid": '310106000000'
}, {
	"id": '31010900900001',
	"shortname": '欧阳路街道社区事务受理中心',
	"parentid": '310109000000'
}, {
	"id": '31010901000001',
	"shortname": '曲阳路街道社区事务受理中心',
	"parentid": '310109000000'
}, {
	"id": '31010901100001',
	"shortname": '广中路街道社区事务受理中心',
	"parentid": '310109000000'
}, {
	"id": '31010901400001',
	"shortname": '嘉兴路街道社区事务受理中心',
	"parentid": '310109000000'
}, {
	"id": '31010901600001',
	"shortname": '凉城新村街道社区事务受理中心',
	"parentid": '310109000000'
}, {
	"id": '31010901700001',
	"shortname": '四川北路街道社区事务受理中心',
	"parentid": '310109000000'
}, {
	"id": '31010901800001',
	"shortname": '北外滩街道社区事务受理服务中心',
	"parentid": '310109000000'
}, {
	"id": '31010901900001',
	"shortname": '江湾镇街道社区事务受理中心',
	"parentid": '310109000000'
}, {
	"id": '31011000100001',
	"shortname": '定海路街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011000600001',
	"shortname": '平凉路街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011000800001',
	"shortname": '江浦路街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011000900001',
	"shortname": '四平路街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011001200001',
	"shortname": '控江路街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011001300001',
	"shortname": '长白新村街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011001500001',
	"shortname": '延吉新村街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011001600001',
	"shortname": '殷行街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011001800001',
	"shortname": '大桥街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011001900001',
	"shortname": '五角场街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011002000001',
	"shortname": '新江湾城街道社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011010100001',
	"shortname": '五角场镇社区事务受理中心',
	"parentid": '310110000000'
}, {
	"id": '31011200100001',
	"shortname": '江川路街道社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011200600001',
	"shortname": '古美路街道社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011200800001',
	"shortname": '新虹街道社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011200900001',
	"shortname": '浦锦街道社区事务受理服务中心',
	"parentid": '310112000000'
}, {
	"id": '31011210100001',
	"shortname": '莘庄镇社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011210200001',
	"shortname": '七宝镇社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011210300001',
	"shortname": '颛桥镇社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011210600001',
	"shortname": '华漕镇(诸翟镇)社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011210700001',
	"shortname": '虹桥镇社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011210800001',
	"shortname": '梅陇镇社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011211000001',
	"shortname": '吴泾镇社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011211200001',
	"shortname": '马桥镇社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011211400001',
	"shortname": '浦江镇陈行社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011250100001',
	"shortname": '莘庄工业区社区事务受理中心',
	"parentid": '310112000000'
}, {
	"id": '31011300300001',
	"shortname": '友谊路街道社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011300700001',
	"shortname": '吴淞街道社区事务受理服务中心',
	"parentid": '310113000000'
}, {
	"id": '31011300800001',
	"shortname": '张庙街道社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011310100001',
	"shortname": '罗店镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011310200001',
	"shortname": '大场镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011310300001',
	"shortname": '杨行镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011310400001',
	"shortname": '月浦镇社区事务受理服务中心',
	"parentid": '310113000000'
}, {
	"id": '31011310600001',
	"shortname": '罗泾镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011310900001',
	"shortname": '顾村镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011311100001',
	"shortname": '高境镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011311200001',
	"shortname": '庙行镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011311300001',
	"shortname": '淞南镇社区事务受理中心',
	"parentid": '310113000000'
}, {
	"id": '31011400100001',
	"shortname": '新成路街道社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011400200001',
	"shortname": '真新街道社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011400300001',
	"shortname": '菊园新区社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011400400001',
	"shortname": '嘉定镇街道社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011410200001',
	"shortname": '南翔镇社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011410300001',
	"shortname": '安亭镇社区事务受理服务中心',
	"parentid": '310114000000'
}, {
	"id": '31011410600001',
	"shortname": '嘉定新城（马陆镇）社区事务受理服务中心',
	"parentid": '310114000000'
}, {
	"id": '31011410900001',
	"shortname": '徐行镇社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011411100001',
	"shortname": '华亭镇社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011411400001',
	"shortname": '外冈镇社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011411800001',
	"shortname": '江桥镇社区事务受理中心',
	"parentid": '310114000000'
}, {
	"id": '31011450100001',
	"shortname": '嘉定工业区社区事务受理中心(南区)',
	"parentid": '310114000000'
}, {
	"id": '31011500400001',
	"shortname": '潍坊新村街道社区事务受理服务中心',
	"parentid": '310115000000'
}, {
	"id": '31011500500001',
	"shortname": '陆家嘴街道社区事务受理服务中心',
	"parentid": '310115000000'
}, {
	"id": '31011500700001',
	"shortname": '周家渡街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011500800001',
	"shortname": '塘桥街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011500900001',
	"shortname": '上钢新村街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011501000001',
	"shortname": '南码头街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011501100001',
	"shortname": '沪东新村街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011501200001',
	"shortname": '金杨新村街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011501300001',
	"shortname": '洋泾街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011501400001',
	"shortname": '浦兴路街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011501500001',
	"shortname": '东明路街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011501600001',
	"shortname": '花木街道社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011510300001',
	"shortname": '川沙新镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011510400001',
	"shortname": '高桥镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011510500001',
	"shortname": '北蔡镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011511000001',
	"shortname": '合庆镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011511400001',
	"shortname": '唐镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011511700001',
	"shortname": '曹路镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011512000001',
	"shortname": '金桥镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011512100001',
	"shortname": '高行镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011512300001',
	"shortname": '高东镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011512500001',
	"shortname": '张江镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513000001',
	"shortname": '三林镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513100001',
	"shortname": '惠南镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513200001',
	"shortname": '周浦镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513300001',
	"shortname": '新场镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513400001',
	"shortname": '大团镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513600001',
	"shortname": '康桥镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513700001',
	"shortname": '航头镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011513900001',
	"shortname": '祝桥镇社区事务受理服务中心',
	"parentid": '310115000000'
}, {
	"id": '31011514000001',
	"shortname": '泥城镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011514100001',
	"shortname": '宣桥镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011514200001',
	"shortname": '书院镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011514300001',
	"shortname": '万祥镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011514400001',
	"shortname": '老港镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011514500001',
	"shortname": '南汇新城镇社区事务受理中心',
	"parentid": '310115000000'
}, {
	"id": '31011600100001',
	"shortname": '石化街道社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011610100001',
	"shortname": '朱泾镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011610200001',
	"shortname": '枫泾镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011610300001',
	"shortname": '张堰镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011610400001',
	"shortname": '亭林镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011610500001',
	"shortname": '吕巷镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011610700001',
	"shortname": '廊下镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011610900001',
	"shortname": '金山卫镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011611200001',
	"shortname": '漕泾镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011611300001',
	"shortname": '山阳镇社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011650300001',
	"shortname": '金山工业区社区事务受理中心',
	"parentid": '310116000000'
}, {
	"id": '31011700100001',
	"shortname": '岳阳街道社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011700200001',
	"shortname": '永丰街道社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011700300001',
	"shortname": '方松街道社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011700400001',
	"shortname": '中山街道社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011700500001',
	"shortname": '广富林街道社区事务受理服务中心',
	"parentid": '310117000000'
}, {
	"id": '31011700600001',
	"shortname": '九里亭街道社区事务受理服务中心',
	"parentid": '310117000000'
}, {
	"id": '31011710200001',
	"shortname": '泗泾镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011710300001',
	"shortname": '佘山镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011710400001',
	"shortname": '车墩镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011710500001',
	"shortname": '新桥镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011710600001',
	"shortname": '洞泾镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011710700001',
	"shortname": '九亭镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011710900001',
	"shortname": '泖港镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011711600001',
	"shortname": '石湖荡镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011711700001',
	"shortname": '新浜镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011712000001',
	"shortname": '叶榭镇社区事务受理中心',
	"parentid": '310117000000'
}, {
	"id": '31011712100001',
	"shortname": '小昆山镇社区事务受理服务中心',
	"parentid": '310117000000'
}, {
	"id": '31011800100001',
	"shortname": '夏阳街道社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011800200001',
	"shortname": '盈浦街道社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011800300001',
	"shortname": '香花桥镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011810200001',
	"shortname": '朱家角镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011810300001',
	"shortname": '练塘镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011810400001',
	"shortname": '金泽镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011810500001',
	"shortname": '赵巷镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011810600001',
	"shortname": '徐泾镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011810700001',
	"shortname": '华新镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011810900001',
	"shortname": '重固镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31011811000001',
	"shortname": '白鹤镇社区事务受理中心',
	"parentid": '310118000000'
}, {
	"id": '31012010100001',
	"shortname": '南桥镇社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012010200001',
	"shortname": '奉城镇社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012010400001',
	"shortname": '庄行镇社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012010600001',
	"shortname": '金汇镇社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012010900001',
	"shortname": '四团镇社区事务受理服务中心',
	"parentid": '310120000000'
}, {
	"id": '31012011100001',
	"shortname": '青村镇社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012011800001',
	"shortname": '柘林镇社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012012300001',
	"shortname": '海湾镇社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012041200001',
	"shortname": '西渡街道社区事务受理服务中心',
	"parentid": '310120000000'
}, {
	"id": '31012050100001',
	"shortname": '奉浦街道社区事务受理服务中心',
	"parentid": '310120000000'
}, {
	"id": '31012050300001',
	"shortname": '海湾旅游区社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31012050400001',
	"shortname": '金海社区社区事务受理中心',
	"parentid": '310120000000'
}, {
	"id": '31023010100001',
	"shortname": '城桥镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023010200001',
	"shortname": '堡镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023010300001',
	"shortname": '新河镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023010400001',
	"shortname": '庙镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023010600001',
	"shortname": '竖新镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023010700001',
	"shortname": '向化镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023010900001',
	"shortname": '三星镇社区事务受理服务中心',
	"parentid": '310230000000'
}, {
	"id": '31023011300001',
	"shortname": '港沿镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023011400001',
	"shortname": '中兴镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023011500001',
	"shortname": '陈家镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023011600001',
	"shortname": '绿华镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023011800001',
	"shortname": '港西镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023011900001',
	"shortname": '建设镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023012100001',
	"shortname": '新海镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023012200001',
	"shortname": '东平镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023012300001',
	"shortname": '长兴镇社区事务受理中心',
	"parentid": '310230000000'
}, {
	"id": '31023020100001',
	"shortname": '新村乡社区事务受理中心',
	"parentid": '310230000000'
}];

//民族
var nations = [{
		"id": '01',
		"shortname": '汉族'
	},
	{
		"id": '02',
		"shortname": '蒙古族'
	},
	{
		"id": '03',
		"shortname": '回族'
	},
	{
		"id": '04',
		"shortname": '藏族'
	},
	{
		"id": '05',
		"shortname": '维吾尔族'
	},
	{
		"id": '06',
		"shortname": '苗族'
	},
	{
		"id": '07',
		"shortname": '彝族'
	},
	{
		"id": '08',
		"shortname": '壮族'
	},
	{
		"id": '09',
		"shortname": '布依族'
	},
	{
		"id": '10',
		"shortname": '朝鲜族'
	},
	{
		"id": '11',
		"shortname": '满族'
	},
	{
		"id": '12',
		"shortname": '侗族'
	},
	{
		"id": '13',
		"shortname": '瑶族'
	},
	{
		"id": '14',
		"shortname": '白族'
	},
	{
		"id": '15',
		"shortname": '土家族'
	},
	{
		"id": '16',
		"shortname": '哈尼族'
	},
	{
		"id": '17',
		"shortname": '哈萨克族'
	},
	{
		"id": '18',
		"shortname": '傣族'
	},
	{
		"id": '19',
		"shortname": '黎族'
	},
	{
		"id": '20',
		"shortname": '傈傈族'
	},
	{
		"id": '21',
		"shortname": '佤族'
	},
	{
		"id": '22',
		"shortname": '畲族'
	},
	{
		"id": '23',
		"shortname": '高山族'
	},
	{
		"id": '24',
		"shortname": '拉祜族'
	},
	{
		"id": '25',
		"shortname": '水族'
	},
	{
		"id": '26',
		"shortname": '东乡族'
	},
	{
		"id": '27',
		"shortname": '纳西族'
	},
	{
		"id": '28',
		"shortname": '景颇族'
	},
	{
		"id": '29',
		"shortname": '柯尔克孜族'
	},
	{
		"id": '30',
		"shortname": '土族'
	},
	{
		"id": '31',
		"shortname": '达翰尔族'
	},
	{
		"id": '32',
		"shortname": '仫佬族'
	},
	{
		"id": '33',
		"shortname": '羌族'
	},
	{
		"id": '34',
		"shortname": '布朗族'
	},
	{
		"id": '35',
		"shortname": '撒拉族'
	},
	{
		"id": '36',
		"shortname": '毛南族'
	},
	{
		"id": '37',
		"shortname": '仡佬族'
	},
	{
		"id": '38',
		"shortname": '锡伯族'
	},
	{
		"id": '39',
		"shortname": '阿昌族'
	},
	{
		"id": '40',
		"shortname": '普米族'
	},
	{
		"id": '41',
		"shortname": '塔吉克族'
	},
	{
		"id": '42',
		"shortname": '怒族'
	},
	{
		"id": '43',
		"shortname": '乌孜别克族'
	},
	{
		"id": '44',
		"shortname": '俄罗斯族'
	},
	{
		"id": '45',
		"shortname": '鄂温克族'
	},
	{
		"id": '46',
		"shortname": '德昂族'
	},
	{
		"id": '47',
		"shortname": '保安族'
	},
	{
		"id": '48',
		"shortname": '裕固族'
	},
	{
		"id": '49',
		"shortname": '京族'
	},
	{
		"id": '50',
		"shortname": '塔塔尔族'
	},
	{
		"id": '51',
		"shortname": '独龙族'
	},
	{
		"id": '52',
		"shortname": '鄂伦春族'
	},
	{
		"id": '53',
		"shortname": '赫哲族'
	},
	{
		"id": '54',
		"shortname": '门巴族'
	},
	{
		"id": '55',
		"shortname": '珞巴族'
	},
	{
		"id": '56',
		"shortname": '基诺族'
	}
];

// 上海区县
var shCounty = [{
		"id": '310104000000',
		"shortname": '徐汇区',
		"parentid": '310000000000'
	},
	{
		"id": '310105000000',
		"shortname": '长宁区',
		"parentid": '310000000000'
	},
	{
		"id": '310106000000',
		"shortname": '静安区',
		"parentid": '310000000000'
	},
	{
		"id": '310107000000',
		"shortname": '普陀区',
		"parentid": '310000000000'
	},
	{
		"id": '310109000000',
		"shortname": '虹口区',
		"parentid": '310000000000'
	},
	{
		"id": '310110000000',
		"shortname": '杨浦区',
		"parentid": '310000000000'
	},
	{
		"id": '310112000000',
		"shortname": '闵行区',
		"parentid": '310000000000'
	},
	{
		"id": '310113000000',
		"shortname": '宝山区',
		"parentid": '310000000000'
	},
	{
		"id": '310114000000',
		"shortname": '嘉定区',
		"parentid": '310000000000'
	},
	{
		"id": '310115000000',
		"shortname": '浦东新区',
		"parentid": '310000000000'
	},
	{
		"id": '310116000000',
		"shortname": '金山区',
		"parentid": '310000000000'
	},
	{
		"id": '310117000000',
		"shortname": '松江区',
		"parentid": '310000000000'
	},
	{
		"id": '310118000000',
		"shortname": '青浦区',
		"parentid": '310000000000'
	},
	{
		"id": '310120000000',
		"shortname": '奉贤区',
		"parentid": '310000000000'
	},
	{
		"id": '310230000000',
		"shortname": '崇明区',
		"parentid": '310000000000'
	},
	{
		"id": '310101000000',
		"shortname": '黄浦区',
		"parentid": '310000000000'
	}
];

// 上海街道
var shStreet = [{
	"id": '310101002000',
	"shortname": '南京东路街道',
	"parentid": '310101000000'
}, {
	"id": '310101013000',
	"shortname": '外滩街道',
	"parentid": '310101000000'
}, {
	"id": '310101015000',
	"shortname": '半淞园路街道',
	"parentid": '310101000000'
}, {
	"id": '310101017000',
	"shortname": '小东门街道',
	"parentid": '310101000000'
}, {
	"id": '310101018000',
	"shortname": '豫园街道',
	"parentid": '310101000000'
}, {
	"id": '310101019000',
	"shortname": '老西门街道',
	"parentid": '310101000000'
}, {
	"id": '310101020000',
	"shortname": '五里桥街道',
	"parentid": '310101000000'
}, {
	"id": '310101021000',
	"shortname": '打浦桥街道',
	"parentid": '310101000000'
}, {
	"id": '310101022000',
	"shortname": '淮海中路街道',
	"parentid": '310101000000'
}, {
	"id": '310101023000',
	"shortname": '瑞金二路街道',
	"parentid": '310101000000'
}, {
	"id": '310104003000',
	"shortname": '天平路街道',
	"parentid": '310104000000'
}, {
	"id": '310104004000',
	"shortname": '湖南路街道',
	"parentid": '310104000000'
}, {
	"id": '310104007000',
	"shortname": '斜土路街道',
	"parentid": '310104000000'
}, {
	"id": '310104008000',
	"shortname": '枫林路街道',
	"parentid": '310104000000'
}, {
	"id": '310104010000',
	"shortname": '长桥街道',
	"parentid": '310104000000'
}, {
	"id": '310104011000',
	"shortname": '田林街道',
	"parentid": '310104000000'
}, {
	"id": '310104012000',
	"shortname": '虹梅路街道',
	"parentid": '310104000000'
}, {
	"id": '310104013000',
	"shortname": '康健新村街道',
	"parentid": '310104000000'
}, {
	"id": '310104014000',
	"shortname": '徐家汇街道',
	"parentid": '310104000000'
}, {
	"id": '310104015000',
	"shortname": '凌云路街道',
	"parentid": '310104000000'
}, {
	"id": '310104016000',
	"shortname": '龙华街道',
	"parentid": '310104000000'
}, {
	"id": '310104017000',
	"shortname": '漕河泾街道',
	"parentid": '310104000000'
}, {
	"id": '310104103000',
	"shortname": '华泾镇',
	"parentid": '310104000000'
}, {
	"id": '310104501000',
	"shortname": '漕河泾新兴技术开发区',
	"parentid": '310104000000'
}, {
	"id": '310105001000',
	"shortname": '华阳路街道',
	"parentid": '310105000000'
}, {
	"id": '310105002000',
	"shortname": '江苏路街道',
	"parentid": '310105000000'
}, {
	"id": '310105004000',
	"shortname": '新华路街道',
	"parentid": '310105000000'
}, {
	"id": '310105005000',
	"shortname": '周家桥街道',
	"parentid": '310105000000'
}, {
	"id": '310105006000',
	"shortname": '天山路街道',
	"parentid": '310105000000'
}, {
	"id": '310105008000',
	"shortname": '仙霞新村街道',
	"parentid": '310105000000'
}, {
	"id": '310105009000',
	"shortname": '虹桥街道',
	"parentid": '310105000000'
}, {
	"id": '310105010000',
	"shortname": '程家桥街道',
	"parentid": '310105000000'
}, {
	"id": '310105011000',
	"shortname": '北新泾街道',
	"parentid": '310105000000'
}, {
	"id": '310105102000',
	"shortname": '新泾镇',
	"parentid": '310105000000'
}, {
	"id": '310106001000',
	"shortname": '天目西路街道',
	"parentid": '310106000000'
}, {
	"id": '310106002000',
	"shortname": '北站街道',
	"parentid": '310106000000'
}, {
	"id": '310106006000',
	"shortname": '江宁路街道',
	"parentid": '310106000000'
}, {
	"id": '310106007000',
	"shortname": '宝山路街道',
	"parentid": '310106000000'
}, {
	"id": '310106008000',
	"shortname": '共和新路街道',
	"parentid": '310106000000'
}, {
	"id": '310106009000',
	"shortname": '大宁路街道',
	"parentid": '310106000000'
}, {
	"id": '310106010000',
	"shortname": '彭浦新村街道',
	"parentid": '310106000000'
}, {
	"id": '310106011000',
	"shortname": '石门二路街道',
	"parentid": '310106000000'
}, {
	"id": '310106012000',
	"shortname": '南京西路街道',
	"parentid": '310106000000'
}, {
	"id": '310106013000',
	"shortname": '静安寺街道',
	"parentid": '310106000000'
}, {
	"id": '310106014000',
	"shortname": '曹家渡街道',
	"parentid": '310106000000'
}, {
	"id": '310106015000',
	"shortname": '临汾路街道',
	"parentid": '310106000000'
}, {
	"id": '310106016000',
	"shortname": '芷江西路街道',
	"parentid": '310106000000'
}, {
	"id": '310106101000',
	"shortname": '彭浦镇',
	"parentid": '310106000000'
}, {
	"id": '310107005000',
	"shortname": '曹杨新村街道',
	"parentid": '310107000000'
}, {
	"id": '310107014000',
	"shortname": '长风新村街道',
	"parentid": '310107000000'
}, {
	"id": '310107015000',
	"shortname": '长寿路街道',
	"parentid": '310107000000'
}, {
	"id": '310107016000',
	"shortname": '甘泉路街道',
	"parentid": '310107000000'
}, {
	"id": '310107017000',
	"shortname": '石泉路街道',
	"parentid": '310107000000'
}, {
	"id": '310107020000',
	"shortname": '宜川路街道',
	"parentid": '310107000000'
}, {
	"id": '310107101000',
	"shortname": '真如镇',
	"parentid": '310107000000'
}, {
	"id": '310107102000',
	"shortname": '长征镇',
	"parentid": '310107000000'
}, {
	"id": '310107103000',
	"shortname": '桃浦镇',
	"parentid": '310107000000'
}, {
	"id": '310107104000',
	"shortname": '万里街道',
	"parentid": '310107000000'
}, {
	"id": '310109009000',
	"shortname": '欧阳路街道',
	"parentid": '310109000000'
}, {
	"id": '310109010000',
	"shortname": '曲阳路街道',
	"parentid": '310109000000'
}, {
	"id": '310109011000',
	"shortname": '广中路街道',
	"parentid": '310109000000'
}, {
	"id": '310109014000',
	"shortname": '嘉兴路街道',
	"parentid": '310109000000'
}, {
	"id": '310109016000',
	"shortname": '凉城新村街道',
	"parentid": '310109000000'
}, {
	"id": '310109017000',
	"shortname": '四川北路街道',
	"parentid": '310109000000'
}, {
	"id": '310109018000',
	"shortname": '提篮桥街道',
	"parentid": '310109000000'
}, {
	"id": '310109018001',
	"shortname": '北外滩街道',
	"parentid": '310109000000'
}, {
	"id": '310109019000',
	"shortname": '江湾镇街道',
	"parentid": '310109000000'
}, {
	"id": '310110001000',
	"shortname": '定海路街道',
	"parentid": '310110000000'
}, {
	"id": '310110006000',
	"shortname": '平凉路街道',
	"parentid": '310110000000'
}, {
	"id": '310110008000',
	"shortname": '江浦路街道',
	"parentid": '310110000000'
}, {
	"id": '310110009000',
	"shortname": '四平路街道',
	"parentid": '310110000000'
}, {
	"id": '310110012000',
	"shortname": '控江路街道',
	"parentid": '310110000000'
}, {
	"id": '310110013000',
	"shortname": '长白新村街道',
	"parentid": '310110000000'
}, {
	"id": '310110015000',
	"shortname": '延吉新村街道',
	"parentid": '310110000000'
}, {
	"id": '310110016000',
	"shortname": '殷行街道',
	"parentid": '310110000000'
}, {
	"id": '310110018000',
	"shortname": '大桥街道',
	"parentid": '310110000000'
}, {
	"id": '310110019000',
	"shortname": '五角场街道',
	"parentid": '310110000000'
}, {
	"id": '310110020000',
	"shortname": '新江湾城街道',
	"parentid": '310110000000'
}, {
	"id": '310110101000',
	"shortname": '五角场镇',
	"parentid": '310110000000'
}, {
	"id": '310112001000',
	"shortname": '江川路街道',
	"parentid": '310112000000'
}, {
	"id": '310112006000',
	"shortname": '古美街道',
	"parentid": '310112000000'
}, {
	"id": '310112008000',
	"shortname": '新虹街道',
	"parentid": '310112000000'
}, {
	"id": '310112090000',
	"shortname": '浦锦街道',
	"parentid": '310112000000'
}, {
	"id": '310112101000',
	"shortname": '莘庄镇',
	"parentid": '310112000000'
}, {
	"id": '310112102000',
	"shortname": '七宝镇',
	"parentid": '310112000000'
}, {
	"id": '310112103000',
	"shortname": '颛桥镇',
	"parentid": '310112000000'
}, {
	"id": '310112106000',
	"shortname": '华漕镇',
	"parentid": '310112000000'
}, {
	"id": '310112107000',
	"shortname": '虹桥镇',
	"parentid": '310112000000'
}, {
	"id": '310112108000',
	"shortname": '梅陇镇',
	"parentid": '310112000000'
}, {
	"id": '310112110000',
	"shortname": '吴泾镇',
	"parentid": '310112000000'
}, {
	"id": '310112112000',
	"shortname": '马桥镇',
	"parentid": '310112000000'
}, {
	"id": '310112114000',
	"shortname": '浦江镇',
	"parentid": '310112000000'
}, {
	"id": '310112501000',
	"shortname": '莘庄工业区',
	"parentid": '310112000000'
}, {
	"id": '310113003000',
	"shortname": '友谊路街道',
	"parentid": '310113000000'
}, {
	"id": '310113007000',
	"shortname": '吴淞街道',
	"parentid": '310113000000'
}, {
	"id": '310113008000',
	"shortname": '张庙街道',
	"parentid": '310113000000'
}, {
	"id": '310113101000',
	"shortname": '罗店镇',
	"parentid": '310113000000'
}, {
	"id": '310113102000',
	"shortname": '大场镇',
	"parentid": '310113000000'
}, {
	"id": '310113103000',
	"shortname": '杨行镇',
	"parentid": '310113000000'
}, {
	"id": '310113104000',
	"shortname": '月浦镇',
	"parentid": '310113000000'
}, {
	"id": '310113106000',
	"shortname": '罗泾镇',
	"parentid": '310113000000'
}, {
	"id": '310113109000',
	"shortname": '顾村镇',
	"parentid": '310113000000'
}, {
	"id": '310113111000',
	"shortname": '高境镇',
	"parentid": '310113000000'
}, {
	"id": '310113112000',
	"shortname": '庙行镇',
	"parentid": '310113000000'
}, {
	"id": '310113113000',
	"shortname": '淞南镇',
	"parentid": '310113000000'
}, {
	"id": '310113501000',
	"shortname": '宝山城市工业园区',
	"parentid": '310113000000'
}, {
	"id": '310113510000',
	"shortname": '军天湖农场',
	"parentid": '310113000000'
}, {
	"id": '310113520000',
	"shortname": '川东农场',
	"parentid": '310113000000'
}, {
	"id": '310113530000',
	"shortname": '白茅岭农场',
	"parentid": '310113000000'
}, {
	"id": '310113540000',
	"shortname": '上海农场',
	"parentid": '310113000000'
}, {
	"id": '310114001000',
	"shortname": '新成路街道',
	"parentid": '310114000000'
}, {
	"id": '310114002000',
	"shortname": '真新街道',
	"parentid": '310114000000'
}, {
	"id": '310114003000',
	"shortname": '菊园新区管委会',
	"parentid": '310114000000'
}, {
	"id": '310114004000',
	"shortname": '嘉定镇街道',
	"parentid": '310114000000'
}, {
	"id": '310114102000',
	"shortname": '南翔镇',
	"parentid": '310114000000'
}, {
	"id": '310114103000',
	"shortname": '安亭镇',
	"parentid": '310114000000'
}, {
	"id": '310114106000',
	"shortname": '马陆镇',
	"parentid": '310114000000'
}, {
	"id": '310114109000',
	"shortname": '徐行镇',
	"parentid": '310114000000'
}, {
	"id": '310114111000',
	"shortname": '华亭镇',
	"parentid": '310114000000'
}, {
	"id": '310114114000',
	"shortname": '外冈镇',
	"parentid": '310114000000'
}, {
	"id": '310114118000',
	"shortname": '江桥镇',
	"parentid": '310114000000'
}, {
	"id": '310114501000',
	"shortname": '嘉定工业区',
	"parentid": '310114000000'
}, {
	"id": '310115004000',
	"shortname": '潍坊新村街道',
	"parentid": '310115000000'
}, {
	"id": '310115005000',
	"shortname": '陆家嘴街道',
	"parentid": '310115000000'
}, {
	"id": '310115007000',
	"shortname": '周家渡街道',
	"parentid": '310115000000'
}, {
	"id": '310115008000',
	"shortname": '塘桥街道',
	"parentid": '310115000000'
}, {
	"id": '310115009000',
	"shortname": '上钢新村街道',
	"parentid": '310115000000'
}, {
	"id": '310115010000',
	"shortname": '南码头路街道',
	"parentid": '310115000000'
}, {
	"id": '310115011000',
	"shortname": '沪东新村街道',
	"parentid": '310115000000'
}, {
	"id": '310115012000',
	"shortname": '金杨新村街道',
	"parentid": '310115000000'
}, {
	"id": '310115013000',
	"shortname": '洋泾街道',
	"parentid": '310115000000'
}, {
	"id": '310115014000',
	"shortname": '浦兴路街道',
	"parentid": '310115000000'
}, {
	"id": '310115015000',
	"shortname": '东明路街道',
	"parentid": '310115000000'
}, {
	"id": '310115016000',
	"shortname": '花木街道',
	"parentid": '310115000000'
}, {
	"id": '310115103000',
	"shortname": '川沙新镇',
	"parentid": '310115000000'
}, {
	"id": '310115104000',
	"shortname": '高桥镇',
	"parentid": '310115000000'
}, {
	"id": '310115105000',
	"shortname": '北蔡镇',
	"parentid": '310115000000'
}, {
	"id": '310115110000',
	"shortname": '合庆镇',
	"parentid": '310115000000'
}, {
	"id": '310115114000',
	"shortname": '唐镇',
	"parentid": '310115000000'
}, {
	"id": '310115117000',
	"shortname": '曹路镇',
	"parentid": '310115000000'
}, {
	"id": '310115120000',
	"shortname": '金桥镇',
	"parentid": '310115000000'
}, {
	"id": '310115121000',
	"shortname": '高行镇',
	"parentid": '310115000000'
}, {
	"id": '310115123000',
	"shortname": '高东镇',
	"parentid": '310115000000'
}, {
	"id": '310115125000',
	"shortname": '张江镇',
	"parentid": '310115000000'
}, {
	"id": '310115130000',
	"shortname": '三林镇',
	"parentid": '310115000000'
}, {
	"id": '310115131000',
	"shortname": '惠南镇',
	"parentid": '310115000000'
}, {
	"id": '310115132000',
	"shortname": '周浦镇',
	"parentid": '310115000000'
}, {
	"id": '310115133000',
	"shortname": '新场镇',
	"parentid": '310115000000'
}, {
	"id": '310115134000',
	"shortname": '大团镇',
	"parentid": '310115000000'
}, {
	"id": '310115136000',
	"shortname": '康桥镇',
	"parentid": '310115000000'
}, {
	"id": '310115137000',
	"shortname": '航头镇',
	"parentid": '310115000000'
}, {
	"id": '310115139000',
	"shortname": '祝桥镇',
	"parentid": '310115000000'
}, {
	"id": '310115140000',
	"shortname": '泥城镇',
	"parentid": '310115000000'
}, {
	"id": '310115141000',
	"shortname": '宣桥镇',
	"parentid": '310115000000'
}, {
	"id": '310115142000',
	"shortname": '书院镇',
	"parentid": '310115000000'
}, {
	"id": '310115143000',
	"shortname": '万祥镇',
	"parentid": '310115000000'
}, {
	"id": '310115144000',
	"shortname": '老港镇',
	"parentid": '310115000000'
}, {
	"id": '310115145000',
	"shortname": '南汇新城镇',
	"parentid": '310115000000'
}, {
	"id": '310115401000',
	"shortname": '芦潮港农场',
	"parentid": '310115000000'
}, {
	"id": '310115402000',
	"shortname": '东海农场',
	"parentid": '310115000000'
}, {
	"id": '310115403000',
	"shortname": '朝阳农场',
	"parentid": '310115000000'
}, {
	"id": '310115501000',
	"shortname": '外高桥保税区',
	"parentid": '310115000000'
}, {
	"id": '310115502000',
	"shortname": '金桥经济技术开发区',
	"parentid": '310115000000'
}, {
	"id": '310115503000',
	"shortname": '张江高科技园区',
	"parentid": '310115000000'
}, {
	"id": '310116001000',
	"shortname": '石化街道',
	"parentid": '310116000000'
}, {
	"id": '310116101000',
	"shortname": '朱泾镇',
	"parentid": '310116000000'
}, {
	"id": '310116102000',
	"shortname": '枫泾镇',
	"parentid": '310116000000'
}, {
	"id": '310116103000',
	"shortname": '张堰镇',
	"parentid": '310116000000'
}, {
	"id": '310116104000',
	"shortname": '亭林镇',
	"parentid": '310116000000'
}, {
	"id": '310116105000',
	"shortname": '吕巷镇',
	"parentid": '310116000000'
}, {
	"id": '310116107000',
	"shortname": '廊下镇',
	"parentid": '310116000000'
}, {
	"id": '310116109000',
	"shortname": '金山卫镇',
	"parentid": '310116000000'
}, {
	"id": '310116112000',
	"shortname": '漕泾镇',
	"parentid": '310116000000'
}, {
	"id": '310116113000',
	"shortname": '山阳镇',
	"parentid": '310116000000'
}, {
	"id": '310116503000',
	"shortname": '金山工业区',
	"parentid": '310116000000'
}, {
	"id": '310117001000',
	"shortname": '岳阳街道',
	"parentid": '310117000000'
}, {
	"id": '310117002000',
	"shortname": '永丰街道',
	"parentid": '310117000000'
}, {
	"id": '310117003000',
	"shortname": '方松街道',
	"parentid": '310117000000'
}, {
	"id": '310117004000',
	"shortname": '中山街道',
	"parentid": '310117000000'
}, {
	"id": '310117102000',
	"shortname": '泗泾镇',
	"parentid": '310117000000'
}, {
	"id": '310117103000',
	"shortname": '佘山镇',
	"parentid": '310117000000'
}, {
	"id": '310117104000',
	"shortname": '车墩镇',
	"parentid": '310117000000'
}, {
	"id": '310117105000',
	"shortname": '新桥镇',
	"parentid": '310117000000'
}, {
	"id": '310117106000',
	"shortname": '洞泾镇',
	"parentid": '310117000000'
}, {
	"id": '310117107000',
	"shortname": '九亭镇',
	"parentid": '310117000000'
}, {
	"id": '310117109000',
	"shortname": '泖港镇',
	"parentid": '310117000000'
}, {
	"id": '310117116000',
	"shortname": '石湖荡镇',
	"parentid": '310117000000'
}, {
	"id": '310117117000',
	"shortname": '新浜镇',
	"parentid": '310117000000'
}, {
	"id": '310117118000',
	"shortname": '广富林街道',
	"parentid": '310117000000'
}, {
	"id": '310117119000',
	"shortname": '九里亭街道',
	"parentid": '310117000000'
}, {
	"id": '310117120000',
	"shortname": '叶榭镇',
	"parentid": '310117000000'
}, {
	"id": '310117121000',
	"shortname": '小昆山镇',
	"parentid": '310117000000'
}, {
	"id": '310117501000',
	"shortname": '松江工业区',
	"parentid": '310117000000'
}, {
	"id": '310117504000',
	"shortname": '佘山度假区',
	"parentid": '310117000000'
}, {
	"id": '310117507000',
	"shortname": '上海松江出口加工区',
	"parentid": '310117000000'
}, {
	"id": '310118001000',
	"shortname": '夏阳街道',
	"parentid": '310118000000'
}, {
	"id": '310118002000',
	"shortname": '盈浦街道',
	"parentid": '310118000000'
}, {
	"id": '310118003000',
	"shortname": '香花桥街道',
	"parentid": '310118000000'
}, {
	"id": '310118102000',
	"shortname": '朱家角镇',
	"parentid": '310118000000'
}, {
	"id": '310118103000',
	"shortname": '练塘镇',
	"parentid": '310118000000'
}, {
	"id": '310118104000',
	"shortname": '金泽镇',
	"parentid": '310118000000'
}, {
	"id": '310118105000',
	"shortname": '赵巷镇',
	"parentid": '310118000000'
}, {
	"id": '310118106000',
	"shortname": '徐泾镇',
	"parentid": '310118000000'
}, {
	"id": '310118107000',
	"shortname": '华新镇',
	"parentid": '310118000000'
}, {
	"id": '310118109000',
	"shortname": '重固镇',
	"parentid": '310118000000'
}, {
	"id": '310118110000',
	"shortname": '白鹤镇',
	"parentid": '310118000000'
}, {
	"id": '310120101000',
	"shortname": '南桥镇',
	"parentid": '310120000000'
}, {
	"id": '310120102000',
	"shortname": '奉城镇',
	"parentid": '310120000000'
}, {
	"id": '310120103000',
	"shortname": '西渡街道',
	"parentid": '310120000000'
}, {
	"id": '310120002001',
	"shortname": '奉浦街道',
	"parentid": '310120000000'
}, {
	"id": '310120104000',
	"shortname": '庄行镇',
	"parentid": '310120000000'
}, {
	"id": '310120106000',
	"shortname": '金汇镇',
	"parentid": '310120000000'
}, {
	"id": '310120109000',
	"shortname": '四团镇',
	"parentid": '310120000000'
}, {
	"id": '310120111000',
	"shortname": '青村镇',
	"parentid": '310120000000'
}, {
	"id": '310120118000',
	"shortname": '柘林镇',
	"parentid": '310120000000'
}, {
	"id": '310120123000',
	"shortname": '海湾镇',
	"parentid": '310120000000'
}, {
	"id": '310120501000',
	"shortname": '奉浦社区',
	"parentid": '310120000000'
}, {
	"id": '310120503000',
	"shortname": '海湾旅游区',
	"parentid": '310120000000'
}, {
	"id": '310120504000',
	"shortname": '金海社区',
	"parentid": '310120000000'
}, {
	"id": '310120505000',
	"shortname": '海港开发区',
	"parentid": '310120000000'
}, {
	"id": '310230101000',
	"shortname": '城桥镇',
	"parentid": '310230000000'
}, {
	"id": '310230102000',
	"shortname": '堡镇',
	"parentid": '310230000000'
}, {
	"id": '310230103000',
	"shortname": '新河镇',
	"parentid": '310230000000'
}, {
	"id": '310230104000',
	"shortname": '庙镇',
	"parentid": '310230000000'
}, {
	"id": '310230106000',
	"shortname": '竖新镇',
	"parentid": '310230000000'
}, {
	"id": '310230107000',
	"shortname": '向化镇',
	"parentid": '310230000000'
}, {
	"id": '310230109000',
	"shortname": '三星镇',
	"parentid": '310230000000'
}, {
	"id": '310230113000',
	"shortname": '港沿镇',
	"parentid": '310230000000'
}, {
	"id": '310230114000',
	"shortname": '中兴镇',
	"parentid": '310230000000'
}, {
	"id": '310230115000',
	"shortname": '陈家镇',
	"parentid": '310230000000'
}, {
	"id": '310230116000',
	"shortname": '绿华镇',
	"parentid": '310230000000'
}, {
	"id": '310230118000',
	"shortname": '港西镇',
	"parentid": '310230000000'
}, {
	"id": '310230119000',
	"shortname": '建设镇',
	"parentid": '310230000000'
}, {
	"id": '310230121000',
	"shortname": '新海镇',
	"parentid": '310230000000'
}, {
	"id": '310230122000',
	"shortname": '东平镇',
	"parentid": '310230000000'
}, {
	"id": '310230123000',
	"shortname": '长兴镇',
	"parentid": '310230000000'
}, {
	"id": '310230201000',
	"shortname": '新村乡',
	"parentid": '310230000000'
}, {
	"id": '310230203000',
	"shortname": '横沙乡',
	"parentid": '310230000000'
}, {
	"id": '310230409000',
	"shortname": '前卫农场',
	"parentid": '310230000000'
}, {
	"id": '310230410000',
	"shortname": '东平林场',
	"parentid": '310230000000'
}, {
	"id": '310230501000',
	"shortname": '上实现代农业园区',
	"parentid": '310230000000'
}];

//juewie
var shNeighborhood = [{
		"shortname": "云南中路居委会",
		"id": "310101002001001001",
		"parentid": "310101002000"
	},
	{
		"shortname": "龙泉园路居委会",
		"id": "310101002001002001",
		"parentid": "310101002000"
	},
	{
		"shortname": "贵州路居委会",
		"id": "310101002001003001",
		"parentid": "310101002000"
	},
	{
		"shortname": "新桥居委会",
		"id": "310101002001006001",
		"parentid": "310101002000"
	},
	{
		"shortname": "牛庄路居委会",
		"id": "310101002001007001",
		"parentid": "310101002000"
	},
	{
		"shortname": "厦门路居委会",
		"id": "310101002001008001",
		"parentid": "310101002000"
	},
	{
		"shortname": "福海居委会",
		"id": "310101002001009001",
		"parentid": "310101002000"
	},
	{
		"shortname": "承兴居委会",
		"id": "310101002001010001",
		"parentid": "310101002000"
	},
	{
		"shortname": "三德居委会",
		"id": "310101002001011001",
		"parentid": "310101002000"
	},
	{
		"shortname": "福瑞居委会",
		"id": "310101002001013001",
		"parentid": "310101002000"
	},
	{
		"shortname": "平望街居委会",
		"id": "310101002001014001",
		"parentid": "310101002000"
	},
	{
		"shortname": "小花园居委会",
		"id": "310101002001015001",
		"parentid": "310101002000"
	},
	{
		"shortname": "长江居委会",
		"id": "310101002001017001",
		"parentid": "310101002000"
	},
	{
		"shortname": "江阴居委会",
		"id": "310101002001018001",
		"parentid": "310101002000"
	},
	{
		"shortname": "均乐居委会",
		"id": "310101002001019001",
		"parentid": "310101002000"
	},
	{
		"shortname": "新昌居委会",
		"id": "310101002001020001",
		"parentid": "310101002000"
	},
	{
		"shortname": "振兴居委会",
		"id": "310101002001021001",
		"parentid": "310101002000"
	},
	{
		"shortname": "定兴居委会",
		"id": "310101002001022001",
		"parentid": "310101002000"
	},
	{
		"shortname": "顺天村居委会",
		"id": "310101002001023001",
		"parentid": "310101002000"
	},
	{
		"shortname": "汉口路居委会",
		"id": "310101013001001001",
		"parentid": "310101013000"
	},
	{
		"shortname": "北京居委会",
		"id": "310101013001003001",
		"parentid": "310101013000"
	},
	{
		"shortname": "宁波路居委会",
		"id": "310101013001004001",
		"parentid": "310101013000"
	},
	{
		"shortname": "无锡路居委会",
		"id": "310101013001005001",
		"parentid": "310101013000"
	},
	{
		"shortname": "东风居委会",
		"id": "310101013001007001",
		"parentid": "310101013000"
	},
	{
		"shortname": "山东北路居委会",
		"id": "310101013001008001",
		"parentid": "310101013000"
	},
	{
		"shortname": "虎丘路居委会",
		"id": "310101013001009001",
		"parentid": "310101013000"
	},
	{
		"shortname": "永安路居委会",
		"id": "310101013001010001",
		"parentid": "310101013000"
	},
	{
		"shortname": "永胜路居委会",
		"id": "310101013001012001",
		"parentid": "310101013000"
	},
	{
		"shortname": "中山东一路居委会",
		"id": "310101013001014001",
		"parentid": "310101013000"
	},
	{
		"shortname": "盛泽居委会",
		"id": "310101013001015001",
		"parentid": "310101013000"
	},
	{
		"shortname": "金陵居委会",
		"id": "310101013001016001",
		"parentid": "310101013000"
	},
	{
		"shortname": "福南居委会",
		"id": "310101013001017001",
		"parentid": "310101013000"
	},
	{
		"shortname": "宝兴居委会",
		"id": "310101013001018001",
		"parentid": "310101013000"
	},
	{
		"shortname": "昭通路居委会",
		"id": "310101013001019001",
		"parentid": "310101013000"
	},
	{
		"shortname": "瑞福居委会",
		"id": "310101013001020001",
		"parentid": "310101013000"
	},
	{
		"shortname": "云南居委会",
		"id": "310101013001021001",
		"parentid": "310101013000"
	},
	{
		"shortname": "山西南路居委会",
		"id": "310101013001022001",
		"parentid": "310101013000"
	},
	{
		"shortname": "新建二村居委会",
		"id": "310101013001023001",
		"parentid": "310101013000"
	},

	{
		"shortname": "民立居委会",
		"id": "310101015001002001",
		"parentid": "310101015000"
	},
	{
		"shortname": "瞿四居委会",
		"id": "310101015001004001",
		"parentid": "310101015000"
	},
	{
		"shortname": "西三居委会",
		"id": "310101015001005001",
		"parentid": "310101015000"
	},
	{
		"shortname": "徽宁居委会",
		"id": "310101015001006001",
		"parentid": "310101015000"
	},
	{
		"shortname": "高雄居委会",
		"id": "310101015001010001",
		"parentid": "310101015000"
	},
	{
		"shortname": "瞿二居委会",
		"id": "310101015001011001",
		"parentid": "310101015000"
	},
	{
		"shortname": "三门峡居委会",
		"id": "310101015001013001",
		"parentid": "310101015000"
	},
	{
		"shortname": "市民居委会",
		"id": "310101015001014001",
		"parentid": "310101015000"
	},
	{
		"shortname": "西一居委会",
		"id": "310101015001015001",
		"parentid": "310101015000"
	},
	{
		"shortname": "制造居委会",
		"id": "310101015001016001",
		"parentid": "310101015000"
	},
	{
		"shortname": "保屯居委会",
		"id": "310101015001018001",
		"parentid": "310101015000"
	},
	{
		"shortname": "西二居委会",
		"id": "310101015001021001",
		"parentid": "310101015000"
	},
	{
		"shortname": "耀江花园居委会",
		"id": "310101015001022002",
		"parentid": "310101015000"
	},
	{
		"shortname": "黄浦新苑居委会",
		"id": "310101015001023002",
		"parentid": "310101015000"
	},
	{
		"shortname": "迎勋居委会",
		"id": "310101015001024001",
		"parentid": "310101015000"
	},
	{
		"shortname": "海西居委会",
		"id": "310101015001025001",
		"parentid": "310101015000"
	},
	{
		"shortname": "益元居委会",
		"id": "310101015001026002",
		"parentid": "310101015000"
	},
	{
		"shortname": "中福花苑第一居委会",
		"id": "310101015001027001",
		"parentid": "310101015000"
	},
	{
		"shortname": "车中居委会",
		"id": "310101015001028001",
		"parentid": "310101015000"
	},
	{
		"shortname": "普益居委会",
		"id": "310101015001029001",
		"parentid": "310101015000"
	},
	{
		"shortname": "新村居委会",
		"id": "310101015001030001",
		"parentid": "310101015000"
	},
	{
		"shortname": "中福花苑第二居委会",
		"id": "310101015001031002",
		"parentid": "310101015000"
	},

	{
		"shortname": "新码居委会",
		"id": "310101017001002001",
		"parentid": "310101017000"
	},
	{
		"shortname": "龙潭居委会",
		"id": "310101017001003001",
		"parentid": "310101017000"
	},
	{
		"shortname": "西姚居委会",
		"id": "310101017001005001",
		"parentid": "310101017000"
	},
	{
		"shortname": "中华居委会",
		"id": "310101017001008001",
		"parentid": "310101017000"
	},
	{
		"shortname": "白渡居委会",
		"id": "310101017001009001",
		"parentid": "310101017000"
	},
	{
		"shortname": "天灯居委会",
		"id": "310101017001010001",
		"parentid": "310101017000"
	},
	{
		"shortname": "小石桥居委会",
		"id": "310101017001011001",
		"parentid": "310101017000"
	},
	{
		"shortname": "乔家居委会",
		"id": "310101017001012001",
		"parentid": "310101017000"
	},
	{
		"shortname": "金坛居委会",
		"id": "310101017001013001",
		"parentid": "310101017000"
	},
	{
		"shortname": "赵家宅居委会",
		"id": "310101017001014001",
		"parentid": "310101017000"
	},
	{
		"shortname": "荷花池居委会",
		"id": "310101017001015001",
		"parentid": "310101017000"
	},
	{
		"shortname": "阳光居委会",
		"id": "310101017001016001",
		"parentid": "310101017000"
	},
	{
		"shortname": "多稼居委会",
		"id": "310101017001019001",
		"parentid": "310101017000"
	},
	{
		"shortname": "万裕居委会",
		"id": "310101017001021001",
		"parentid": "310101017000"
	},
	{
		"shortname": "府谷居委会",
		"id": "310101017001024001",
		"parentid": "310101017000"
	},
	{
		"shortname": "桑园居委会",
		"id": "310101017001025001",
		"parentid": "310101017000"
	},
	{
		"shortname": "四新居委会",
		"id": "310101018001002001",
		"parentid": "310101018000"
	},
	{
		"shortname": "宝带居委会",
		"id": "310101018001003001",
		"parentid": "310101018000"
	},
	{
		"shortname": "光启居委会",
		"id": "310101018001005001",
		"parentid": "310101018000"
	},
	{
		"shortname": "果育居委会",
		"id": "310101018001006001",
		"parentid": "310101018000"
	},
	{
		"shortname": "侯家居委会",
		"id": "310101018001007001",
		"parentid": "310101018000"
	},
	{
		"shortname": "太阳都市居委会",
		"id": "310101018001008001",
		"parentid": "310101018000"
	},
	{
		"shortname": "丹马居委会",
		"id": "310101018001011001",
		"parentid": "310101018000"
	},
	{
		"shortname": "学院居委会",
		"id": "310101018001012001",
		"parentid": "310101018000"
	},
	{
		"shortname": "露香居委会",
		"id": "310101018001013001",
		"parentid": "310101018000"
	},
	{
		"shortname": "阜春居委会",
		"id": "310101018001014001",
		"parentid": "310101018000"
	},
	{
		"shortname": "长生居委会",
		"id": "310101018001015001",
		"parentid": "310101018000"
	},
	{
		"shortname": "广福居委会",
		"id": "310101018001016001",
		"parentid": "310101018000"
	},
	{
		"shortname": "肇方居委会",
		"id": "310101018001019001",
		"parentid": "310101018000"
	},
	{
		"shortname": "同庆居委会",
		"id": "310101018001020001",
		"parentid": "310101018000"
	},
	{
		"shortname": "泰瑞居委会",
		"id": "310101018001021001",
		"parentid": "310101018000"
	},
	{
		"shortname": "淮海居委会",
		"id": "310101018001022001",
		"parentid": "310101018000"
	},
	{
		"shortname": "会稽居委会",
		"id": "310101018001023001",
		"parentid": "310101018000"
	},
	{
		"shortname": "方西居委会",
		"id": "310101018001024001",
		"parentid": "310101018000"
	},
	{
		"shortname": "古城居委会",
		"id": "310101018001025001",
		"parentid": "310101018000"
	},

	{
		"shortname": "大兴居委会",
		"id": "310101019001005001",
		"parentid": "310101019000"
	},
	{
		"shortname": "大林居委会",
		"id": "310101019001013001",
		"parentid": "310101019000"
	},
	{
		"shortname": "文庙居委会",
		"id": "310101019001014001",
		"parentid": "310101019000"
	},
	{
		"shortname": "学宫街居委会",
		"id": "310101019001017001",
		"parentid": "310101019000"
	},
	{
		"shortname": "曹家街居委会",
		"id": "310101019001018001",
		"parentid": "310101019000"
	},
	{
		"shortname": "艾家弄居委会",
		"id": "310101019001019001",
		"parentid": "310101019000"
	},
	{
		"shortname": "小桃园居委会",
		"id": "310101019001020001",
		"parentid": "310101019000"
	},
	{
		"shortname": "方斜居委会",
		"id": "310101019001021001",
		"parentid": "310101019000"
	},
	{
		"shortname": "牌楼居委会",
		"id": "310101019001022001",
		"parentid": "310101019000"
	},
	{
		"shortname": "也是园居委会",
		"id": "310101019001023001",
		"parentid": "310101019000"
	},
	{
		"shortname": "龙门村居委会",
		"id": "310101019001024001",
		"parentid": "310101019000"
	},
	{
		"shortname": "小西门居委会",
		"id": "310101019001025001",
		"parentid": "310101019000"
	},
	{
		"shortname": "唐家湾居委会",
		"id": "310101019001027001",
		"parentid": "310101019000"
	},
	{
		"shortname": "净土街居委会",
		"id": "310101019001028001",
		"parentid": "310101019000"
	},
	{
		"shortname": "乔家栅居委会",
		"id": "310101019001029001",
		"parentid": "310101019000"
	},
	{
		"shortname": "陆兴居委会",
		"id": "310101019001030001",
		"parentid": "310101019000"
	},
	{
		"shortname": "明日星城居委会",
		"id": "310101019001031001",
		"parentid": "310101019000"
	},
	{
		"shortname": "陆迎居委会",
		"id": "310101019001032001",
		"parentid": "310101019000"
	},

	{
		"shortname": "桥一居委会",
		"id": "310101020001001001",
		"parentid": "310101020000"
	},
	{
		"shortname": "桥二居委会",
		"id": "310101020001002001",
		"parentid": "310101020000"
	},
	{
		"shortname": "中二居委会",
		"id": "310101020001004001",
		"parentid": "310101020000"
	},
	{
		"shortname": "中一居委会",
		"id": "310101020001005001",
		"parentid": "310101020000"
	},
	{
		"shortname": "铁一居委会",
		"id": "310101020001006001",
		"parentid": "310101020000"
	},
	{
		"shortname": "铁二居委会",
		"id": "310101020001007001",
		"parentid": "310101020000"
	},
	{
		"shortname": "瞿南居委会",
		"id": "310101020001008001",
		"parentid": "310101020000"
	},
	{
		"shortname": "瞿中居委会",
		"id": "310101020001009001",
		"parentid": "310101020000"
	},
	{
		"shortname": "瞿东居委会",
		"id": "310101020001010001",
		"parentid": "310101020000"
	},
	{
		"shortname": "瞿西居委会",
		"id": "310101020001011001",
		"parentid": "310101020000"
	},
	{
		"shortname": "斜土居委会",
		"id": "310101020001012001",
		"parentid": "310101020000"
	},
	{
		"shortname": "打浦居委会",
		"id": "310101020001013001",
		"parentid": "310101020000"
	},
	{
		"shortname": "蒙自居委会",
		"id": "310101020001014001",
		"parentid": "310101020000"
	},
	{
		"shortname": "龙华居委会",
		"id": "310101020001016001",
		"parentid": "310101020000"
	},
	{
		"shortname": "丽园居委会",
		"id": "310101020001017001",
		"parentid": "310101020000"
	},
	{
		"shortname": "桑城居委会",
		"id": "310101020001018001",
		"parentid": "310101020000"
	},
	{
		"shortname": "紫荆居委会",
		"id": "310101020001019001",
		"parentid": "310101020000"
	},
	{
		"shortname": "瑞南居委会",
		"id": "310101020001020001",
		"parentid": "310101020000"
	},
	{
		"shortname": "海悦居委会",
		"id": "310101020001021001",
		"parentid": "310101020000"
	},
	{
		"shortname": "大同居委会",
		"id": "310101021001001001",
		"parentid": "310101021000"
	},
	{
		"shortname": "肇东居委会",
		"id": "310101021001002001",
		"parentid": "310101021000"
	},
	{
		"shortname": "泰康居委会",
		"id": "310101021001005001",
		"parentid": "310101021000"
	},
	{
		"shortname": "建中居委会",
		"id": "310101021001006001",
		"parentid": "310101021000"
	},
	{
		"shortname": "丽一居委会",
		"id": "310101021001007001",
		"parentid": "310101021000"
	},
	{
		"shortname": "蒙西居委会",
		"id": "310101021001008001",
		"parentid": "310101021000"
	},
	{
		"shortname": "丽二居委会",
		"id": "310101021001009001",
		"parentid": "310101021000"
	},
	{
		"shortname": "银杏居委会",
		"id": "310101021001010001",
		"parentid": "310101021000"
	},
	{
		"shortname": "局后居委会",
		"id": "310101021001011001",
		"parentid": "310101021000"
	},
	{
		"shortname": "建一居委会",
		"id": "310101021001012001",
		"parentid": "310101021000"
	},
	{
		"shortname": "徐一居委会",
		"id": "310101021001013001",
		"parentid": "310101021000"
	},
	{
		"shortname": "建三居委会",
		"id": "310101021001014001",
		"parentid": "310101021000"
	},
	{
		"shortname": "徐二居委会",
		"id": "310101021001015001",
		"parentid": "310101021000"
	},
	{
		"shortname": "建五居委会",
		"id": "310101021001016001",
		"parentid": "310101021000"
	},
	{
		"shortname": "锦海居委会",
		"id": "310101021001018001",
		"parentid": "310101021000"
	},
	{
		"shortname": "南塘居委会",
		"id": "310101021001019001",
		"parentid": "310101021000"
	},
	{
		"shortname": "汇龙居委会",
		"id": "310101021001020001",
		"parentid": "310101021000"
	},

	{
		"shortname": "新华居委会",
		"id": "310101022001002001",
		"parentid": "310101022000"
	},
	{
		"shortname": "合二居委会",
		"id": "310101022001004001",
		"parentid": "310101022000"
	},
	{
		"shortname": "复三居委会",
		"id": "310101022001005001",
		"parentid": "310101022000"
	},
	{
		"shortname": "复四居委会",
		"id": "310101022001006001",
		"parentid": "310101022000"
	},
	{
		"shortname": "志成居委会",
		"id": "310101022001007001",
		"parentid": "310101022000"
	},
	{
		"shortname": "大华居委会",
		"id": "310101022001009001",
		"parentid": "310101022000"
	},
	{
		"shortname": "浏河居委会",
		"id": "310101022001010001",
		"parentid": "310101022000"
	},
	{
		"shortname": "景安居委会",
		"id": "310101022001011001",
		"parentid": "310101022000"
	},
	{
		"shortname": "复兴居委会",
		"id": "310101022001014001",
		"parentid": "310101022000"
	},
	{
		"shortname": "西成居委会",
		"id": "310101022001015001",
		"parentid": "310101022000"
	},
	{
		"shortname": "孝和居委会",
		"id": "310101022001017001",
		"parentid": "310101022000"
	},
	{
		"shortname": "瑞华居委会",
		"id": "310101022001020001",
		"parentid": "310101022000"
	},
	{
		"shortname": "建二居委会",
		"id": "310101022001021001",
		"parentid": "310101022000"
	},
	{
		"shortname": "建四居委会",
		"id": "310101022001022001",
		"parentid": "310101022000"
	},
	{
		"shortname": "建六居委会",
		"id": "310101022001023001",
		"parentid": "310101022000"
	},
	{
		"shortname": "合一居委会",
		"id": "310101022001025001",
		"parentid": "310101022000"
	},
	{
		"shortname": "顺六居委会",
		"id": "310101022001026001",
		"parentid": "310101022000"
	},
	{
		"shortname": "新天地居委会",
		"id": "310101022001027001",
		"parentid": "310101022000"
	},
	{
		"shortname": "雁荡居委会",
		"id": "310101023001001001",
		"parentid": "310101023000"
	},
	{
		"shortname": "延中居委会",
		"id": "310101023001002001",
		"parentid": "310101023000"
	},
	{
		"shortname": "巨鹿居委会",
		"id": "310101023001003001",
		"parentid": "310101023000"
	},
	{
		"shortname": "锦江居委会",
		"id": "310101023001004001",
		"parentid": "310101023000"
	},
	{
		"shortname": "南昌居委会",
		"id": "310101023001005001",
		"parentid": "310101023000"
	},
	{
		"shortname": "茂名居委会",
		"id": "310101023001006001",
		"parentid": "310101023000"
	},
	{
		"shortname": "淮中居委会",
		"id": "310101023001008001",
		"parentid": "310101023000"
	},
	{
		"shortname": "长乐居委会",
		"id": "310101023001009001",
		"parentid": "310101023000"
	},
	{
		"shortname": "香山居委会",
		"id": "310101023001010001",
		"parentid": "310101023000"
	},
	{
		"shortname": "永嘉居委会",
		"id": "310101023001011001",
		"parentid": "310101023000"
	},
	{
		"shortname": "思南居委会",
		"id": "310101023001012001",
		"parentid": "310101023000"
	},
	{
		"shortname": "陕建居委会",
		"id": "310101023001013001",
		"parentid": "310101023000"
	},
	{
		"shortname": "瑞成居委会",
		"id": "310101023001014001",
		"parentid": "310101023000"
	},
	{
		"shortname": "瑞兴居委会",
		"id": "310101023001015001",
		"parentid": "310101023000"
	},
	{
		"shortname": "建德居委会",
		"id": "310101023001016001",
		"parentid": "310101023000"
	},
	{
		"shortname": "瑞雪居委会",
		"id": "310101023001017001",
		"parentid": "310101023000"
	},
	{
		"shortname": "上海新村居委会",
		"id": "310104003001001001",
		"parentid": "310104003000"
	},
	{
		"shortname": "德昌居委会",
		"id": "310104003001002001",
		"parentid": "310104003000"
	},
	{
		"shortname": "康平居委会",
		"id": "310104003001003001",
		"parentid": "310104003000"
	},
	{
		"shortname": "广元居委会",
		"id": "310104003001004001",
		"parentid": "310104003000"
	},
	{
		"shortname": "安亭居委会",
		"id": "310104003001005001",
		"parentid": "310104003000"
	},
	{
		"shortname": "吴兴居委会",
		"id": "310104003001006001",
		"parentid": "310104003000"
	},
	{
		"shortname": "天平居委会",
		"id": "310104003001007001",
		"parentid": "310104003000"
	},
	{
		"shortname": "宛平居委会",
		"id": "310104003001008001",
		"parentid": "310104003000"
	},
	{
		"shortname": "高安居委会",
		"id": "310104003001009001",
		"parentid": "310104003000"
	},
	{
		"shortname": "建新居委会",
		"id": "310104003001010001",
		"parentid": "310104003000"
	},
	{
		"shortname": "永太居委会",
		"id": "310104003001011001",
		"parentid": "310104003000"
	},
	{
		"shortname": "永嘉新村居委会",
		"id": "310104003001012001",
		"parentid": "310104003000"
	},
	{
		"shortname": "桃源村居委会",
		"id": "310104003001013001",
		"parentid": "310104003000"
	},
	{
		"shortname": "息村居委会",
		"id": "310104003001017001",
		"parentid": "310104003000"
	},
	{
		"shortname": "肇嘉浜居委会",
		"id": "310104003001019001",
		"parentid": "310104003000"
	},
	{
		"shortname": "慎成居委会",
		"id": "310104003001021001",
		"parentid": "310104003000"
	},
	{
		"shortname": "嘉善居委会",
		"id": "310104003001024001",
		"parentid": "310104003000"
	},
	{
		"shortname": "建岳居委会",
		"id": "310104003001025001",
		"parentid": "310104003000"
	},
	{
		"shortname": "永康居委会",
		"id": "310104003001026001",
		"parentid": "310104003000"
	},
	{
		"shortname": "太原居委会",
		"id": "310104003001027001",
		"parentid": "310104003000"
	},
	{
		"shortname": "陕西居委会",
		"id": "310104003001028002",
		"parentid": "310104003000"
	},
	{
		"shortname": "淮中居委会",
		"id": "310104004001001001",
		"parentid": "310104004000"
	},
	{
		"shortname": "安福居委会",
		"id": "310104004001003001",
		"parentid": "310104004000"
	},
	{
		"shortname": "兴武居委会",
		"id": "310104004001005001",
		"parentid": "310104004000"
	},
	{
		"shortname": "金波居委会",
		"id": "310104004001007001",
		"parentid": "310104004000"
	},
	{
		"shortname": "武康居委会",
		"id": "310104004001008001",
		"parentid": "310104004000"
	},
	{
		"shortname": "春华居委会",
		"id": "310104004001009001",
		"parentid": "310104004000"
	},
	{
		"shortname": "华康居委会",
		"id": "310104004001010001",
		"parentid": "310104004000"
	},
	{
		"shortname": "复永居委会",
		"id": "310104004001012001",
		"parentid": "310104004000"
	},
	{
		"shortname": "新乐居委会",
		"id": "310104004001014001",
		"parentid": "310104004000"
	},
	{
		"shortname": "张家弄居委会",
		"id": "310104004001015001",
		"parentid": "310104004000"
	},
	{
		"shortname": "复襄居委会",
		"id": "310104004001016001",
		"parentid": "310104004000"
	},
	{
		"shortname": "复中居委会",
		"id": "310104004001017001",
		"parentid": "310104004000"
	},
	{
		"shortname": "东湖居委会",
		"id": "310104004001018001",
		"parentid": "310104004000"
	},
	{
		"shortname": "陕新居委会",
		"id": "310104004001019001",
		"parentid": "310104004000"
	},
	{
		"shortname": "淮海居委会",
		"id": "310104004001020001",
		"parentid": "310104004000"
	},
	{
		"shortname": "延庆居委会",
		"id": "310104004001021001",
		"parentid": "310104004000"
	},
	{
		"shortname": "日晖新城居委会",
		"id": "310104007001001001",
		"parentid": "310104007000"
	},
	{
		"shortname": "日晖七村居委会",
		"id": "310104007001002001",
		"parentid": "310104007000"
	},
	{
		"shortname": "日晖六村第一居委会",
		"id": "310104007001003001",
		"parentid": "310104007000"
	},
	{
		"shortname": "日晖六村第二居委会",
		"id": "310104007001004001",
		"parentid": "310104007000"
	},
	{
		"shortname": "康巨居委会",
		"id": "310104007001008001",
		"parentid": "310104007000"
	},
	{
		"shortname": "江南新村居委会",
		"id": "310104007001009001",
		"parentid": "310104007000"
	},
	{
		"shortname": "大木桥路第三居委会",
		"id": "310104007001013001",
		"parentid": "310104007000"
	},
	{
		"shortname": "上影居委会",
		"id": "310104007001014001",
		"parentid": "310104007000"
	},
	{
		"shortname": "茶陵居委会",
		"id": "310104007001015001",
		"parentid": "310104007000"
	},
	{
		"shortname": "日晖二村居委会",
		"id": "310104007001018002",
		"parentid": "310104007000"
	},
	{
		"shortname": "肇嘉浜路第一居委会",
		"id": "310104007001021001",
		"parentid": "310104007000"
	},
	{
		"shortname": "肇清居委会",
		"id": "310104007001022001",
		"parentid": "310104007000"
	},
	{
		"shortname": "景泰居委会",
		"id": "310104007001023001",
		"parentid": "310104007000"
	},
	{
		"shortname": "大木桥路第四居委会",
		"id": "310104007001024001",
		"parentid": "310104007000"
	},
	{
		"shortname": "大木桥路第五居委会",
		"id": "310104007001025001",
		"parentid": "310104007000"
	},
	{
		"shortname": "日晖五村居委会",
		"id": "310104007001026001",
		"parentid": "310104007000"
	},
	{
		"shortname": "恒益居委会",
		"id": "310104007001028001",
		"parentid": "310104007000"
	},
	{
		"shortname": "尚海湾居委会",
		"id": "310104007001049001",
		"parentid": "310104007000"
	},
	{
		"shortname": "张家浜居委会",
		"id": "310104008001001001",
		"parentid": "310104008000"
	},
	{
		"shortname": "谨斜居委会",
		"id": "310104008001002001",
		"parentid": "310104008000"
	},
	{
		"shortname": "东安一村北居委会",
		"id": "310104008001004001",
		"parentid": "310104008000"
	},
	{
		"shortname": "东安一村南居委会",
		"id": "310104008001005001",
		"parentid": "310104008000"
	},
	{
		"shortname": "黄家宅居委会",
		"id": "310104008001009001",
		"parentid": "310104008000"
	},
	{
		"shortname": "西木北居委会",
		"id": "310104008001010001",
		"parentid": "310104008000"
	},
	{
		"shortname": "西木南居委会",
		"id": "310104008001011001",
		"parentid": "310104008000"
	},
	{
		"shortname": "沈家里居委会",
		"id": "310104008001013001",
		"parentid": "310104008000"
	},
	{
		"shortname": "振兴居委会",
		"id": "310104008001015001",
		"parentid": "310104008000"
	},
	{
		"shortname": "医清居委会",
		"id": "310104008001017001",
		"parentid": "310104008000"
	},
	{
		"shortname": "东安四村居委会",
		"id": "310104008001020001",
		"parentid": "310104008000"
	},
	{
		"shortname": "枫林新村居委会",
		"id": "310104008001022001",
		"parentid": "310104008000"
	},
	{
		"shortname": "平江居委会",
		"id": "310104008001023001",
		"parentid": "310104008000"
	},
	{
		"shortname": "庄家宅居委会",
		"id": "310104008001024001",
		"parentid": "310104008000"
	},
	{
		"shortname": "宛南新村第一、二居委会",
		"id": "310104008001026001",
		"parentid": "310104008000"
	},
	{
		"shortname": "宛南三村居委会",
		"id": "310104008001027001",
		"parentid": "310104008000"
	},
	{
		"shortname": "宛南四村居委会",
		"id": "310104008001028001",
		"parentid": "310104008000"
	},
	{
		"shortname": "宛南五村居委会",
		"id": "310104008001029001",
		"parentid": "310104008000"
	},
	{
		"shortname": "宛南六村居委会",
		"id": "310104008001030001",
		"parentid": "310104008000"
	},
	{
		"shortname": "天钥新村第一、二居委会",
		"id": "310104008001032001",
		"parentid": "310104008000"
	},
	{
		"shortname": "天钥新村第三居委会",
		"id": "310104008001033001",
		"parentid": "310104008000"
	},
	{
		"shortname": "天钥新村第四居委会",
		"id": "310104008001034001",
		"parentid": "310104008000"
	},
	{
		"shortname": "龙山新村第一居委会",
		"id": "310104008001035001",
		"parentid": "310104008000"
	},
	{
		"shortname": "龙山新村第二居委会",
		"id": "310104008001036001",
		"parentid": "310104008000"
	},
	{
		"shortname": "张东居委会",
		"id": "310104008001037001",
		"parentid": "310104008000"
	},
	{
		"shortname": "安康居委会",
		"id": "310104008001038001",
		"parentid": "310104008000"
	},
	{
		"shortname": "四季园居委会",
		"id": "310104008001040001",
		"parentid": "310104008000"
	},
	{
		"shortname": "汇园居委会",
		"id": "310104008001041001",
		"parentid": "310104008000"
	},
	{
		"shortname": "东安二村居委会",
		"id": "310104008001042001",
		"parentid": "310104008000"
	},
	{
		"shortname": "徐汇苑居委会",
		"id": "310104008001043001",
		"parentid": "310104008000"
	},
	{
		"shortname": "东安苑居委会",
		"id": "310104008001044001",
		"parentid": "310104008000"
	},

	{
		"shortname": "长桥新村第一居委会",
		"id": "310104010001001001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥新二村居委会",
		"id": "310104010001002001",
		"parentid": "310104010000"
	},
	{
		"shortname": "港口居委会",
		"id": "310104010001003001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥一村居委会",
		"id": "310104010001004001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥三村第一居委会",
		"id": "310104010001007001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥三村第二居委会",
		"id": "310104010001008001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥四村第一居委会",
		"id": "310104010001009001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥四村第二居委会",
		"id": "310104010001010001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥五村居委会",
		"id": "310104010001011001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥七村居委会",
		"id": "310104010001012001",
		"parentid": "310104010000"
	},
	{
		"shortname": "汇成一村居委会",
		"id": "310104010001013001",
		"parentid": "310104010000"
	},
	{
		"shortname": "汇成二村居委会",
		"id": "310104010001014001",
		"parentid": "310104010000"
	},
	{
		"shortname": "汇成三村居委会",
		"id": "310104010001015001",
		"parentid": "310104010000"
	},
	{
		"shortname": "汇成四村居委会",
		"id": "310104010001016001",
		"parentid": "310104010000"
	},
	{
		"shortname": "汇成五村居委会",
		"id": "310104010001017001",
		"parentid": "310104010000"
	},
	{
		"shortname": "园南二村居委会",
		"id": "310104010001018001",
		"parentid": "310104010000"
	},
	{
		"shortname": "园南三村居委会",
		"id": "310104010001019001",
		"parentid": "310104010000"
	},
	{
		"shortname": "罗秀二村居委会",
		"id": "310104010001021001",
		"parentid": "310104010000"
	},
	{
		"shortname": "光华居委会",
		"id": "310104010001022001",
		"parentid": "310104010000"
	},
	{
		"shortname": "百龙居委会",
		"id": "310104010001023001",
		"parentid": "310104010000"
	},
	{
		"shortname": "园南一村居委会",
		"id": "310104010001025001",
		"parentid": "310104010000"
	},
	{
		"shortname": "罗秀新村居委会",
		"id": "310104010001026001",
		"parentid": "310104010000"
	},
	{
		"shortname": "罗秀三村居委会",
		"id": "310104010001027001",
		"parentid": "310104010000"
	},
	{
		"shortname": "楼园居委会",
		"id": "310104010001028001",
		"parentid": "310104010000"
	},
	{
		"shortname": "长桥八村居委会",
		"id": "310104010001031001",
		"parentid": "310104010000"
	},
	{
		"shortname": "平福居委会",
		"id": "310104010001032001",
		"parentid": "310104010000"
	},
	{
		"shortname": "体育花苑居委会",
		"id": "310104010001033001",
		"parentid": "310104010000"
	},
	{
		"shortname": "华东花苑第一居委会",
		"id": "310104010001034001",
		"parentid": "310104010000"
	},
	{
		"shortname": "华东花苑第二居委会",
		"id": "310104010001035001",
		"parentid": "310104010000"
	},
	{
		"shortname": "汇澜园居委会",
		"id": "310104010001036002",
		"parentid": "310104010000"
	},
	{
		"shortname": "徐汇新城居委会",
		"id": "310104010001037001",
		"parentid": "310104010000"
	},
	{
		"shortname": "中海瀛台居委会",
		"id": "310104010001038001",
		"parentid": "310104010000"
	},
	{
		"shortname": "华滨居委会",
		"id": "310104010001039001",
		"parentid": "310104010000"
	},
	{
		"shortname": "华沁居委会",
		"id": "310104010001040001",
		"parentid": "310104010000"
	},
	{
		"shortname": "田林一、二村居委会",
		"id": "310104011001002001",
		"parentid": "310104011000"
	},
	{
		"shortname": "田林三、四村居委会",
		"id": "310104011001004001",
		"parentid": "310104011000"
	},
	{
		"shortname": "田林十二村居委会",
		"id": "310104011001013002",
		"parentid": "310104011000"
	},
	{
		"shortname": "锦馨苑居委会",
		"id": "310104011001016001",
		"parentid": "310104011000"
	},
	{
		"shortname": "新苑第一、二居委会",
		"id": "310104011001023001",
		"parentid": "310104011000"
	},
	{
		"shortname": "新苑第三、四居委会",
		"id": "310104011001024001",
		"parentid": "310104011000"
	},
	{
		"shortname": "田林十三村居委会",
		"id": "310104011001028001",
		"parentid": "310104011000"
	},
	{
		"shortname": "千鹤第三居委会",
		"id": "310104011001031001",
		"parentid": "310104011000"
	},
	{
		"shortname": "千鹤第五居委会",
		"id": "310104011001033001",
		"parentid": "310104011000"
	},
	{
		"shortname": "万科华尔兹居委会",
		"id": "310104011001035001",
		"parentid": "310104011000"
	},
	{
		"shortname": "古宜居委会",
		"id": "310104011001037001",
		"parentid": "310104011000"
	},
	{
		"shortname": "田林十一村居委会",
		"id": "310104011001038001",
		"parentid": "310104011000"
	},
	{
		"shortname": "华鼎居委会",
		"id": "310104011001039001",
		"parentid": "310104011000"
	},
	{
		"shortname": "千鹤第二、四居委会",
		"id": "310104011001040001",
		"parentid": "310104011000"
	},
	{
		"shortname": "田林五、六、七村居委会",
		"id": "310104011001041001",
		"parentid": "310104011000"
	},
	{
		"shortname": "田林八、九、十村居委会",
		"id": "310104011001042001",
		"parentid": "310104011000"
	},
	{
		"shortname": "新苑第五、六、七居委会",
		"id": "310104011001043001",
		"parentid": "310104011000"
	},
	{
		"shortname": "田林十四村居委会",
		"id": "310104011001044001",
		"parentid": "310104011000"
	},
	{
		"shortname": "长春居委会",
		"id": "310104011001045001",
		"parentid": "310104011000"
	},
	{
		"shortname": "爱建园居委会",
		"id": "310104011001046001",
		"parentid": "310104011000"
	},
	{
		"shortname": "小安桥居委会",
		"id": "310104011001047001",
		"parentid": "310104011000"
	},

	{
		"shortname": "东兰路居委会",
		"id": "310104012001001001",
		"parentid": "310104012000"
	},
	{
		"shortname": "古美路第一居委会",
		"id": "310104012001002001",
		"parentid": "310104012000"
	},
	{
		"shortname": "古美路第二居委会",
		"id": "310104012001003001",
		"parentid": "310104012000"
	},
	{
		"shortname": "钦北居委会",
		"id": "310104012001006001",
		"parentid": "310104012000"
	},
	{
		"shortname": "古美路第三居委会",
		"id": "310104012001007001",
		"parentid": "310104012000"
	},
	{
		"shortname": "古美路第四居委会",
		"id": "310104012001008001",
		"parentid": "310104012000"
	},
	{
		"shortname": "桂林苑居委会",
		"id": "310104012001009001",
		"parentid": "310104012000"
	},
	{
		"shortname": "虹南居委会",
		"id": "310104012001010001",
		"parentid": "310104012000"
	},
	{
		"shortname": "虹星居委会",
		"id": "310104012001011001",
		"parentid": "310104012000"
	},
	{
		"shortname": "航天新苑居委会",
		"id": "310104012001012001",
		"parentid": "310104012000"
	},
	{
		"shortname": "怡桂苑居委会",
		"id": "310104012001013001",
		"parentid": "310104012000"
	},
	{
		"shortname": "永兆居委会",
		"id": "310104012001016001",
		"parentid": "310104012000"
	},
	{
		"shortname": "华悦家园居委会",
		"id": "310104012001017003",
		"parentid": "310104012000"
	},
	{
		"shortname": "漕河泾新兴技术开发区虚拟社区",
		"id": "310104012001801004",
		"parentid": "310104012000"
	},
	{
		"shortname": "寿昌山居委会",
		"id": "310104013001002001",
		"parentid": "310104013000"
	},
	{
		"shortname": "长虹坊居委会",
		"id": "310104013001004001",
		"parentid": "310104013000"
	},
	{
		"shortname": "紫鹃园居委会",
		"id": "310104013001006001",
		"parentid": "310104013000"
	},
	{
		"shortname": "玉兰园居委会",
		"id": "310104013001008001",
		"parentid": "310104013000"
	},
	{
		"shortname": "康乐小区居委会",
		"id": "310104013001009001",
		"parentid": "310104013000"
	},
	{
		"shortname": "长青坊居委会",
		"id": "310104013001011001",
		"parentid": "310104013000"
	},
	{
		"shortname": "樱花园居委会",
		"id": "310104013001015002",
		"parentid": "310104013000"
	},
	{
		"shortname": "康宁强居委会",
		"id": "310104013001018001",
		"parentid": "310104013000"
	},
	{
		"shortname": "寿祥坊居委会",
		"id": "310104013001019001",
		"parentid": "310104013000"
	},
	{
		"shortname": "紫薇园居委会",
		"id": "310104013001020001",
		"parentid": "310104013000"
	},
	{
		"shortname": "茶花桂花居委会",
		"id": "310104013001021001",
		"parentid": "310104013000"
	},
	{
		"shortname": "长顺海居委会",
		"id": "310104013001022001",
		"parentid": "310104013000"
	},
	{
		"shortname": "寿益坊居委会",
		"id": "310104013001023001",
		"parentid": "310104013000"
	},
	{
		"shortname": "月季百藤居委会",
		"id": "310104013001026001",
		"parentid": "310104013000"
	},
	{
		"shortname": "丁香迎春居委会",
		"id": "310104013001027001",
		"parentid": "310104013000"
	},
	{
		"shortname": "师大新村居委会",
		"id": "310104013001028001",
		"parentid": "310104013000"
	},
	{
		"shortname": "桂林路第二居委会",
		"id": "310104013001029001",
		"parentid": "310104013000"
	},
	{
		"shortname": "党校小区居委会",
		"id": "310104013001030001",
		"parentid": "310104013000"
	},
	{
		"shortname": "桂康居委会",
		"id": "310104013001032001",
		"parentid": "310104013000"
	},
	{
		"shortname": "欣园居委会",
		"id": "310104013001033001",
		"parentid": "310104013000"
	},
	{
		"shortname": "联莘居委会",
		"id": "310104013001034001",
		"parentid": "310104013000"
	},
	{
		"shortname": "金桂苑居委会",
		"id": "310104013001035001",
		"parentid": "310104013000"
	},
	{
		"shortname": "紫荆园居委会",
		"id": "310104013001036001",
		"parentid": "310104013000"
	},
	{
		"shortname": "长丰坊居委会",
		"id": "310104013001037001",
		"parentid": "310104013000"
	},
	{
		"shortname": "长兴坊居委会",
		"id": "310104013001038001",
		"parentid": "310104013000"
	},
	{
		"shortname": "东塘居委会",
		"id": "310104014001001001",
		"parentid": "310104014000"
	},
	{
		"shortname": "番禺居委会",
		"id": "310104014001002001",
		"parentid": "310104014000"
	},
	{
		"shortname": "柿子湾居委会",
		"id": "310104014001003001",
		"parentid": "310104014000"
	},
	{
		"shortname": "南丹居委会",
		"id": "310104014001004001",
		"parentid": "310104014000"
	},
	{
		"shortname": "虹交居委会",
		"id": "310104014001006001",
		"parentid": "310104014000"
	},
	{
		"shortname": "西塘居委会",
		"id": "310104014001007001",
		"parentid": "310104014000"
	},
	{
		"shortname": "乐山一村居委会",
		"id": "310104014001008001",
		"parentid": "310104014000"
	},
	{
		"shortname": "乐山二、三村居委会",
		"id": "310104014001009001",
		"parentid": "310104014000"
	},
	{
		"shortname": "乐山四、五村居委会",
		"id": "310104014001010001",
		"parentid": "310104014000"
	},
	{
		"shortname": "乐山六、七村居委会",
		"id": "310104014001011001",
		"parentid": "310104014000"
	},
	{
		"shortname": "乐山八、九村居委会",
		"id": "310104014001012001",
		"parentid": "310104014000"
	},
	{
		"shortname": "虹二居委会",
		"id": "310104014001013001",
		"parentid": "310104014000"
	},
	{
		"shortname": "交大新村居委会",
		"id": "310104014001015001",
		"parentid": "310104014000"
	},
	{
		"shortname": "潘家宅居委会",
		"id": "310104014001016001",
		"parentid": "310104014000"
	},
	{
		"shortname": "汇站居委会",
		"id": "310104014001017001",
		"parentid": "310104014000"
	},
	{
		"shortname": "文定居委会",
		"id": "310104014001018001",
		"parentid": "310104014000"
	},
	{
		"shortname": "陈家宅居委会",
		"id": "310104014001020001",
		"parentid": "310104014000"
	},
	{
		"shortname": "沈马居委会",
		"id": "310104014001021001",
		"parentid": "310104014000"
	},
	{
		"shortname": "零陵居委会",
		"id": "310104014001023001",
		"parentid": "310104014000"
	},
	{
		"shortname": "启明居委会",
		"id": "310104014001024001",
		"parentid": "310104014000"
	},
	{
		"shortname": "南赵巷居委会",
		"id": "310104014001025001",
		"parentid": "310104014000"
	},
	{
		"shortname": "王家堂居委会",
		"id": "310104014001026001",
		"parentid": "310104014000"
	},
	{
		"shortname": "殷家角居委会",
		"id": "310104014001027001",
		"parentid": "310104014000"
	},
	{
		"shortname": "爱华居委会",
		"id": "310104014001028001",
		"parentid": "310104014000"
	},
	{
		"shortname": "科汇居委会",
		"id": "310104014001029001",
		"parentid": "310104014000"
	},
	{
		"shortname": "徐汇新村居委会",
		"id": "310104014001032001",
		"parentid": "310104014000"
	},
	{
		"shortname": "汇翠居委会",
		"id": "310104014001033001",
		"parentid": "310104014000"
	},
	{
		"shortname": "名园居委会",
		"id": "310104014001034001",
		"parentid": "310104014000"
	},
	{
		"shortname": "豪庭居委会",
		"id": "310104014001036001",
		"parentid": "310104014000"
	}, {
		"shortname": "梅陇七村居委会",
		"id": "310104015001009001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇八村居委会",
		"id": "310104015001010001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇九村居委会",
		"id": "310104015001011001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇十村居委会",
		"id": "310104015001012001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇十一村第一居委会",
		"id": "310104015001013001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇十一村第二居委会",
		"id": "310104015001014001",
		"parentid": "310104015000"
	},
	{
		"shortname": "和平居委会",
		"id": "310104015001017001",
		"parentid": "310104015000"
	},
	{
		"shortname": "陇南居委会",
		"id": "310104015001018001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅苑第一居委会",
		"id": "310104015001019001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅苑第二居委会",
		"id": "310104015001020001",
		"parentid": "310104015000"
	},
	{
		"shortname": "龙州居委会",
		"id": "310104015001021001",
		"parentid": "310104015000"
	},
	{
		"shortname": "闵朱居委会",
		"id": "310104015001022001",
		"parentid": "310104015000"
	},
	{
		"shortname": "金塘居委会",
		"id": "310104015001023001",
		"parentid": "310104015000"
	},
	{
		"shortname": "华东理工大学第一居委会",
		"id": "310104015001024001",
		"parentid": "310104015000"
	},
	{
		"shortname": "华东理工大学第二居委会",
		"id": "310104015001025001",
		"parentid": "310104015000"
	},
	{
		"shortname": "舒乐居委会",
		"id": "310104015001026001",
		"parentid": "310104015000"
	},
	{
		"shortname": "家乐苑居委会",
		"id": "310104015001027001",
		"parentid": "310104015000"
	},
	{
		"shortname": "长陇苑居委会",
		"id": "310104015001028001",
		"parentid": "310104015000"
	},
	{
		"shortname": "闵秀居委会",
		"id": "310104015001029001",
		"parentid": "310104015000"
	},
	{
		"shortname": "兴荣苑居委会",
		"id": "310104015001030001",
		"parentid": "310104015000"
	},
	{
		"shortname": "书香苑居委会",
		"id": "310104015001031001",
		"parentid": "310104015000"
	},
	{
		"shortname": "华理苑居委会",
		"id": "310104015001032001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇三村居委会",
		"id": "310104015001035001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇四村居委会",
		"id": "310104015001036001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇五村居委会",
		"id": "310104015001037001",
		"parentid": "310104015000"
	},
	{
		"shortname": "梅陇六村居委会",
		"id": "310104015001038001",
		"parentid": "310104015000"
	},
	{
		"shortname": "凌云新村居委会",
		"id": "310104015001039001",
		"parentid": "310104015000"
	},
	{
		"shortname": "阳光居委会",
		"id": "310104015001040001",
		"parentid": "310104015000"
	},
	{
		"shortname": "周家湾居委会",
		"id": "310104016001002001",
		"parentid": "310104016000"
	},
	{
		"shortname": "龙华新村居委会",
		"id": "310104016001004001",
		"parentid": "310104016000"
	},
	{
		"shortname": "上缝新村居委会",
		"id": "310104016001006001",
		"parentid": "310104016000"
	},
	{
		"shortname": "俞家湾第二居委会",
		"id": "310104016001008001",
		"parentid": "310104016000"
	},
	{
		"shortname": "俞家湾第一居委会",
		"id": "310104016001012001",
		"parentid": "310104016000"
	},
	{
		"shortname": "龙南三、四村居委会",
		"id": "310104016001013001",
		"parentid": "310104016000"
	},
	{
		"shortname": "龙南七村居委会",
		"id": "310104016001014001",
		"parentid": "310104016000"
	},
	{
		"shortname": "丰谷路居委会",
		"id": "310104016001015001",
		"parentid": "310104016000"
	},
	{
		"shortname": "丰谷路第三居委会",
		"id": "310104016001017001",
		"parentid": "310104016000"
	},
	{
		"shortname": "东蔡居委会",
		"id": "310104016001018001",
		"parentid": "310104016000"
	},
	{
		"shortname": "龙南第五居委会",
		"id": "310104016001022001",
		"parentid": "310104016000"
	},
	{
		"shortname": "龙南第六居委会",
		"id": "310104016001023001",
		"parentid": "310104016000"
	},
	{
		"shortname": "俞家湾第三居委会",
		"id": "310104016001024001",
		"parentid": "310104016000"
	},
	{
		"shortname": "机场新村居委会",
		"id": "310104016001026001",
		"parentid": "310104016000"
	},
	{
		"shortname": "狮城花苑居委会",
		"id": "310104016001027001",
		"parentid": "310104016000"
	},
	{
		"shortname": "云锦路居委会",
		"id": "310104016001028001",
		"parentid": "310104016000"
	},
	{
		"shortname": "滨江居委会",
		"id": "310104016001031001",
		"parentid": "310104016000"
	},
	{
		"shortname": "民苑居委会",
		"id": "310104016001034001",
		"parentid": "310104016000"
	},
	{
		"shortname": "华容路居委会",
		"id": "310104016001035001",
		"parentid": "310104016000"
	},
	{
		"shortname": "汇龙居委会",
		"id": "310104016001039001",
		"parentid": "310104016000"
	},
	{
		"shortname": "盛大花苑第一居委会",
		"id": "310104016001040001",
		"parentid": "310104016000"
	},
	{
		"shortname": "强生花苑居委会",
		"id": "310104016001041001",
		"parentid": "310104016000"
	},
	{
		"shortname": "樟树苑居委会",
		"id": "310104016001042001",
		"parentid": "310104016000"
	},
	{
		"shortname": "习勤居委会",
		"id": "310104017001001001",
		"parentid": "310104017000"
	},
	{
		"shortname": "漕溪四村居委会",
		"id": "310104017001004001",
		"parentid": "310104017000"
	},
	{
		"shortname": "西街居委会",
		"id": "310104017001005001",
		"parentid": "310104017000"
	},
	{
		"shortname": "九弄居委会",
		"id": "310104017001006001",
		"parentid": "310104017000"
	},
	{
		"shortname": "科苑居委会",
		"id": "310104017001009001",
		"parentid": "310104017000"
	},
	{
		"shortname": "冠生园居委会",
		"id": "310104017001012001",
		"parentid": "310104017000"
	},
	{
		"shortname": "凯翔居委会",
		"id": "310104017001013001",
		"parentid": "310104017000"
	},
	{
		"shortname": "薛家宅居委会",
		"id": "310104017001014001",
		"parentid": "310104017000"
	},
	{
		"shortname": "康健路居委会",
		"id": "310104017001018001",
		"parentid": "310104017000"
	},
	{
		"shortname": "金谷园居委会",
		"id": "310104017001021001",
		"parentid": "310104017000"
	},
	{
		"shortname": "龙漕居委会",
		"id": "310104017001028001",
		"parentid": "310104017000"
	},
	{
		"shortname": "南一村第一居委会",
		"id": "310104017001030001",
		"parentid": "310104017000"
	},
	{
		"shortname": "南一村第二居委会",
		"id": "310104017001031001",
		"parentid": "310104017000"
	},
	{
		"shortname": "中海馨园居委会",
		"id": "310104017001032001",
		"parentid": "310104017000"
	},
	{
		"shortname": "宏润花园居委会",
		"id": "310104017001033001",
		"parentid": "310104017000"
	},
	{
		"shortname": "梓树园居委会",
		"id": "310104017001034001",
		"parentid": "310104017000"
	},
	{
		"shortname": "佳友居委会",
		"id": "310104017001035001",
		"parentid": "310104017000"
	},
	{
		"shortname": "华富居委会",
		"id": "310104017001037001",
		"parentid": "310104017000"
	},
	{
		"shortname": "挹翠苑居委会",
		"id": "310104017001038001",
		"parentid": "310104017000"
	},
	{
		"shortname": "张家园居委会",
		"id": "310104017001039001",
		"parentid": "310104017000"
	},
	{
		"shortname": "东泉路居委会",
		"id": "310104017001040001",
		"parentid": "310104017000"
	},
	{
		"shortname": "东荡居委会",
		"id": "310104017001041001",
		"parentid": "310104017000"
	},
	{
		"shortname": "金牛居委会",
		"id": "310104017001042001",
		"parentid": "310104017000"
	},
	{
		"shortname": "罗城居委会",
		"id": "310104017001043001",
		"parentid": "310104017000"
	},
	{
		"shortname": "正南花苑居委会",
		"id": "310104017001044001",
		"parentid": "310104017000"
	},
	{
		"shortname": "嘉萱苑居委会",
		"id": "310104017001045001",
		"parentid": "310104017000"
	},
	{
		"shortname": "宾阳路居委会",
		"id": "310104017001046001",
		"parentid": "310104017000"
	},
	{
		"shortname": "漕东居委会",
		"id": "310104017001047001",
		"parentid": "310104017000"
	},
	{
		"shortname": "月河居委会",
		"id": "310104017001048001",
		"parentid": "310104017000"
	},
	{
		"shortname": "馨汇南苑居委会",
		"id": "310104017001049001",
		"parentid": "310104017000"
	},
	{
		"shortname": "华建居委会",
		"id": "310104103001001002",
		"parentid": "310104103000"
	},
	{
		"shortname": "大桥居委会",
		"id": "310104103001003002",
		"parentid": "310104103000"
	},
	{
		"shortname": "华泾四村居委会",
		"id": "310104103001004002",
		"parentid": "310104103000"
	},
	{
		"shortname": "华发居委会",
		"id": "310104103001005001",
		"parentid": "310104103000"
	},
	{
		"shortname": "华阳居委会",
		"id": "310104103001006001",
		"parentid": "310104103000"
	},
	{
		"shortname": "沙家浜居委会",
		"id": "310104103001007001",
		"parentid": "310104103000"
	},
	{
		"shortname": "名苑居委会",
		"id": "310104103001009001",
		"parentid": "310104103000"
	},
	{
		"shortname": "华泾五村居委会",
		"id": "310104103001010002",
		"parentid": "310104103000"
	},
	{
		"shortname": "光华绿苑居委会",
		"id": "310104103001011001",
		"parentid": "310104103000"
	},
	{
		"shortname": "华欣家园居委会",
		"id": "310104103001012001",
		"parentid": "310104103000"
	},
	{
		"shortname": "明丰居委会",
		"id": "310104103001013001",
		"parentid": "310104103000"
	},
	{
		"shortname": "华臻居委会",
		"id": "310104103001014001",
		"parentid": "310104103000"
	},
	{
		"shortname": "漓江山水居委会",
		"id": "310104103001016001",
		"parentid": "310104103000"
	},
	{
		"shortname": "华泾绿苑居委会",
		"id": "310104103001017001",
		"parentid": "310104103000"
	},
	{
		"shortname": "馨宁居委会",
		"id": "310104103001018001",
		"parentid": "310104103000"
	},
	{
		"shortname": "印象旭辉居委会",
		"id": "310104103001019001",
		"parentid": "310104103000"
	},
	{
		"shortname": "盛华景苑居委会",
		"id": "310104103001020001",
		"parentid": "310104103000"
	},
	{
		"shortname": "华阳路一居委会",
		"id": "310105001001001001",
		"parentid": "310105001000"
	},
	{
		"shortname": "华阳路二居委会",
		"id": "310105001001002001",
		"parentid": "310105001000"
	},
	{
		"shortname": "华阳路三居委会",
		"id": "310105001001003001",
		"parentid": "310105001000"
	},
	{
		"shortname": "华阳路四居委会",
		"id": "310105001001004001",
		"parentid": "310105001000"
	},
	{
		"shortname": "华阳路五居委会",
		"id": "310105001001005001",
		"parentid": "310105001000"
	},
	{
		"shortname": "华院居委会",
		"id": "310105001001006001",
		"parentid": "310105001000"
	},
	{
		"shortname": "秀水居委会",
		"id": "310105001001007001",
		"parentid": "310105001000"
	},
	{
		"shortname": "长宁路一居委会",
		"id": "310105001001008001",
		"parentid": "310105001000"
	},
	{
		"shortname": "长宁支路二居委会",
		"id": "310105001001010001",
		"parentid": "310105001000"
	},
	{
		"shortname": "长宁路二居委会",
		"id": "310105001001013001",
		"parentid": "310105001000"
	},
	{
		"shortname": "苏一居委会",
		"id": "310105001001014001",
		"parentid": "310105001000"
	},
	{
		"shortname": "潘东居委会",
		"id": "310105001001016001",
		"parentid": "310105001000"
	},
	{
		"shortname": "潘西居委会",
		"id": "310105001001017001",
		"parentid": "310105001000"
	},
	{
		"shortname": "陶家宅居委会",
		"id": "310105001001019001",
		"parentid": "310105001000"
	},
	{
		"shortname": "徐家宅居委会",
		"id": "310105001001020001",
		"parentid": "310105001000"
	},
	{
		"shortname": "姚家角居委会",
		"id": "310105001001021001",
		"parentid": "310105001000"
	},
	{
		"shortname": "建宁居委会",
		"id": "310105001001022001",
		"parentid": "310105001000"
	},
	{
		"shortname": "潘中居委会",
		"id": "310105001001024001",
		"parentid": "310105001000"
	},
	{
		"shortname": "天诚居委会",
		"id": "310105001001025001",
		"parentid": "310105001000"
	},
	{
		"shortname": "飞乐居委会",
		"id": "310105001001026001",
		"parentid": "310105001000"
	},
	{
		"shortname": "西一居委会",
		"id": "310105001001027001",
		"parentid": "310105001000"
	},
	{
		"shortname": "岐山居委会",
		"id": "310105002001002001",
		"parentid": "310105002000"
	},
	{
		"shortname": "江苏居委会",
		"id": "310105002001003001",
		"parentid": "310105002000"
	},
	{
		"shortname": "万村居委会",
		"id": "310105002001006001",
		"parentid": "310105002000"
	},
	{
		"shortname": "南汪居委会",
		"id": "310105002001007001",
		"parentid": "310105002000"
	},
	{
		"shortname": "东浜居委会",
		"id": "310105002001008001",
		"parentid": "310105002000"
	},
	{
		"shortname": "愚三居委会",
		"id": "310105002001009001",
		"parentid": "310105002000"
	},
	{
		"shortname": "曹家堰居委会",
		"id": "310105002001010001",
		"parentid": "310105002000"
	},
	{
		"shortname": "西浜居委会",
		"id": "310105002001011001",
		"parentid": "310105002000"
	},
	{
		"shortname": "福世居委会",
		"id": "310105002001012001",
		"parentid": "310105002000"
	},
	{
		"shortname": "长新居委会",
		"id": "310105002001013001",
		"parentid": "310105002000"
	},
	{
		"shortname": "华山居委会",
		"id": "310105002001014001",
		"parentid": "310105002000"
	},
	{
		"shortname": "利西居委会",
		"id": "310105002001015001",
		"parentid": "310105002000"
	},
	{
		"shortname": "北汪居委会",
		"id": "310105002001016001",
		"parentid": "310105002000"
	},
	{
		"shortname": "番禺居委会",
		"id": "310105004001001001",
		"parentid": "310105004000"
	},
	{
		"shortname": "牛桥居委会",
		"id": "310105004001002001",
		"parentid": "310105004000"
	},
	{
		"shortname": "人民居委会",
		"id": "310105004001003001",
		"parentid": "310105004000"
	},
	{
		"shortname": "西镇居委会",
		"id": "310105004001004001",
		"parentid": "310105004000"
	},
	{
		"shortname": "杨宅居委会",
		"id": "310105004001005001",
		"parentid": "310105004000"
	},
	{
		"shortname": "香花居委会",
		"id": "310105004001007001",
		"parentid": "310105004000"
	},
	{
		"shortname": "新华居委会",
		"id": "310105004001008001",
		"parentid": "310105004000"
	},
	{
		"shortname": "梅安居委会",
		"id": "310105004001009001",
		"parentid": "310105004000"
	},
	{
		"shortname": "左家宅居委会",
		"id": "310105004001010001",
		"parentid": "310105004000"
	},
	{
		"shortname": "田渡居委会",
		"id": "310105004001011001",
		"parentid": "310105004000"
	},
	{
		"shortname": "泰安居委会",
		"id": "310105004001012001",
		"parentid": "310105004000"
	},
	{
		"shortname": "陈家巷居委会",
		"id": "310105004001013001",
		"parentid": "310105004000"
	},
	{
		"shortname": "东镇居委会",
		"id": "310105004001014001",
		"parentid": "310105004000"
	},
	{
		"shortname": "红庄居委会",
		"id": "310105004001015001",
		"parentid": "310105004000"
	},
	{
		"shortname": "幸福居委会",
		"id": "310105004001017001",
		"parentid": "310105004000"
	},
	{
		"shortname": "和平居委会",
		"id": "310105004001018001",
		"parentid": "310105004000"
	},
	{
		"shortname": "张家宅居委会",
		"id": "310105004001019001",
		"parentid": "310105004000"
	},
	{
		"shortname": "范北居委会",
		"id": "310105005001001001",
		"parentid": "310105005000"
	},
	{
		"shortname": "三泾北宅居委会",
		"id": "310105005001003001",
		"parentid": "310105005000"
	},
	{
		"shortname": "三泾南宅居委会",
		"id": "310105005001004001",
		"parentid": "310105005000"
	},
	{
		"shortname": "武夷居委会",
		"id": "310105005001005001",
		"parentid": "310105005000"
	},
	{
		"shortname": "沈家郎居委会",
		"id": "310105005001006001",
		"parentid": "310105005000"
	},
	{
		"shortname": "周一居委会",
		"id": "310105005001007001",
		"parentid": "310105005000"
	},
	{
		"shortname": "周二居委会",
		"id": "310105005001008001",
		"parentid": "310105005000"
	},
	{
		"shortname": "杨家宅居委会",
		"id": "310105005001012001",
		"parentid": "310105005000"
	},
	{
		"shortname": "锦屏居委会",
		"id": "310105005001013001",
		"parentid": "310105005000"
	},
	{
		"shortname": "古南居委会",
		"id": "310105005001016001",
		"parentid": "310105005000"
	},
	{
		"shortname": "上海花城居委会",
		"id": "310105005001017001",
		"parentid": "310105005000"
	},
	{
		"shortname": "虹桥新城居委会",
		"id": "310105005001018001",
		"parentid": "310105005000"
	},
	{
		"shortname": "长宁新城居委会",
		"id": "310105005001019001",
		"parentid": "310105005000"
	},
	{
		"shortname": "中山公寓居委会",
		"id": "310105005001020001",
		"parentid": "310105005000"
	},
	{
		"shortname": "大家源居委会",
		"id": "310105005001021001",
		"parentid": "310105005000"
	},
	{
		"shortname": "虹桥万博花园居委会",
		"id": "310105005001022001",
		"parentid": "310105005000"
	},
	{
		"shortname": "春天花园居委会",
		"id": "310105005001023001",
		"parentid": "310105005000"
	},
	{
		"shortname": "天山河畔花园居委会",
		"id": "310105005001024001",
		"parentid": "310105005000"
	},
	{
		"shortname": "新天地河滨花园居委会",
		"shortname": "仁恒河滨花园居委会",
		"id": "310105005001025001",
		"parentid": "310105005000"
	},
	{
		"shortname": "天山华庭居委会",
		"id": "310105005001026001",
		"parentid": "310105005000"
	},
	{
		"id": "310105005001027001",
		"parentid": "310105005000"
	},
	{
		"shortname": "天山二村居委会",
		"id": "310105006001001001",
		"parentid": "310105006000"
	},
	{
		"shortname": "天山三村居委会",
		"id": "310105006001002001",
		"parentid": "310105006000"
	},
	{
		"shortname": "天山四村居委会",
		"id": "310105006001003001",
		"parentid": "310105006000"
	},
	{
		"shortname": "茅台居委会",
		"id": "310105006001004001",
		"parentid": "310105006000"
	},
	{
		"shortname": "仙霞居委会",
		"id": "310105006001005001",
		"parentid": "310105006000"
	},
	{
		"shortname": "天山居委会",
		"id": "310105006001007001",
		"parentid": "310105006000"
	},
	{
		"shortname": "天义居委会",
		"id": "310105006001008001",
		"parentid": "310105006000"
	},
	{
		"shortname": "天支居委会",
		"id": "310105006001009001",
		"parentid": "310105006000"
	},
	{
		"shortname": "新光居委会",
		"id": "310105006001010001",
		"parentid": "310105006000"
	},
	{
		"shortname": "新风居委会",
		"id": "310105006001011001",
		"parentid": "310105006000"
	},
	{
		"shortname": "玉屏居委会",
		"id": "310105006001012001",
		"parentid": "310105006000"
	},
	{
		"shortname": "遵义居委会",
		"id": "310105006001013001",
		"parentid": "310105006000"
	},
	{
		"shortname": "友谊居委会",
		"id": "310105006001014001",
		"parentid": "310105006000"
	},
	{
		"shortname": "紫云居委会",
		"id": "310105006001015001",
		"parentid": "310105006000"
	},
	{
		"shortname": "联建居委会",
		"id": "310105006001016001",
		"parentid": "310105006000"
	},
	{
		"shortname": "中紫居委会",
		"id": "310105006001017001",
		"parentid": "310105006000"
	},
	{
		"shortname": "延西居委会",
		"id": "310105006001018001",
		"parentid": "310105006000"
	},
	{
		"shortname": "纺大居委会",
		"id": "310105006001019001",
		"parentid": "310105006000"
	},
	{
		"shortname": "天山五村一居委会",
		"id": "310105008001001001",
		"parentid": "310105008000"
	},
	{
		"shortname": "天山五村三居委会",
		"id": "310105008001002001",
		"parentid": "310105008000"
	},
	{
		"shortname": "芙蓉江路第一居委会",
		"id": "310105008001003001",
		"parentid": "310105008000"
	},
	{
		"shortname": "芙蓉江路第二居委会",
		"id": "310105008001004001",
		"parentid": "310105008000"
	},
	{
		"shortname": "大金更居委会",
		"id": "310105008001005001",
		"parentid": "310105008000"
	},
	{
		"shortname": "天原二村居委会",
		"id": "310105008001006001",
		"parentid": "310105008000"
	},
	{
		"shortname": "虹日居委会",
		"id": "310105008001007001",
		"parentid": "310105008000"
	},
	{
		"shortname": "虹古居委会",
		"id": "310105008001008001",
		"parentid": "310105008000"
	},
	{
		"shortname": "虹纺居委会",
		"id": "310105008001009001",
		"parentid": "310105008000"
	},
	{
		"shortname": "虹霞居委会",
		"id": "310105008001010001",
		"parentid": "310105008000"
	},
	{
		"shortname": "虹旭居委会",
		"id": "310105008001011001",
		"parentid": "310105008000"
	},
	{
		"shortname": "虹仙居委会",
		"id": "310105008001012001",
		"parentid": "310105008000"
	},
	{
		"shortname": "锦苑居委会",
		"id": "310105008001013001",
		"parentid": "310105008000"
	},
	{
		"shortname": "仙逸居委会",
		"id": "310105008001014001",
		"parentid": "310105008000"
	},
	{
		"shortname": "仙二居委会",
		"id": "310105008001015001",
		"parentid": "310105008000"
	},
	{
		"shortname": "杜一居委会",
		"id": "310105008001016001",
		"parentid": "310105008000"
	},
	{
		"shortname": "水霞居委会",
		"id": "310105008001018001",
		"parentid": "310105008000"
	},
	{
		"shortname": "古宋居委会",
		"id": "310105008001019001",
		"parentid": "310105008000"
	},
	{
		"shortname": "茅台新苑居委会",
		"id": "310105008001020001",
		"parentid": "310105008000"
	},
	{
		"shortname": "威宁居委会",
		"id": "310105008001021001",
		"parentid": "310105008000"
	},
	{
		"shortname": "虹景居委会",
		"id": "310105008001022001",
		"parentid": "310105008000"
	},
	{
		"shortname": "茅台花苑居委会",
		"id": "310105008001023001",
		"parentid": "310105008000"
	},
	{
		"shortname": "安龙居委会",
		"id": "310105008001024001",
		"parentid": "310105008000"
	},

	{
		"shortname": "安东居委会",
		"id": "310105009001001001",
		"parentid": "310105009000"
	},
	{
		"shortname": "何家角居委会",
		"id": "310105009001002001",
		"parentid": "310105009000"
	},
	{
		"shortname": "长顺居委会",
		"id": "310105009001003001",
		"parentid": "310105009000"
	},
	{
		"shortname": "新顺居委会",
		"id": "310105009001004001",
		"parentid": "310105009000"
	},
	{
		"shortname": "长虹居委会",
		"id": "310105009001006001",
		"parentid": "310105009000"
	},
	{
		"shortname": "虹南居委会",
		"id": "310105009001007001",
		"parentid": "310105009000"
	},
	{
		"shortname": "虹桥居委会",
		"id": "310105009001008001",
		"parentid": "310105009000"
	},
	{
		"shortname": "爱建居委会",
		"id": "310105009001009001",
		"parentid": "310105009000"
	},
	{
		"shortname": "伊犁居委会",
		"id": "310105009001010001",
		"parentid": "310105009000"
	},
	{
		"shortname": "虹储居委会",
		"id": "310105009001011001",
		"parentid": "310105009000"
	},
	{
		"shortname": "虹许居委会",
		"id": "310105009001012001",
		"parentid": "310105009000"
	},
	{
		"shortname": "虹梅居委会",
		"id": "310105009001013001",
		"parentid": "310105009000"
	},
	{
		"shortname": "荣华居委会",
		"id": "310105009001014001",
		"parentid": "310105009000"
	},
	{
		"shortname": "虹东居委会",
		"id": "310105009001015001",
		"parentid": "310105009000"
	},
	{
		"shortname": "中山居委会",
		"id": "310105009001016001",
		"parentid": "310105009000"
	},
	{
		"shortname": "虹欣居委会",
		"id": "310105009001017001",
		"parentid": "310105009000"
	},
	{
		"shortname": "程桥一村居委会",
		"id": "310105010001001001",
		"parentid": "310105010000"
	},
	{
		"shortname": "程桥二村居委会",
		"id": "310105010001002001",
		"parentid": "310105010000"
	},
	{
		"shortname": "宝北居委会",
		"id": "310105010001003001",
		"parentid": "310105010000"
	},
	{
		"shortname": "机场新村居委会",
		"id": "310105010001004001",
		"parentid": "310105010000"
	},
	{
		"shortname": "王满泗桥居委会",
		"id": "310105010001005001",
		"parentid": "310105010000"
	},
	{
		"shortname": "南龚居委会",
		"id": "310105010001006001",
		"parentid": "310105010000"
	},
	{
		"shortname": "上航新村居委会",
		"id": "310105010001007001",
		"parentid": "310105010000"
	},
	{
		"shortname": "嘉利豪园居委会",
		"id": "310105010001009001",
		"parentid": "310105010000"
	},
	{
		"shortname": "新泾一村一居委会",
		"id": "310105011001001001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾一村二居委会",
		"id": "310105011001002001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾二村居委会",
		"id": "310105011001003001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾三村居委会",
		"id": "310105011001004001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾四村居委会",
		"id": "310105011001006001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾五村居委会",
		"id": "310105011001007001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾六村居委会",
		"id": "310105011001008001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾七村居委会",
		"id": "310105011001009001",
		"parentid": "310105011000"
	},
	{
		"shortname": "新泾八村居委会",
		"id": "310105011001010001",
		"parentid": "310105011000"
	},
	{
		"shortname": "北翟路居委会",
		"id": "310105011001011001",
		"parentid": "310105011000"
	},
	{
		"shortname": "蒲淞北路居委会",
		"id": "310105011001012001",
		"parentid": "310105011000"
	},
	{
		"shortname": "哈密新村居委会",
		"id": "310105011001013001",
		"parentid": "310105011000"
	},
	{
		"shortname": "元丰花园居委会",
		"id": "310105011001014002",
		"parentid": "310105011000"
	},
	{
		"shortname": "金平居委会",
		"id": "310105011001015001",
		"parentid": "310105011000"
	},
	{
		"shortname": "剑河家苑居委会",
		"id": "310105011001016001",
		"parentid": "310105011000"
	},
	{
		"shortname": "刘家宅一居委会",
		"id": "310105102001001001",
		"parentid": "310105102000"
	},
	{
		"shortname": "刘家宅二居委会",
		"id": "310105102001002001",
		"parentid": "310105102000"
	},
	{
		"shortname": "刘家宅三居委会",
		"id": "310105102001003001",
		"parentid": "310105102000"
	},
	{
		"shortname": "刘家宅四居委会",
		"id": "310105102001004001",
		"parentid": "310105102000"
	},
	{
		"shortname": "福泉路居委会",
		"id": "310105102001005001",
		"parentid": "310105102000"
	},
	{
		"shortname": "淮阴路居委会",
		"id": "310105102001006001",
		"parentid": "310105102000"
	},
	{
		"shortname": "淞虹二居委会",
		"id": "310105102001008001",
		"parentid": "310105102000"
	},
	{
		"shortname": "淞虹三居委会",
		"id": "310105102001009001",
		"parentid": "310105102000"
	},
	{
		"shortname": "淞虹四居委会",
		"id": "310105102001010001",
		"parentid": "310105102000"
	},
	{
		"shortname": "淞虹五居委会",
		"id": "310105102001011001",
		"parentid": "310105102000"
	},
	{
		"shortname": "华松居委会",
		"id": "310105102001012001",
		"parentid": "310105102000"
	},
	{
		"shortname": "曙光居委会",
		"id": "310105102001013001",
		"parentid": "310105102000"
	},
	{
		"shortname": "屈家桥居委会",
		"id": "310105102001014001",
		"parentid": "310105102000"
	},
	{
		"shortname": "绿园一村居委会",
		"id": "310105102001015001",
		"parentid": "310105102000"
	},
	{
		"shortname": "绿园新村五居委会",
		"id": "310105102001016001",
		"parentid": "310105102000"
	},
	{
		"shortname": "绿园新村八居委会",
		"id": "310105102001017001",
		"parentid": "310105102000"
	},
	{
		"shortname": "绿园新村十一居委会",
		"id": "310105102001018001",
		"parentid": "310105102000"
	},
	{
		"shortname": "绿园新村十二居委会",
		"id": "310105102001019001",
		"parentid": "310105102000"
	},
	{
		"shortname": "北虹居委会",
		"id": "310105102001021001",
		"parentid": "310105102000"
	},
	{
		"shortname": "程桥居委会",
		"id": "310105102001024001",
		"parentid": "310105102000"
	},
	{
		"shortname": "中泾居委会",
		"id": "310105102001025001",
		"parentid": "310105102000"
	},
	{
		"shortname": "林泉居委会",
		"id": "310105102001026001",
		"parentid": "310105102000"
	},
	{
		"shortname": "双流路居委会",
		"id": "310105102001027001",
		"parentid": "310105102000"
	},
	{
		"shortname": "新渔东路居委会",
		"id": "310105102001028001",
		"parentid": "310105102000"
	},
	{
		"shortname": "定威路居委会",
		"id": "310105102001030001",
		"parentid": "310105102000"
	},
	{
		"shortname": "虹园新村九居委会",
		"id": "310105102001031001",
		"parentid": "310105102000"
	},
	{
		"shortname": "平塘居委会",
		"id": "310105102001032001",
		"parentid": "310105102000"
	},
	{
		"shortname": "虹康居委会",
		"id": "310105102001033001",
		"parentid": "310105102000"
	},
	{
		"shortname": "南洋新都居委会",
		"id": "310105102001034001",
		"parentid": "310105102000"
	},
	{
		"shortname": "新泾居委会",
		"id": "310105102001035001",
		"parentid": "310105102000"
	},
	{
		"shortname": "怡景苑居委会",
		"id": "310105102001036001",
		"parentid": "310105102000"
	},
	{
		"shortname": "天山星城居委会",
		"id": "310105102001037001",
		"parentid": "310105102000"
	},
	{
		"shortname": "新泾北苑居委会",
		"id": "310105102001038001",
		"parentid": "310105102000"
	},
	{
		"shortname": "新安居委会",
		"id": "310106006001002001",
		"parentid": "310106006000"
	},
	{
		"shortname": "永乐居委会",
		"id": "310106006001003001",
		"parentid": "310106006000"
	},
	{
		"shortname": "联宝里居委会",
		"id": "310106006001005001",
		"parentid": "310106006000"
	},
	{
		"shortname": "恒德里居委会",
		"id": "310106006001006001",
		"parentid": "310106006000"
	},
	{
		"shortname": "景苑居委会",
		"id": "310106006001008001",
		"parentid": "310106006000"
	},
	{
		"shortname": "又一村居委会",
		"id": "310106006001009001",
		"parentid": "310106006000"
	},
	{
		"shortname": "北京居委会",
		"id": "310106006001011001",
		"parentid": "310106006000"
	},
	{
		"shortname": "众乐里居委会",
		"id": "310106006001013001",
		"parentid": "310106006000"
	},
	{
		"shortname": "武定坊居委会",
		"id": "310106006001014001",
		"parentid": "310106006000"
	},
	{
		"shortname": "三星坊居委会",
		"id": "310106006001015001",
		"parentid": "310106006000"
	},
	{
		"shortname": "蒋家巷居委会",
		"id": "310106006001019001",
		"parentid": "310106006000"
	},
	{
		"shortname": "海防村居委会",
		"id": "310106006001020001",
		"parentid": "310106006000"
	},
	{
		"shortname": "宝安坊居委会",
		"id": "310106006001022001",
		"parentid": "310106006000"
	},
	{
		"shortname": "通安里居委会",
		"id": "310106006001024001",
		"parentid": "310106006000"
	},
	{
		"shortname": "淮安里居委会",
		"id": "310106006001026001",
		"parentid": "310106006000"
	},
	{
		"shortname": "三乐里居委会",
		"id": "310106006001027001",
		"parentid": "310106006000"
	},
	{
		"shortname": "句容里居委会",
		"id": "310106006001028001",
		"parentid": "310106006000"
	},
	{
		"shortname": "天河居委会",
		"id": "310106006001029001",
		"parentid": "310106006000"
	},
	{
		"shortname": "奉贤居委会",
		"id": "310106011001002002",
		"parentid": "310106011000"
	},
	{
		"shortname": "东王居委会",
		"id": "310106011001003001",
		"parentid": "310106011000"
	},
	{
		"shortname": "新德居委会",
		"id": "310106011001004001",
		"parentid": "310106011000"
	},
	{
		"shortname": "郑家巷居委会",
		"id": "310106011001007001",
		"parentid": "310106011000"
	},
	{
		"shortname": "张家宅居委会",
		"id": "310106011001008001",
		"parentid": "310106011000"
	},
	{
		"shortname": "祥福居委会",
		"id": "310106011001013001",
		"parentid": "310106011000"
	},
	{
		"shortname": "达安城居委会",
		"id": "310106011001021001",
		"parentid": "310106011000"
	},
	{
		"shortname": "新福康里居委会",
		"id": "310106011001022001",
		"parentid": "310106011000"
	},
	{
		"shortname": "恒丰居委会",
		"id": "310106011001023001",
		"parentid": "310106011000"
	},
	{
		"shortname": "华沁居委会",
		"id": "310106011001026001",
		"parentid": "310106011000"
	},
	{
		"shortname": "斯文里居委会",
		"id": "310106011001027001",
		"parentid": "310106011000"
	},
	{
		"shortname": "延中居委会",
		"id": "310106012001002001",
		"parentid": "310106012000"
	},
	{
		"shortname": "联华居委会",
		"id": "310106012001003001",
		"parentid": "310106012000"
	},
	{
		"shortname": "华业居委会",
		"id": "310106012001005001",
		"parentid": "310106012000"
	},
	{
		"shortname": "陕南居委会",
		"id": "310106012001006001",
		"parentid": "310106012000"
	},
	{
		"shortname": "古柏居委会",
		"id": "310106012001007001",
		"parentid": "310106012000"
	},
	{
		"shortname": "陕北居委会",
		"id": "310106012001009001",
		"parentid": "310106012000"
	},
	{
		"shortname": "新成居委会",
		"id": "310106012001011001",
		"parentid": "310106012000"
	},
	{
		"shortname": "中凯居委会",
		"id": "310106012001012001",
		"parentid": "310106012000"
	},
	{
		"shortname": "泰兴居委会",
		"id": "310106012001013001",
		"parentid": "310106012000"
	},
	{
		"shortname": "重华居委会",
		"id": "310106012001018001",
		"parentid": "310106012000"
	},
	{
		"shortname": "茂北居委会",
		"id": "310106012001019001",
		"parentid": "310106012000"
	},
	{
		"shortname": "升平居委会",
		"id": "310106012001021001",
		"parentid": "310106012000"
	},
	{
		"shortname": "威海居委会",
		"id": "310106012001022001",
		"parentid": "310106012000"
	},
	{
		"shortname": "愚谷村居委会",
		"id": "310106013001001001",
		"parentid": "310106013000"
	},
	{
		"shortname": "四明居委会",
		"id": "310106013001002001",
		"parentid": "310106013000"
	},
	{
		"shortname": "静安居委会",
		"id": "310106013001005001",
		"parentid": "310106013000"
	},
	{
		"shortname": "三义坊居委会",
		"id": "310106013001008001",
		"parentid": "310106013000"
	},
	{
		"shortname": "百乐居委会",
		"id": "310106013001010001",
		"parentid": "310106013000"
	},
	{
		"shortname": "景华居委会",
		"id": "310106013001011001",
		"parentid": "310106013000"
	},
	{
		"shortname": "华山居委会",
		"id": "310106013001015001",
		"parentid": "310106013000"
	},
	{
		"shortname": "海园居委会",
		"id": "310106013001016001",
		"parentid": "310106013000"
	},
	{
		"shortname": "美丽园居委会",
		"id": "310106013001017001",
		"parentid": "310106013000"
	},
	{
		"shortname": "裕华居委会",
		"id": "310106013001018001",
		"parentid": "310106013000"
	},
	{
		"shortname": "嘉园居委会",
		"id": "310106013001019001",
		"parentid": "310106013000"
	},
	{
		"shortname": "叶庆居委会",
		"id": "310106014001003001",
		"parentid": "310106014000"
	},
	{
		"shortname": "武南居委会",
		"id": "310106014001004001",
		"parentid": "310106014000"
	},
	{
		"shortname": "中行别业居委会",
		"id": "310106014001006001",
		"parentid": "310106014000"
	},
	{
		"shortname": "高荣居委会",
		"id": "310106014001007001",
		"parentid": "310106014000"
	},
	{
		"shortname": "万航居委会",
		"id": "310106014001009001",
		"parentid": "310106014000"
	},
	{
		"shortname": "武西居委会",
		"id": "310106014001011001",
		"parentid": "310106014000"
	},
	{
		"shortname": "长春居委会",
		"id": "310106014001012001",
		"parentid": "310106014000"
	},
	{
		"shortname": "玉兰村居委会",
		"id": "310106014001015001",
		"parentid": "310106014000"
	},
	{
		"shortname": "姚西居委会",
		"id": "310106014001016001",
		"parentid": "310106014000"
	},
	{
		"shortname": "康定居委会",
		"id": "310106014001017001",
		"parentid": "310106014000"
	},
	{
		"shortname": "四和花园居委会",
		"id": "310106014001020001",
		"parentid": "310106014000"
	},
	{
		"shortname": "三和花园居委会",
		"id": "310106014001021001",
		"parentid": "310106014000"
	},
	{
		"shortname": "均泰居委会",
		"id": "310106014001022001",
		"parentid": "310106014000"
	},
	{
		"shortname": "达安花园居委会",
		"id": "310106014001023001",
		"parentid": "310106014000"
	},
	{
		"shortname": "蕃瓜弄居委会",
		"id": "310106015001001001",
		"parentid": "310106001000"
	},
	{
		"shortname": "卓悦居居委会",
		"id": "310106015001002001",
		"parentid": "310106001000"
	},
	{
		"shortname": "华康居委会",
		"id": "310106015001003001",
		"parentid": "310106001000"
	},
	{
		"shortname": "新桥居委会",
		"id": "310106015001004001",
		"parentid": "310106001000"
	},
	{
		"shortname": "华新居委会",
		"id": "310106015001005001",
		"parentid": "310106001000"
	},
	{
		"shortname": "地梨港居委会",
		"id": "310106015001006001",
		"parentid": "310106001000"
	},
	{
		"shortname": "华丰居委会",
		"id": "310106015001007001",
		"parentid": "310106001000"
	},
	{
		"shortname": "普善居委会",
		"id": "310106015001008001",
		"parentid": "310106001000"
	},
	{
		"shortname": "铁路新村居委会",
		"id": "310106015001009001",
		"parentid": "310106001000"
	},
	{
		"shortname": "和泰花苑居委会",
		"id": "310106015001010001",
		"parentid": "310106001000"
	},
	{
		"shortname": "安源居委会",
		"id": "310106015001011001",
		"parentid": "310106001000"
	},
	{
		"shortname": "河滨融景居委会",
		"id": "310106015001012001",
		"parentid": "310106001000"
	}, {
		"shortname": "新泰居委会",
		"id": "310106016001001001",
		"parentid": "310106002000"
	},
	{
		"shortname": "顺庆里居委会",
		"id": "310106016001002001",
		"parentid": "310106002000"
	},
	{
		"shortname": "文安居委会",
		"id": "310106016001003001",
		"parentid": "310106002000"
	},
	{
		"shortname": "南高居委会",
		"id": "310106016001004001",
		"parentid": "310106002000"
	},
	{
		"shortname": "卫星居委会",
		"id": "310106016001005001",
		"parentid": "310106002000"
	},
	{
		"shortname": "图南居委会",
		"id": "310106016001006001",
		"parentid": "310106002000"
	},
	{
		"shortname": "北高居委会",
		"id": "310106016001007001",
		"parentid": "310106002000"
	},
	{
		"shortname": "均益居委会",
		"id": "310106016001008001",
		"parentid": "310106002000"
	},
	{
		"shortname": "颐福里居委会",
		"id": "310106016001009001",
		"parentid": "310106002000"
	},
	{
		"shortname": "来安居委会",
		"id": "310106016001010001",
		"parentid": "310106002000"
	},
	{
		"shortname": "南林居委会",
		"id": "310106016001011001",
		"parentid": "310106002000"
	},
	{
		"shortname": "天保里居委会",
		"id": "310106016001012001",
		"parentid": "310106002000"
	},
	{
		"shortname": "华安坊居委会",
		"id": "310106016001013001",
		"parentid": "310106002000"
	},
	{
		"shortname": "北市场居委会",
		"id": "310106016001014001",
		"parentid": "310106002000"
	},
	{
		"shortname": "蒙古路居委会",
		"id": "310106016001015001",
		"parentid": "310106002000"
	},
	{
		"shortname": "三生里居委会",
		"id": "310106016001016001",
		"parentid": "310106002000"
	},
	{
		"shortname": "永顺居委会",
		"id": "310106016001017001",
		"parentid": "310106002000"
	},
	{
		"shortname": "南星路居委会",
		"id": "310106016001018001",
		"parentid": "310106002000"
	},
	{
		"shortname": "海昌居委会",
		"id": "310106016001019001",
		"parentid": "310106002000"
	}, {
		"shortname": "通源居委会",
		"id": "310106017001001001",
		"parentid": "310106007000"
	},
	{
		"shortname": "宝山路四九九弄居委会",
		"id": "310106017001002001",
		"parentid": "310106007000"
	},
	{
		"shortname": "三宝居委会",
		"id": "310106017001003001",
		"parentid": "310106007000"
	},
	{
		"shortname": "儒林里居委会",
		"id": "310106017001004001",
		"parentid": "310106007000"
	},
	{
		"shortname": "新宝通居委会",
		"id": "310106017001005001",
		"parentid": "310106007000"
	},
	{
		"shortname": "陆丰居委会",
		"id": "310106017001006001",
		"parentid": "310106007000"
	},
	{
		"shortname": "象山里居委会",
		"id": "310106017001007001",
		"parentid": "310106007000"
	},
	{
		"shortname": "会铁居委会",
		"id": "310106017001008001",
		"parentid": "310106007000"
	},
	{
		"shortname": "王家宅居委会",
		"id": "310106017001009001",
		"parentid": "310106007000"
	},
	{
		"shortname": "芷江中路二九四弄居委会",
		"id": "310106017001010001",
		"parentid": "310106007000"
	},
	{
		"shortname": "宝昌路六百弄居委会",
		"id": "310106017001011001",
		"parentid": "310106007000"
	},
	{
		"shortname": "通阁新村居委会",
		"id": "310106017001012001",
		"parentid": "310106007000"
	},
	{
		"shortname": "新华德居委会",
		"id": "310106017001013001",
		"parentid": "310106007000"
	},
	{
		"shortname": "邮电新村居委会",
		"id": "310106017001014001",
		"parentid": "310106007000"
	},
	{
		"shortname": "存仁居委会",
		"id": "310106017001015001",
		"parentid": "310106007000"
	},
	{
		"shortname": "宝华里居委会",
		"id": "310106017001016001",
		"parentid": "310106007000"
	},
	{
		"shortname": "新汉兴居委会",
		"id": "310106017001017001",
		"parentid": "310106007000"
	},
	{
		"shortname": "止园新村居委会",
		"id": "310106017001018001",
		"parentid": "310106007000"
	},
	{
		"shortname": "青云路四三五弄居委会",
		"id": "310106017001019001",
		"parentid": "310106007000"
	}, {
		"shortname": "柳营新村第一居委会",
		"id": "310106018001001001",
		"parentid": "310106008000"
	},
	{
		"shortname": "柳营新村第二居委会",
		"id": "310106018001002001",
		"parentid": "310106008000"
	},
	{
		"shortname": "洛平居委会",
		"id": "310106018001003001",
		"parentid": "310106008000"
	},
	{
		"shortname": "谈家桥居委会",
		"id": "310106018001004001",
		"parentid": "310106008000"
	},
	{
		"shortname": "沪北新村居委会",
		"id": "310106018001005001",
		"parentid": "310106008000"
	},
	{
		"shortname": "谈家宅居委会",
		"id": "310106018001006001",
		"parentid": "310106008000"
	},
	{
		"shortname": "谈家桥八十弄居委会",
		"id": "310106018001007001",
		"parentid": "310106008000"
	},
	{
		"shortname": "中山北路八零五弄居委会",
		"id": "310106018001008001",
		"parentid": "310106008000"
	},
	{
		"shortname": "柳营桥居委会",
		"id": "310106018001009001",
		"parentid": "310106008000"
	},
	{
		"shortname": "唐家沙居委会",
		"id": "310106018001010001",
		"parentid": "310106008000"
	},
	{
		"shortname": "洛川居委会",
		"id": "310106018001011001",
		"parentid": "310106008000"
	},
	{
		"shortname": "延新居委会",
		"id": "310106018001012001",
		"parentid": "310106008000"
	},
	{
		"shortname": "三阳居委会",
		"id": "310106018001013001",
		"parentid": "310106008000"
	},
	{
		"shortname": "洛川中路一千一百弄居委会",
		"id": "310106018001014001",
		"parentid": "310106008000"
	},
	{
		"shortname": "锦佳苑居委会",
		"id": "310106018001015001",
		"parentid": "310106008000"
	},
	{
		"shortname": "申地居委会",
		"id": "310106018001016001",
		"parentid": "310106008000"
	},
	{
		"shortname": "永乐居委会",
		"id": "310106018001017001",
		"parentid": "310106008000"
	},
	{
		"shortname": "和乐居委会",
		"id": "310106018001018001",
		"parentid": "310106008000"
	},
	{
		"shortname": "锦灏居委会",
		"id": "310106018001019001",
		"parentid": "310106008000"
	},
	{
		"shortname": "新理想居委会",
		"id": "310106018001020001",
		"parentid": "310106008000"
	},
	{
		"shortname": "嘉利居委会",
		"id": "310106018001021001",
		"parentid": "310106008000"
	},
	{
		"shortname": "洛善居委会",
		"id": "310106018001022001",
		"parentid": "310106008000"
	},
	{
		"shortname": "家豪城居委会",
		"id": "310106018001023001",
		"parentid": "310106008000"
	},
	{
		"shortname": "中山北路899弄居委会",
		"id": "310106018001024001",
		"parentid": "310106008000"
	},
	{
		"shortname": "延长中路727弄居委会",
		"id": "310106018001025001",
		"parentid": "310106008000"
	}, {
		"shortname": "延长新村居委会",
		"id": "310106019001001001",
		"parentid": "310106009000"
	},
	{
		"shortname": "延铁新村居委会",
		"id": "310106019001002001",
		"parentid": "310106009000"
	},
	{
		"shortname": "大宁一村居委会",
		"id": "310106019001003001",
		"parentid": "310106009000"
	},
	{
		"shortname": "大宁二村居委会",
		"id": "310106019001004001",
		"parentid": "310106009000"
	},
	{
		"shortname": "上工新村居委会",
		"id": "310106019001005001",
		"parentid": "310106009000"
	},
	{
		"shortname": "广延路居委会",
		"id": "310106019001006001",
		"parentid": "310106009000"
	},
	{
		"shortname": "延长中路四五一弄居委会",
		"id": "310106019001007001",
		"parentid": "310106009000"
	},
	{
		"shortname": "八方花苑居委会",
		"id": "310106019001008001",
		"parentid": "310106009000"
	},
	{
		"shortname": "平型关路八零一弄居委会",
		"id": "310106019001009001",
		"parentid": "310106009000"
	},
	{
		"shortname": "大宁路五四零弄居委会",
		"id": "310106019001010001",
		"parentid": "310106009000"
	},
	{
		"shortname": "延峰居委会",
		"id": "310106019001011001",
		"parentid": "310106009000"
	},
	{
		"shortname": "粤秀路居委会",
		"id": "310106019001012001",
		"parentid": "310106009000"
	},
	{
		"shortname": "大宁路五零五弄居委会",
		"id": "310106019001013001",
		"parentid": "310106009000"
	},
	{
		"shortname": "新梅共和城居委会",
		"id": "310106019001014001",
		"parentid": "310106009000"
	},
	{
		"shortname": "大宁路六六七弄居委会",
		"id": "310106019001015001",
		"parentid": "310106009000"
	},
	{
		"shortname": "慧芝湖花园居委会",
		"id": "310106019001016001",
		"parentid": "310106009000"
	},
	{
		"shortname": "宝华现代城居委会",
		"id": "310106019001017001",
		"parentid": "310106009000"
	},
	{
		"shortname": "共和新路二九九九弄居委会",
		"id": "310106019001018001",
		"parentid": "310106009000"
	},
	{
		"shortname": "平型关路2199弄居委会",
		"id": "310106019001019001",
		"parentid": "310106009000"
	},
	{
		"shortname": "广延路一一八八弄居委会",
		"id": "310106019001020001",
		"parentid": "310106009000"
	},
	{
		"shortname": "虹屿居委会",
		"id": "310106019001021001",
		"parentid": "310106009000"
	},
	{
		"shortname": "金茂雅苑居委会",
		"id": "310106019001022001",
		"parentid": "310106009000"
	}, {
		"shortname": "彭浦新村第一居委会",
		"id": "310106020001001001",
		"parentid": "310106010000"
	},
	{
		"shortname": "彭浦新村第三居委会",
		"id": "310106020001002001",
		"parentid": "310106010000"
	},
	{
		"shortname": "彭浦新村第五居委会",
		"id": "310106020001003001",
		"parentid": "310106010000"
	},
	{
		"shortname": "彭浦新村第七居委会",
		"id": "310106020001004001",
		"parentid": "310106010000"
	},
	{
		"shortname": "平顺路一八零弄居委会",
		"id": "310106020001005001",
		"parentid": "310106010000"
	},
	{
		"shortname": "岭南路五三九弄居委会",
		"id": "310106020001006001",
		"parentid": "310106010000"
	},
	{
		"shortname": "彭新居委会",
		"id": "310106020001007001",
		"parentid": "310106010000"
	},
	{
		"shortname": "临汾路一二四四弄居委会",
		"id": "310106020001008001",
		"parentid": "310106010000"
	},
	{
		"shortname": "闻喜路一一一零弄居委会",
		"id": "310106020001009001",
		"parentid": "310106010000"
	},
	{
		"shortname": "临汾路一五六四弄居委会",
		"id": "310106020001010001",
		"parentid": "310106010000"
	},
	{
		"shortname": "场中路二四七一弄居委会",
		"id": "310106020001011001",
		"parentid": "310106010000"
	},
	{
		"shortname": "共和新路四五五五弄居委会",
		"id": "310106020001012001",
		"parentid": "310106010000"
	},
	{
		"shortname": "平顺路七九零弄居委会",
		"id": "310106020001013001",
		"parentid": "310106010000"
	},
	{
		"shortname": "临汾路八九四弄居委会",
		"id": "310106020001014001",
		"parentid": "310106010000"
	},
	{
		"shortname": "场中路二四零一弄居委会",
		"id": "310106020001015001",
		"parentid": "310106010000"
	},
	{
		"shortname": "闻喜路九三五弄居委会",
		"id": "310106020001016001",
		"parentid": "310106010000"
	},
	{
		"shortname": "三泉路四二四弄居委会",
		"id": "310106020001017001",
		"parentid": "310106010000"
	},
	{
		"shortname": "保平居委会",
		"id": "310106020001018001",
		"parentid": "310106010000"
	},
	{
		"shortname": "三泉路七七零弄居委会",
		"id": "310106020001019001",
		"parentid": "310106010000"
	},
	{
		"shortname": "三泉路五一七弄居委会",
		"id": "310106020001020001",
		"parentid": "310106010000"
	},
	{
		"shortname": "三泉路八二一弄居委会",
		"id": "310106020001021001",
		"parentid": "310106010000"
	},
	{
		"shortname": "三泉路六零一弄居委会",
		"id": "310106020001022001",
		"parentid": "310106010000"
	},
	{
		"shortname": "三泉路一零一五弄居委会",
		"id": "310106020001023001",
		"parentid": "310106010000"
	},
	{
		"shortname": "临汾路一五一五弄居委会",
		"id": "310106020001024001",
		"parentid": "310106010000"
	},
	{
		"shortname": "共康三村居委会",
		"id": "310106020001025001",
		"parentid": "310106010000"
	},
	{
		"shortname": "共康四村第一居委会",
		"id": "310106020001026001",
		"parentid": "310106010000"
	},
	{
		"shortname": "共康四村第二居委会",
		"id": "310106020001027001",
		"parentid": "310106010000"
	},
	{
		"shortname": "保德路一三一六弄居委会",
		"id": "310106020001028001",
		"parentid": "310106010000"
	},
	{
		"shortname": "曲沃路四三零弄居委会",
		"id": "310106020001029001",
		"parentid": "310106010000"
	},
	{
		"shortname": "保德路九二一弄居委会",
		"id": "310106020001030001",
		"parentid": "310106010000"
	},
	{
		"shortname": "场中路二六零一弄居委会",
		"id": "310106020001031001",
		"parentid": "310106010000"
	},
	{
		"shortname": "艺康苑居委会",
		"id": "310106020001032001",
		"parentid": "310106010000"
	},
	{
		"shortname": "三泉家园居委会",
		"id": "310106020001033001",
		"parentid": "310106010000"
	}, {
		"shortname": "岭南路一百弄居委会",
		"id": "310106021001001001",
		"parentid": "310106015000"
	},
	{
		"shortname": "临汾路二九九弄居委会",
		"id": "310106021001002001",
		"parentid": "310106015000"
	},
	{
		"shortname": "岭南路二七零弄居委会",
		"id": "310106021001003001",
		"parentid": "310106015000"
	},
	{
		"shortname": "临汾路三七五弄居委会",
		"id": "310106021001004001",
		"parentid": "310106015000"
	},
	{
		"shortname": "临汾路三八零弄居委会",
		"id": "310106021001005001",
		"parentid": "310106015000"
	},
	{
		"shortname": "保德路四二五弄居委会",
		"id": "310106021001006001",
		"parentid": "310106015000"
	},
	{
		"shortname": "闻喜路二五一弄居委会",
		"id": "310106021001007001",
		"parentid": "310106015000"
	},
	{
		"shortname": "汾西路二六一弄居委会",
		"id": "310106021001008001",
		"parentid": "310106015000"
	},
	{
		"shortname": "阳曲路四七零弄居委会",
		"id": "310106021001009001",
		"parentid": "310106015000"
	},
	{
		"shortname": "阳曲路五七零弄居委会",
		"id": "310106021001010001",
		"parentid": "310106015000"
	},
	{
		"shortname": "岭南路七百弄居委会",
		"id": "310106021001011001",
		"parentid": "310106015000"
	},
	{
		"shortname": "汾西路二六零弄居委会",
		"id": "310106021001012001",
		"parentid": "310106015000"
	},
	{
		"shortname": "阳曲路七六零弄居委会",
		"id": "310106021001013001",
		"parentid": "310106015000"
	},
	{
		"shortname": "场中路一零一一弄居委会",
		"id": "310106021001014001",
		"parentid": "310106015000"
	},
	{
		"shortname": "景凤路520弄居委会",
		"id": "310106021001015001",
		"parentid": "310106015000"
	},
	{
		"shortname": "汾西路八十七弄居委会",
		"id": "310106021001016001",
		"parentid": "310106015000"
	},
	{
		"shortname": "闻喜路五五五弄居委会",
		"id": "310106021001017001",
		"parentid": "310106015000"
	},
	{
		"shortname": "临汾路九十九弄居委会",
		"id": "310106021001018001",
		"parentid": "310106015000"
	},
	{
		"shortname": "和源名城第一居委会",
		"id": "310106021001019001",
		"parentid": "310106015000"
	},
	{
		"shortname": "汾西路88弄居委会",
		"id": "310106021001020001",
		"parentid": "310106015000"
	}, {
		"shortname": "大统居委会",
		"id": "310106022001001001",
		"parentid": "310106016000"
	},
	{
		"shortname": "共和新路居委会",
		"id": "310106022001002001",
		"parentid": "310106016000"
	},
	{
		"shortname": "南山居委会",
		"id": "310106022001003001",
		"parentid": "310106016000"
	},
	{
		"shortname": "洪南山宅居委会",
		"id": "310106022001004001",
		"parentid": "310106016000"
	},
	{
		"shortname": "新赵家宅居委会",
		"id": "310106022001005001",
		"parentid": "310106016000"
	},
	{
		"shortname": "芷江西路一二三弄居委会",
		"id": "310106022001006001",
		"parentid": "310106016000"
	},
	{
		"shortname": "芷江新村居委会",
		"id": "310106022001007001",
		"parentid": "310106016000"
	},
	{
		"shortname": "永太居委会",
		"id": "310106022001008001",
		"parentid": "310106016000"
	},
	{
		"shortname": "苏家巷居委会",
		"id": "310106022001009001",
		"parentid": "310106016000"
	},
	{
		"shortname": "交通公园居委会",
		"id": "310106022001010001",
		"parentid": "310106016000"
	},
	{
		"shortname": "复元坊居委会",
		"id": "310106022001011001",
		"parentid": "310106016000"
	},
	{
		"shortname": "中兴路一二三三弄居委会",
		"id": "310106022001012001",
		"parentid": "310106016000"
	},
	{
		"shortname": "光华坊居委会",
		"id": "310106022001013001",
		"parentid": "310106016000"
	},
	{
		"shortname": "三兴大楼居委会",
		"id": "310106022001014001",
		"parentid": "310106016000"
	},
	{
		"shortname": "灵光居委会",
		"id": "310106022001015001",
		"parentid": "310106016000"
	},
	{
		"shortname": "城上城居委会",
		"id": "310106022001016001",
		"parentid": "310106016000"
	},
	{
		"shortname": "普善居委会",
		"id": "310106022001017001",
		"parentid": "310106016000"
	},
	{
		"shortname": "协和居委会",
		"id": "310106022001018001",
		"parentid": "310106016000"
	},
	{
		"shortname": "海鹰居委会",
		"id": "310106101001001001",
		"parentid": "310106101000"
	},
	{
		"shortname": "翔前居委会",
		"id": "310106101001002001",
		"parentid": "310106101000"
	},
	{
		"shortname": "场中路八零一弄居委会",
		"id": "310106101001003001",
		"parentid": "310106101000"
	},
	{
		"shortname": "绿园居委会",
		"id": "310106101001004001",
		"parentid": "310106101000"
	},
	{
		"shortname": "永和北第一居委会",
		"id": "310106101001005001",
		"parentid": "310106101000"
	},
	{
		"shortname": "万荣东怡居委会",
		"id": "310106101001007001",
		"parentid": "310106101000"
	},
	{
		"shortname": "沪太路一零五一弄居委会",
		"id": "310106101001008001",
		"parentid": "310106101000"
	},
	{
		"shortname": "沪太路一一七零弄居委会",
		"id": "310106101001009001",
		"parentid": "310106101000"
	},
	{
		"shortname": "玉峰居委会",
		"id": "310106101001010001",
		"parentid": "310106101000"
	},
	{
		"shortname": "永和北第二居委会",
		"id": "310106101001011001",
		"parentid": "310106101000"
	},
	{
		"shortname": "洪泉居委会",
		"id": "310106101001012001",
		"parentid": "310106101000"
	},
	{
		"shortname": "万荣新苑居委会",
		"id": "310106101001013001",
		"parentid": "310106101000"
	},
	{
		"shortname": "沪太路一一八八弄居委会",
		"id": "310106101001014001",
		"parentid": "310106101000"
	},
	{
		"shortname": "共和新路三六五零弄居委会",
		"id": "310106101001015001",
		"parentid": "310106101000"
	},
	{
		"shortname": "万荣佳苑居委会",
		"id": "310106101001018001",
		"parentid": "310106101000"
	},
	{
		"shortname": "永和北第三居委会",
		"id": "310106101001019001",
		"parentid": "310106101000"
	},
	{
		"shortname": "场中路二千八百弄居委会",
		"id": "310106101001020001",
		"parentid": "310106101000"
	},
	{
		"shortname": "丽园居委会",
		"id": "310106101001021001",
		"parentid": "310106101000"
	},
	{
		"shortname": "阳城居委会",
		"id": "310106101001022001",
		"parentid": "310106101000"
	},
	{
		"shortname": "幸福一村居委会",
		"id": "310106101001023001",
		"parentid": "310106101000"
	},
	{
		"shortname": "幸福二村居委会",
		"id": "310106101001024001",
		"parentid": "310106101000"
	},
	{
		"shortname": "龙潭居委会",
		"id": "310106101001025001",
		"parentid": "310106101000"
	},
	{
		"shortname": "运城居委会",
		"id": "310106101001026001",
		"parentid": "310106101000"
	},
	{
		"shortname": "望景苑居委会",
		"id": "310106101001027001",
		"parentid": "310106101000"
	},
	{
		"shortname": "江场西路1366弄居委会",
		"id": "310106101001028001",
		"parentid": "310106101000"
	},
	{
		"shortname": "白玉兰馨园居委会",
		"id": "310106101001029001",
		"parentid": "310106101000"
	},
	{
		"shortname": "龙馨嘉园居委会",
		"id": "310106101001030001",
		"parentid": "310106101000"
	},
	{
		"shortname": "美景雅苑居委会",
		"id": "310106101001032001",
		"parentid": "310106101000"
	},
	{
		"shortname": "广盛苑居委会",
		"id": "310106101001033001",
		"parentid": "310106101000"
	},
	{
		"shortname": "成亿花园居委会",
		"id": "310106101001034001",
		"parentid": "310106101000"
	},
	{
		"shortname": "永和家园居委会",
		"id": "310106101001035001",
		"parentid": "310106101000"
	},
	{
		"shortname": "晋城居委会",
		"id": "310106101001036001",
		"parentid": "310106101000"
	},
	{
		"shortname": "阳城贵都居委会",
		"id": "310106101001037001",
		"parentid": "310106101000"
	},
	{
		"shortname": "塘南居委会",
		"id": "310106101001038001",
		"parentid": "310106101000"
	},
	{
		"shortname": "白遗桥居委会",
		"id": "310106101001039001",
		"parentid": "310106101000"
	},
	{
		"shortname": "沪太路935弄居委会",
		"id": "310106101001040001",
		"parentid": "310106101000"
	},
	{
		"shortname": "广中西路999弄居委会",
		"id": "310106101001041001",
		"parentid": "310106101000"
	},
	{
		"shortname": "龙胜雅苑居委会",
		"id": "310106101001042001",
		"parentid": "310106101000"
	},
	{
		"shortname": "彭浦村村委会",
		"id": "310106101001201001",
		"parentid": "310106101000"
	}, {
		"shortname": "源园居委会",
		"id": "310107005001001001",
		"parentid": "310107005000"
	},
	{
		"shortname": "花溪园居委会",
		"id": "310107005001003001",
		"parentid": "310107005000"
	},
	{
		"shortname": "金岭园居委会",
		"id": "310107005001004001",
		"parentid": "310107005000"
	},
	{
		"shortname": "杏梅园居委会",
		"id": "310107005001005001",
		"parentid": "310107005000"
	},
	{
		"shortname": "南岭园居委会",
		"id": "310107005001006001",
		"parentid": "310107005000"
	},
	{
		"shortname": "南杨园居委会",
		"id": "310107005001007001",
		"parentid": "310107005000"
	},
	{
		"shortname": "南梅园居委会",
		"id": "310107005001009001",
		"parentid": "310107005000"
	},
	{
		"shortname": "沙溪园居委会",
		"id": "310107005001011001",
		"parentid": "310107005000"
	},
	{
		"shortname": "南溪园居委会",
		"id": "310107005001012001",
		"parentid": "310107005000"
	},
	{
		"shortname": "枫杨园居委会",
		"id": "310107005001013001",
		"parentid": "310107005000"
	},
	{
		"shortname": "金杨园居委会",
		"id": "310107005001014001",
		"parentid": "310107005000"
	},
	{
		"shortname": "兰溪园居委会",
		"id": "310107005001016001",
		"parentid": "310107005000"
	},
	{
		"shortname": "金梅园居委会",
		"id": "310107005001017001",
		"parentid": "310107005000"
	},
	{
		"shortname": "杏杨园居委会",
		"id": "310107005001018001",
		"parentid": "310107005000"
	},
	{
		"shortname": "北梅园居委会",
		"id": "310107005001019001",
		"parentid": "310107005000"
	},
	{
		"shortname": "北岭园居委会",
		"id": "310107005001021001",
		"parentid": "310107005000"
	},
	{
		"shortname": "兰岭园居委会",
		"id": "310107005001022001",
		"parentid": "310107005000"
	},
	{
		"shortname": "桂杨园居委会",
		"id": "310107005001024001",
		"parentid": "310107005000"
	},
	{
		"shortname": "北杨园居委会",
		"id": "310107005001026001",
		"parentid": "310107005000"
	},
	{
		"shortname": "枫岭园居委会",
		"id": "310107005001027001",
		"parentid": "310107005000"
	}, {
		"shortname": "曹家巷居委会",
		"id": "310107014001001001",
		"parentid": "310107014000"
	},
	{
		"shortname": "中山桥居委会",
		"id": "310107014001002001",
		"parentid": "310107014000"
	},
	{
		"shortname": "师大一村居委会",
		"id": "310107014001003001",
		"parentid": "310107014000"
	},
	{
		"shortname": "新渡口居委会",
		"id": "310107014001004001",
		"parentid": "310107014000"
	},
	{
		"shortname": "长风一村居委会",
		"id": "310107014001005001",
		"parentid": "310107014000"
	},
	{
		"shortname": "长风二村第一居委会",
		"id": "310107014001006001",
		"parentid": "310107014000"
	},
	{
		"shortname": "长风三村居委会",
		"id": "310107014001007001",
		"parentid": "310107014000"
	},
	{
		"shortname": "长风四村第一居委会",
		"id": "310107014001008001",
		"parentid": "310107014000"
	},
	{
		"shortname": "大渡河路九十五弄居委会",
		"id": "310107014001009001",
		"parentid": "310107014000"
	},
	{
		"shortname": "长风四村第二居委会",
		"id": "310107014001010001",
		"parentid": "310107014000"
	},
	{
		"shortname": "长风二村第二居委会",
		"id": "310107014001011001",
		"parentid": "310107014000"
	},
	{
		"shortname": "锦绿新城居委会",
		"id": "310107014001012001",
		"parentid": "310107014000"
	},
	{
		"shortname": "曹家村居委会",
		"id": "310107014001014001",
		"parentid": "310107014000"
	},
	{
		"shortname": "白玉新村第一居委会",
		"id": "310107014001015001",
		"parentid": "310107014000"
	},
	{
		"shortname": "白玉新村第二居委会",
		"id": "310107014001016001",
		"parentid": "310107014000"
	},
	{
		"shortname": "普陀四村第一居委会",
		"id": "310107014001017001",
		"parentid": "310107014000"
	},
	{
		"shortname": "普陀四村第二居委会",
		"id": "310107014001018001",
		"parentid": "310107014000"
	},
	{
		"shortname": "普陀二村居委会",
		"id": "310107014001019001",
		"parentid": "310107014000"
	},
	{
		"shortname": "金沙新村居委会",
		"id": "310107014001020001",
		"parentid": "310107014000"
	},
	{
		"shortname": "隆德居委会",
		"id": "310107014001021001",
		"parentid": "310107014000"
	},
	{
		"shortname": "海鑫公寓居委会",
		"id": "310107014001023001",
		"parentid": "310107014000"
	},
	{
		"shortname": "师大三村居委会",
		"id": "310107014001024001",
		"parentid": "310107014000"
	},
	{
		"shortname": "师大二村社区居委会",
		"id": "310107014001025001",
		"parentid": "310107014000"
	},
	{
		"shortname": "中江居委会",
		"id": "310107014001026002",
		"parentid": "310107014000"
	},
	{
		"shortname": "清水湾居委会",
		"id": "310107014001027001",
		"parentid": "310107014000"
	},
	{
		"shortname": "世纪同乐居委会",
		"id": "310107014001028001",
		"parentid": "310107014000"
	}, {
		"shortname": "绿洲城市花园居委会",
		"id": "310107015001001001",
		"parentid": "310107015000"
	},
	{
		"shortname": "澳门路居委会",
		"id": "310107015001003001",
		"parentid": "310107015000"
	},
	{
		"shortname": "陕北居委会",
		"id": "310107015001004001",
		"parentid": "310107015000"
	},
	{
		"shortname": "正红里居委会",
		"id": "310107015001005001",
		"parentid": "310107015000"
	},
	{
		"shortname": "梅山苑居委会",
		"id": "310107015001008001",
		"parentid": "310107015000"
	},
	{
		"shortname": "长鸿居委会",
		"id": "310107015001009001",
		"parentid": "310107015000"
	},
	{
		"shortname": "长寿新村第三居委会",
		"id": "310107015001012001",
		"parentid": "310107015000"
	},
	{
		"shortname": "长寿新村第四居委会",
		"id": "310107015001013001",
		"parentid": "310107015000"
	},
	{
		"shortname": "九茂居委会",
		"id": "310107015001014001",
		"parentid": "310107015000"
	},
	{
		"shortname": "世纪之门居委会",
		"id": "310107015001015001",
		"parentid": "310107015000"
	},
	{
		"shortname": "合德里居委会",
		"id": "310107015001016001",
		"parentid": "310107015000"
	},
	{
		"shortname": "永定新村居委会",
		"id": "310107015001017001",
		"parentid": "310107015000"
	},
	{
		"shortname": "叶家宅居委会",
		"id": "310107015001018001",
		"parentid": "310107015000"
	},
	{
		"shortname": "锦绣里居委会",
		"id": "310107015001019001",
		"parentid": "310107015000"
	},
	{
		"shortname": "武宁新村第一居委会",
		"id": "310107015001023001",
		"parentid": "310107015000"
	},
	{
		"shortname": "武宁新村第二居委会",
		"id": "310107015001026001",
		"parentid": "310107015000"
	},
	{
		"shortname": "安全里居委会",
		"id": "310107015001027001",
		"parentid": "310107015000"
	},
	{
		"shortname": "普雄路居委会",
		"id": "310107015001028001",
		"parentid": "310107015000"
	},
	{
		"shortname": "谈家渡居委会",
		"id": "310107015001029001",
		"parentid": "310107015000"
	},
	{
		"shortname": "芙蓉花苑居委会",
		"id": "310107015001031001",
		"parentid": "310107015000"
	},
	{
		"shortname": "地方天园居委会",
		"id": "310107015001032002",
		"parentid": "310107015000"
	},
	{
		"shortname": "玉佛城居委会",
		"id": "310107015001033001",
		"parentid": "310107015000"
	},
	{
		"shortname": "知音苑居委会",
		"id": "310107015001034001",
		"parentid": "310107015000"
	},
	{
		"shortname": "武宁小城居委会",
		"id": "310107015001035001",
		"parentid": "310107015000"
	},
	{
		"shortname": "半岛花园居委会",
		"id": "310107015001036001",
		"parentid": "310107015000"
	},
	{
		"shortname": "秋水云庐居委会",
		"id": "310107015001037001",
		"parentid": "310107015000"
	},
	{
		"shortname": "河滨围城居委会",
		"id": "310107015001038001",
		"parentid": "310107015000"
	},
	{
		"shortname": "圣骊澳门苑居委会",
		"id": "310107015001039002",
		"parentid": "310107015000"
	},
	{
		"shortname": "苏堤春晓居委会",
		"id": "310107015001040002",
		"parentid": "310107015000"
	},
	{
		"shortname": "新湖明珠城居委会",
		"id": "310107015001041002",
		"parentid": "310107015000"
	},
	{
		"shortname": "逸流公寓居委会",
		"id": "310107015001042001",
		"parentid": "310107015000"
	},
	{
		"shortname": "大上海城市花园居委会",
		"id": "310107015001043001",
		"parentid": "310107015000"
	},
	{
		"shortname": "泰欣嘉园居委会",
		"id": "310107015001044001",
		"parentid": "310107015000"
	},
	{
		"shortname": "上青佳园居委会",
		"id": "310107015001045001",
		"parentid": "310107015000"
	},
	{
		"shortname": "梅芳里居委会",
		"id": "310107015001046001",
		"parentid": "310107015000"
	}, {
		"shortname": "延长居委会",
		"id": "310107016001001002",
		"parentid": "310107016000"
	},
	{
		"shortname": "合阳居委会",
		"id": "310107016001003001",
		"parentid": "310107016000"
	},
	{
		"shortname": "新宜居委会",
		"id": "310107016001004001",
		"parentid": "310107016000"
	},
	{
		"shortname": "新沪居委会",
		"id": "310107016001005001",
		"parentid": "310107016000"
	},
	{
		"shortname": "子长居委会",
		"id": "310107016001006002",
		"parentid": "310107016000"
	},
	{
		"shortname": "长新居委会",
		"id": "310107016001007001",
		"parentid": "310107016000"
	},
	{
		"shortname": "周家巷居委会",
		"id": "310107016001008001",
		"parentid": "310107016000"
	},
	{
		"shortname": "志丹居委会",
		"id": "310107016001009001",
		"parentid": "310107016000"
	},
	{
		"shortname": "名都花苑居委会",
		"id": "310107016001010001",
		"parentid": "310107016000"
	},
	{
		"shortname": "黄陵居委会",
		"id": "310107016001011001",
		"parentid": "310107016000"
	},
	{
		"shortname": "安塞居委会",
		"id": "310107016001012001",
		"parentid": "310107016000"
	},
	{
		"shortname": "汪家井居委会",
		"id": "310107016001013001",
		"parentid": "310107016000"
	},
	{
		"shortname": "章家巷居委会",
		"id": "310107016001014001",
		"parentid": "310107016000"
	},
	{
		"shortname": "新长居委会",
		"id": "310107016001016001",
		"parentid": "310107016000"
	},
	{
		"shortname": "南泉苑居委会",
		"id": "310107016001018001",
		"parentid": "310107016000"
	},
	{
		"shortname": "甘泉苑居委会",
		"id": "310107016001019001",
		"parentid": "310107016000"
	},
	{
		"shortname": "东泉苑居委会",
		"id": "310107016001020001",
		"parentid": "310107016000"
	},
	{
		"shortname": "悦达第一居委会",
		"id": "310107016001022001",
		"parentid": "310107016000"
	},
	{
		"shortname": "双山居委会",
		"id": "310107016001023001",
		"parentid": "310107016000"
	},
	{
		"shortname": "新灵居委会",
		"id": "310107016001024001",
		"parentid": "310107016000"
	}, {
		"shortname": "中山新村居委会",
		"id": "310107017001001001",
		"parentid": "310107017000"
	},
	{
		"shortname": "镇坪路居委会",
		"id": "310107017001002001",
		"parentid": "310107017000"
	},
	{
		"shortname": "太浜巷居委会",
		"id": "310107017001003001",
		"parentid": "310107017000"
	},
	{
		"shortname": "薛家厍居委会",
		"id": "310107017001004001",
		"parentid": "310107017000"
	},
	{
		"shortname": "信仪新村居委会",
		"id": "310107017001005001",
		"parentid": "310107017000"
	},
	{
		"shortname": "石泉新村第一居委会",
		"id": "310107017001006001",
		"parentid": "310107017000"
	},
	{
		"shortname": "石泉新村第二居委会",
		"id": "310107017001007001",
		"parentid": "310107017000"
	},
	{
		"shortname": "石泉六村居委会",
		"id": "310107017001009001",
		"parentid": "310107017000"
	},
	{
		"shortname": "铁路新村居委会",
		"id": "310107017001010001",
		"parentid": "310107017000"
	},
	{
		"shortname": "洵阳新村第一居委会",
		"id": "310107017001011001",
		"parentid": "310107017000"
	},
	{
		"shortname": "洵阳新村第二居委会",
		"id": "310107017001012001",
		"parentid": "310107017000"
	},
	{
		"shortname": "石岚三村居委会",
		"id": "310107017001013001",
		"parentid": "310107017000"
	},
	{
		"shortname": "管弄新村第一居委会",
		"id": "310107017001014001",
		"parentid": "310107017000"
	},
	{
		"shortname": "管弄新村第二居委会",
		"id": "310107017001015001",
		"parentid": "310107017000"
	},
	{
		"shortname": "管弄新村第三居委会",
		"id": "310107017001016001",
		"parentid": "310107017000"
	},
	{
		"shortname": "铜川路居委会",
		"id": "310107017001017001",
		"parentid": "310107017000"
	},
	{
		"shortname": "陆家宅第一居委会",
		"id": "310107017001018001",
		"parentid": "310107017000"
	},
	{
		"shortname": "陆家宅第二居委会",
		"id": "310107017001019001",
		"parentid": "310107017000"
	},
	{
		"shortname": "联合新村居委会",
		"id": "310107017001020001",
		"parentid": "310107017000"
	},
	{
		"shortname": "和平新村居委会",
		"id": "310107017001021001",
		"parentid": "310107017000"
	},
	{
		"shortname": "兰凤新村居委会",
		"id": "310107017001022001",
		"parentid": "310107017000"
	},
	{
		"shortname": "中宁路居委会",
		"id": "310107017001023001",
		"parentid": "310107017000"
	},
	{
		"shortname": "秋月枫舍居委会",
		"id": "310107017001024001",
		"parentid": "310107017000"
	},
	{
		"shortname": "品尊国际居委会",
		"id": "310107017001025001",
		"parentid": "310107017000"
	}, {
		"shortname": "宜川一村居委会",
		"id": "310107020001001001",
		"parentid": "310107020000"
	},
	{
		"shortname": "宜川二村居委会",
		"id": "310107020001002001",
		"parentid": "310107020000"
	},
	{
		"shortname": "宜川四村居委会",
		"id": "310107020001004001",
		"parentid": "310107020000"
	},
	{
		"shortname": "赵家花园居委会",
		"id": "310107020001005001",
		"parentid": "310107020000"
	},
	{
		"shortname": "华阴路居委会",
		"id": "310107020001006001",
		"parentid": "310107020000"
	},
	{
		"shortname": "泰山一村居委会",
		"id": "310107020001007001",
		"parentid": "310107020000"
	},
	{
		"shortname": "泰山二村居委会",
		"id": "310107020001008001",
		"parentid": "310107020000"
	},
	{
		"shortname": "泰山宅居委会",
		"id": "310107020001009001",
		"parentid": "310107020000"
	},
	{
		"shortname": "交通西路居委会",
		"id": "310107020001011001",
		"parentid": "310107020000"
	},
	{
		"shortname": "平江居委会",
		"id": "310107020001012001",
		"parentid": "310107020000"
	},
	{
		"shortname": "大洋新村居委会",
		"id": "310107020001013001",
		"parentid": "310107020000"
	},
	{
		"shortname": "光新村居委会",
		"id": "310107020001014001",
		"parentid": "310107020000"
	},
	{
		"shortname": "农林村居委会",
		"id": "310107020001016001",
		"parentid": "310107020000"
	},
	{
		"shortname": "香溢花城社区居委会",
		"id": "310107020001018002",
		"parentid": "310107020000"
	},
	{
		"shortname": "振华居委会",
		"id": "310107020001019001",
		"parentid": "310107020000"
	},
	{
		"shortname": "中远两湾城第一居委会",
		"id": "310107020001020001",
		"parentid": "310107020000"
	},
	{
		"shortname": "中远两湾城第二居委会",
		"id": "310107020001021001",
		"parentid": "310107020000"
	},
	{
		"shortname": "中远两湾城第三居委会",
		"id": "310107020001022001",
		"parentid": "310107020000"
	},
	{
		"shortname": "中远两湾城第四居委会",
		"id": "310107020001023001",
		"parentid": "310107020000"
	},
	{
		"shortname": "宜川六村第一居委会",
		"id": "310107020001024001",
		"parentid": "310107020000"
	},
	{
		"shortname": "宜川六村第二居委会",
		"id": "310107020001025001",
		"parentid": "310107020000"
	},
	{
		"shortname": "宜川三村第一居委会",
		"id": "310107020001026001",
		"parentid": "310107020000"
	},
	{
		"shortname": "宜川三村第二居委会",
		"id": "310107020001027001",
		"parentid": "310107020000"
	}, {
		"shortname": "交暨居委会",
		"id": "310107021001001001",
		"parentid": "310107104000"
	},
	{
		"shortname": "香泉路居委会",
		"id": "310107021001002001",
		"parentid": "310107104000"
	},
	{
		"shortname": "万里名轩社区居委会",
		"id": "310107021001003001",
		"parentid": "310107104000"
	},
	{
		"shortname": "中浩云居委会",
		"id": "310107021001006001",
		"parentid": "310107104000"
	},
	{
		"shortname": "愉景华庭社区居委会",
		"id": "310107021001007001",
		"parentid": "310107104000"
	},
	{
		"shortname": "中骏天誉社区居委会",
		"id": "310107021001010001",
		"parentid": "310107104000"
	},
	{
		"shortname": "颐华第一社区居委会",
		"id": "310107021001011001",
		"parentid": "310107104000"
	},
	{
		"shortname": "颐华第二社区居委会",
		"id": "310107021001012001",
		"parentid": "310107104000"
	},
	{
		"shortname": "万里雅筑社区居委会",
		"id": "310107021001013001",
		"parentid": "310107104000"
	},
	{
		"shortname": "富平社区居委会",
		"id": "310107021001014001",
		"parentid": "310107104000"
	},
	{
		"shortname": "凯旋华庭社区居委会",
		"id": "310107021001015001",
		"parentid": "310107104000"
	},
	{
		"shortname": "凯旋公寓社区居委会",
		"id": "310107021001016001",
		"parentid": "310107104000"
	},
	{
		"shortname": "中环家园社区居委会",
		"id": "310107021001017001",
		"parentid": "310107104000"
	},
	{
		"shortname": "中环锦园社区居委会",
		"id": "310107021001018001",
		"parentid": "310107104000"
	},
	{
		"shortname": "中环花苑社区居委会",
		"id": "310107021001019001",
		"parentid": "310107104000"
	}, {
		"shortname": "南大街居委会",
		"id": "310107022001001001",
		"parentid": "310107101000"
	},
	{
		"shortname": "北大街居委会",
		"id": "310107022001002001",
		"parentid": "310107101000"
	},
	{
		"shortname": "水塘街居委会",
		"id": "310107022001003001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真如西村居委会",
		"id": "310107022001004001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真北新村第一居委会",
		"id": "310107022001005001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真北新村第三居委会",
		"id": "310107022001006001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真西新村第一居委会",
		"id": "310107022001007001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真西新村第二居委会",
		"id": "310107022001008001",
		"parentid": "310107101000"
	},
	{
		"shortname": "车站新村居委会",
		"id": "310107022001009001",
		"parentid": "310107101000"
	},
	{
		"shortname": "杨家桥居委会",
		"id": "310107022001010001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真西新村第五居委会",
		"id": "310107022001011001",
		"parentid": "310107101000"
	},
	{
		"shortname": "海棠苑居委会",
		"id": "310107022001012001",
		"parentid": "310107101000"
	},
	{
		"shortname": "曹杨八村第一居委会",
		"id": "310107022001013001",
		"parentid": "310107101000"
	},
	{
		"shortname": "曹杨八村第二居委会",
		"id": "310107022001014001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第二居委会",
		"id": "310107022001015001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第四居委会",
		"id": "310107022001016001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第五居委会",
		"id": "310107022001017001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第六居委会",
		"id": "310107022001018001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第七居委会",
		"id": "310107022001019001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第八居委会",
		"id": "310107022001020001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第九居委会",
		"id": "310107022001021001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第十居委会",
		"id": "310107022001022001",
		"parentid": "310107101000"
	},
	{
		"shortname": "清涧新村第二居委会",
		"id": "310107022001023001",
		"parentid": "310107101000"
	},
	{
		"shortname": "清涧新村第六居委会",
		"id": "310107022001024001",
		"parentid": "310107101000"
	},
	{
		"shortname": "清涧新村第七居委会",
		"id": "310107022001025001",
		"parentid": "310107101000"
	},
	{
		"shortname": "清涧新村第八居委会",
		"id": "310107022001026001",
		"parentid": "310107101000"
	},
	{
		"shortname": "清涧新村第三居委会",
		"id": "310107022001027001",
		"parentid": "310107101000"
	},
	{
		"shortname": "曹杨花苑居委会",
		"id": "310107022001028001",
		"parentid": "310107101000"
	},
	{
		"shortname": "曹杨新苑居委会",
		"id": "310107022001029001",
		"parentid": "310107101000"
	},
	{
		"shortname": "金鼎花苑居委会",
		"id": "310107022001030001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第一居委会",
		"id": "310107022001031001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真北新村第五居委会",
		"id": "310107022001032001",
		"parentid": "310107101000"
	},
	{
		"shortname": "清涧新村第四居委会",
		"id": "310107022001033001",
		"parentid": "310107101000"
	},
	{
		"shortname": "真光新村第三居委会",
		"id": "310107022001034001",
		"parentid": "310107101000"
	},
	{
		"shortname": "中鼎豪园居委会",
		"id": "310107022001035001",
		"parentid": "310107101000"
	},
	{
		"shortname": "星河世纪城居委会",
		"id": "310107022001036001",
		"parentid": "310107101000"
	},
	{
		"shortname": "北巷居委会",
		"id": "310107102001001001",
		"parentid": "310107102000"
	},
	{
		"shortname": "芝巷居委会",
		"id": "310107102001002001",
		"parentid": "310107102000"
	},
	{
		"shortname": "新长征花苑第一居委会",
		"id": "310107102001004001",
		"parentid": "310107102000"
	},
	{
		"shortname": "梅岭北路居委会",
		"id": "310107102001006001",
		"parentid": "310107102000"
	},
	{
		"shortname": "怒江第二居委会",
		"id": "310107102001007001",
		"parentid": "310107102000"
	},
	{
		"shortname": "梅川第一居委会",
		"id": "310107102001008001",
		"parentid": "310107102000"
	},
	{
		"shortname": "梅川第二居委会",
		"id": "310107102001009001",
		"parentid": "310107102000"
	},
	{
		"shortname": "梅川第四居委会",
		"id": "310107102001010001",
		"parentid": "310107102000"
	},
	{
		"shortname": "梅川第六居委会",
		"id": "310107102001012001",
		"parentid": "310107102000"
	},
	{
		"shortname": "怒江第一居委会",
		"id": "310107102001013001",
		"parentid": "310107102000"
	},
	{
		"shortname": "运旺新村居委会",
		"id": "310107102001014001",
		"parentid": "310107102000"
	},
	{
		"shortname": "泾泰居委会",
		"id": "310107102001015001",
		"parentid": "310107102000"
	},
	{
		"shortname": "建德花园居委会",
		"id": "310107102001016001",
		"parentid": "310107102000"
	},
	{
		"shortname": "真源小区居委会",
		"id": "310107102001017001",
		"parentid": "310107102000"
	},
	{
		"shortname": "银开居委会",
		"id": "310107102001019001",
		"parentid": "310107102000"
	},
	{
		"shortname": "东旺居委会",
		"id": "310107102001022001",
		"parentid": "310107102000"
	},
	{
		"shortname": "祥和居委会",
		"id": "310107102001023001",
		"parentid": "310107102000"
	},
	{
		"shortname": "新曹杨居委会",
		"id": "310107102001024001",
		"parentid": "310107102000"
	},
	{
		"shortname": "金沙雅苑居委会",
		"id": "310107102001025001",
		"parentid": "310107102000"
	},
	{
		"shortname": "万豪居委会",
		"id": "310107102001027001",
		"parentid": "310107102000"
	},
	{
		"shortname": "建德小区第二居委会",
		"id": "310107102001028001",
		"parentid": "310107102000"
	},
	{
		"shortname": "未来街区居委会",
		"id": "310107102001029001",
		"parentid": "310107102000"
	},
	{
		"shortname": "祥和名邸居委会",
		"id": "310107102001033001",
		"parentid": "310107102000"
	},
	{
		"shortname": "象源丽都居委会",
		"id": "310107102001034001",
		"parentid": "310107102000"
	},
	{
		"shortname": "嘉广居委会",
		"id": "310107102001035001",
		"parentid": "310107102000"
	}, {
		"shortname": "同济大学沪西校区居委会",
		"id": "310107103001001002",
		"parentid": "310107103000"
	},
	{
		"shortname": "莲花公寓居委会",
		"id": "310107103001002001",
		"parentid": "310107103000"
	},
	{
		"shortname": "昆仑花苑居委会",
		"id": "310107103001003001",
		"parentid": "310107103000"
	},
	{
		"shortname": "李子园六村居委会",
		"id": "310107103001004001",
		"parentid": "310107103000"
	},
	{
		"shortname": "瑞香苑居委会",
		"id": "310107103001005001",
		"parentid": "310107103000"
	},
	{
		"shortname": "合欢苑居委会",
		"id": "310107103001006001",
		"parentid": "310107103000"
	},
	{
		"shortname": "绿春苑居委会",
		"id": "310107103001007001",
		"parentid": "310107103000"
	},
	{
		"shortname": "雪松苑第一居委会",
		"id": "310107103001008001",
		"parentid": "310107103000"
	},
	{
		"shortname": "海棠苑居委会",
		"id": "310107103001009001",
		"parentid": "310107103000"
	},
	{
		"shortname": "和乐苑居委会",
		"id": "310107103001010001",
		"parentid": "310107103000"
	},
	{
		"shortname": "石榴苑居委会",
		"id": "310107103001011001",
		"parentid": "310107103000"
	},
	{
		"shortname": "白丽苑居委会",
		"id": "310107103001012001",
		"parentid": "310107103000"
	},
	{
		"shortname": "紫荆苑居委会",
		"id": "310107103001013001",
		"parentid": "310107103000"
	},
	{
		"shortname": "杜鹃苑居委会",
		"id": "310107103001014001",
		"parentid": "310107103000"
	},
	{
		"shortname": "山茶苑居委会",
		"id": "310107103001015001",
		"parentid": "310107103000"
	},
	{
		"shortname": "迎春苑居委会",
		"id": "310107103001016001",
		"parentid": "310107103000"
	},
	{
		"shortname": "樱花苑居委会",
		"id": "310107103001017001",
		"parentid": "310107103000"
	},
	{
		"shortname": "雪松苑第二居委会",
		"id": "310107103001018001",
		"parentid": "310107103000"
	},
	{
		"shortname": "雪松苑第三居委会",
		"id": "310107103001019001",
		"parentid": "310107103000"
	},
	{
		"shortname": "紫藤苑居委会",
		"id": "310107103001020002",
		"parentid": "310107103000"
	},
	{
		"shortname": "香樟苑居委会",
		"id": "310107103001022001",
		"parentid": "310107103000"
	},
	{
		"shortname": "南李苑居委会",
		"id": "310107103001023001",
		"parentid": "310107103000"
	},
	{
		"shortname": "新家园居委会",
		"id": "310107103001024002",
		"parentid": "310107103000"
	},
	{
		"shortname": "永汇新苑居委会",
		"id": "310107103001025001",
		"parentid": "310107103000"
	},
	{
		"shortname": "古浪苑居委会",
		"id": "310107103001026001",
		"parentid": "310107103000"
	},
	{
		"shortname": "真建花苑居委会（筹）",
		"id": "310107103001027001",
		"parentid": "310107103000"
	},
	{
		"shortname": "阳光建华城第一居委会",
		"id": "310107103001028001",
		"parentid": "310107103000"
	},
	{
		"shortname": "阳光建华城第二居委会",
		"id": "310107103001029001",
		"parentid": "310107103000"
	},
	{
		"shortname": "阳光建华城第三居委会",
		"id": "310107103001030001",
		"parentid": "310107103000"
	},
	{
		"shortname": "阳光建华城第四居委会",
		"id": "310107103001031001",
		"parentid": "310107103000"
	},
	{
		"shortname": "安祁古浪新苑居委会",
		"id": "310107103001032001",
		"parentid": "310107103000"
	},
	{
		"shortname": "金祁新城居委会",
		"id": "310107103001033001",
		"parentid": "310107103000"
	},
	{
		"shortname": "祥和星宇居委会",
		"id": "310107103001034001",
		"parentid": "310107103000"
	},
	{
		"shortname": "金光村村委会",
		"id": "310107103001201001",
		"parentid": "310107103000"
	},
	{
		"shortname": "祁连村村委会",
		"id": "310107103001202001",
		"parentid": "310107103000"
	},
	{
		"shortname": "春光村村委会",
		"id": "310107103001203001",
		"parentid": "310107103000"
	},
	{
		"shortname": "李子园村村委会",
		"id": "310107103001204001",
		"parentid": "310107103000"
	},
	{
		"shortname": "新杨村村委会",
		"id": "310107103001206001",
		"parentid": "310107103000"
	},
	{
		"shortname": "桃浦村村委会",
		"id": "310107103001207001",
		"parentid": "310107103000"
	},
	{
		"shortname": "槎浦村村委会",
		"id": "310107103001208001",
		"parentid": "310107103000"
	}, {
		"shortname": "欧二居委会",
		"id": "310109009001002001",
		"parentid": "310109009000"
	},
	{
		"shortname": "欧三居委会",
		"id": "310109009001003001",
		"parentid": "310109009000"
	},
	{
		"shortname": "欧四居委会",
		"id": "310109009001004001",
		"parentid": "310109009000"
	},
	{
		"shortname": "欧五居委会",
		"id": "310109009001005001",
		"parentid": "310109009000"
	},
	{
		"shortname": "建设新村居委会",
		"id": "310109009001007001",
		"parentid": "310109009000"
	},
	{
		"shortname": "祥德路居委会",
		"id": "310109009001008001",
		"parentid": "310109009000"
	},
	{
		"shortname": "董家宅居委会",
		"id": "310109009001010001",
		"parentid": "310109009000"
	},
	{
		"shortname": "幸福村居委会",
		"id": "310109009001012001",
		"parentid": "310109009000"
	},
	{
		"shortname": "邮电新村居委会",
		"id": "310109009001013001",
		"parentid": "310109009000"
	},
	{
		"shortname": "大连新村第二居委会",
		"id": "310109009001015001",
		"parentid": "310109009000"
	},
	{
		"shortname": "大连新村第三居委会",
		"id": "310109009001016001",
		"parentid": "310109009000"
	},
	{
		"shortname": "大连西居委会",
		"id": "310109009001017001",
		"parentid": "310109009000"
	},
	{
		"shortname": "祥德东居委会",
		"id": "310109009001018001",
		"parentid": "310109009000"
	},
	{
		"shortname": "蒋家桥居委会",
		"id": "310109009001019001",
		"parentid": "310109009000"
	},
	{
		"shortname": "北郊居委会",
		"id": "310109009001020001",
		"parentid": "310109009000"
	},
	{
		"shortname": "虹仪居委会",
		"id": "310109009001021001",
		"parentid": "310109009000"
	},
	{
		"shortname": "紫荆居委会",
		"id": "310109009001023001",
		"parentid": "310109009000"
	},
	{
		"shortname": "模范新村居委会",
		"id": "310109009001024001",
		"parentid": "310109009000"
	}, {
		"shortname": "玉一居委会",
		"id": "310109010001001001",
		"parentid": "310109010000"
	},
	{
		"shortname": "玉二居委会",
		"id": "310109010001002001",
		"parentid": "310109010000"
	},
	{
		"shortname": "玉三居委会",
		"id": "310109010001003001",
		"parentid": "310109010000"
	},
	{
		"shortname": "玉四居委会",
		"id": "310109010001004001",
		"parentid": "310109010000"
	},
	{
		"shortname": "曲一居委会",
		"id": "310109010001005001",
		"parentid": "310109010000"
	},
	{
		"shortname": "曲二居委会",
		"id": "310109010001006001",
		"parentid": "310109010000"
	},
	{
		"shortname": "东体居委会",
		"id": "310109010001010001",
		"parentid": "310109010000"
	},
	{
		"shortname": "东四居委会",
		"id": "310109010001011001",
		"parentid": "310109010000"
	},
	{
		"shortname": "东五居委会",
		"id": "310109010001012001",
		"parentid": "310109010000"
	},
	{
		"shortname": "密一居委会",
		"id": "310109010001013001",
		"parentid": "310109010000"
	},
	{
		"shortname": "密二居委会",
		"id": "310109010001014001",
		"parentid": "310109010000"
	},
	{
		"shortname": "密三居委会",
		"id": "310109010001015001",
		"parentid": "310109010000"
	},
	{
		"shortname": "赤一居委会",
		"id": "310109010001016001",
		"parentid": "310109010000"
	},
	{
		"shortname": "赤二居委会",
		"id": "310109010001017001",
		"parentid": "310109010000"
	},
	{
		"shortname": "赤三居委会",
		"id": "310109010001018001",
		"parentid": "310109010000"
	},
	{
		"shortname": "运一居委会",
		"id": "310109010001019001",
		"parentid": "310109010000"
	},
	{
		"shortname": "运二居委会",
		"id": "310109010001020001",
		"parentid": "310109010000"
	},
	{
		"shortname": "运三居委会",
		"id": "310109010001021001",
		"parentid": "310109010000"
	},
	{
		"shortname": "林云居委会",
		"id": "310109010001025001",
		"parentid": "310109010000"
	},
	{
		"shortname": "巴林居委会",
		"id": "310109010001026002",
		"parentid": "310109010000"
	},
	{
		"shortname": "上农一居委会",
		"id": "310109010001027001",
		"parentid": "310109010000"
	},
	{
		"shortname": "上农二居委会",
		"id": "310109010001028001",
		"parentid": "310109010000"
	},
	{
		"shortname": "鸿雁居委会",
		"id": "310109010001029001",
		"parentid": "310109010000"
	},
	{
		"shortname": "银联居委会",
		"id": "310109010001031001",
		"parentid": "310109010000"
	}, {
		"shortname": "西江湾路居委会",
		"id": "310109011001002001",
		"parentid": "310109011000"
	},
	{
		"shortname": "商业一村居委会",
		"id": "310109011001003001",
		"parentid": "310109011000"
	},
	{
		"shortname": "商洛小区居委会",
		"id": "310109011001004001",
		"parentid": "310109011000"
	},
	{
		"shortname": "广中新村居委会",
		"id": "310109011001006001",
		"parentid": "310109011000"
	},
	{
		"shortname": "广中新村第二居委会",
		"id": "310109011001008001",
		"parentid": "310109011000"
	},
	{
		"shortname": "广中新村第三居委会",
		"id": "310109011001009001",
		"parentid": "310109011000"
	},
	{
		"shortname": "友谊新村居委会",
		"id": "310109011001010001",
		"parentid": "310109011000"
	},
	{
		"shortname": "广灵新村居委会",
		"id": "310109011001012001",
		"parentid": "310109011000"
	},
	{
		"shortname": "新虹居委会",
		"id": "310109011001013001",
		"parentid": "310109011000"
	},
	{
		"shortname": "灵新居委会",
		"id": "310109011001017001",
		"parentid": "310109011000"
	},
	{
		"shortname": "金属新村居委会",
		"id": "310109011001019001",
		"parentid": "310109011000"
	},
	{
		"shortname": "同心路居委会",
		"id": "310109011001020001",
		"parentid": "310109011000"
	},
	{
		"shortname": "同济居委会",
		"id": "310109011001022001",
		"parentid": "310109011000"
	},
	{
		"shortname": "何家宅居委会",
		"id": "310109011001024001",
		"parentid": "310109011000"
	},
	{
		"shortname": "八字桥居委会",
		"id": "310109011001026001",
		"parentid": "310109011000"
	},
	{
		"shortname": "柳营路居委会",
		"id": "310109011001027001",
		"parentid": "310109011000"
	},
	{
		"shortname": "黄山路居委会",
		"id": "310109011001029001",
		"parentid": "310109011000"
	},
	{
		"shortname": "恒业路居委会",
		"id": "310109011001030001",
		"parentid": "310109011000"
	},
	{
		"shortname": "华昌路居委会",
		"id": "310109011001031001",
		"parentid": "310109011000"
	},
	{
		"shortname": "横浜路居委会",
		"id": "310109011001034001",
		"parentid": "310109011000"
	},
	{
		"shortname": "株洲路居委会",
		"id": "310109011001035001",
		"parentid": "310109011000"
	},
	{
		"shortname": "花园城居委会",
		"id": "310109011001036001",
		"parentid": "310109011000"
	},
	{
		"shortname": "垦业居委会",
		"id": "310109014001004001",
		"parentid": "310109014000"
	},
	{
		"shortname": "海伦居委会",
		"id": "310109014001005001",
		"parentid": "310109014000"
	},
	{
		"shortname": "庆源居委会",
		"id": "310109014001006001",
		"parentid": "310109014000"
	},
	{
		"shortname": "瑞康居委会",
		"id": "310109014001008001",
		"parentid": "310109014000"
	},
	{
		"shortname": "天水居委会",
		"id": "310109014001011002",
		"parentid": "310109014000"
	},
	{
		"shortname": "庆阳居委会",
		"id": "310109014001013001",
		"parentid": "310109014000"
	},
	{
		"shortname": "安丘居委会",
		"id": "310109014001016001",
		"parentid": "310109014000"
	},
	{
		"shortname": "宝元居委会",
		"id": "310109014001018001",
		"parentid": "310109014000"
	},
	{
		"shortname": "通州居委会",
		"id": "310109014001021001",
		"parentid": "310109014000"
	},
	{
		"shortname": "临平居委会",
		"id": "310109014001022001",
		"parentid": "310109014000"
	},
	{
		"shortname": "通海居委会",
		"id": "310109014001023001",
		"parentid": "310109014000"
	},
	{
		"shortname": "岳州居委会",
		"id": "310109014001025001",
		"parentid": "310109014000"
	},
	{
		"shortname": "新陆居委会",
		"id": "310109014001026001",
		"parentid": "310109014000"
	},
	{
		"shortname": "海鸥居委会",
		"id": "310109014001027001",
		"parentid": "310109014000"
	},
	{
		"shortname": "香港丽园居委会",
		"id": "310109014001028001",
		"parentid": "310109014000"
	},
	{
		"shortname": "瑞虹新城第一居委会",
		"id": "310109014001029001",
		"parentid": "310109014000"
	},
	{
		"shortname": "飘鹰居委会",
		"id": "310109014001030001",
		"parentid": "310109014000"
	},
	{
		"shortname": "虹叶居委会",
		"id": "310109014001031001",
		"parentid": "310109014000"
	},
	{
		"shortname": "自建居委会",
		"id": "310109014001032001",
		"parentid": "310109014000"
	},
	{
		"shortname": "大连居委会",
		"id": "310109014001033001",
		"parentid": "310109014000"
	},
	{
		"shortname": "新港居委会",
		"id": "310109014001039001",
		"parentid": "310109014000"
	},
	{
		"shortname": "和平居委会",
		"id": "310109014001040001",
		"parentid": "310109014000"
	},
	{
		"shortname": "提兰新村居委会",
		"id": "310109014001041001",
		"parentid": "310109014000"
	},
	{
		"shortname": "张桥居委会",
		"id": "310109014001042001",
		"parentid": "310109014000"
	},
	{
		"shortname": "榆兰居委会",
		"id": "310109014001043001",
		"parentid": "310109014000"
	},
	{
		"shortname": "天虹居委会",
		"id": "310109014001044001",
		"parentid": "310109014000"
	},
	{
		"shortname": "瑞鑫居委会",
		"id": "310109014001045001",
		"parentid": "310109014000"
	},
	{
		"shortname": "梧州居委会",
		"id": "310109014001046001",
		"parentid": "310109014000"
	}, {
		"shortname": "广水居委会",
		"id": "310109016001001001",
		"parentid": "310109016000"
	},
	{
		"shortname": "水电居委会",
		"id": "310109016001002001",
		"parentid": "310109016000"
	},
	{
		"shortname": "汶一居委会",
		"id": "310109016001003001",
		"parentid": "310109016000"
	},
	{
		"shortname": "汶二居委会",
		"id": "310109016001004001",
		"parentid": "310109016000"
	},
	{
		"shortname": "华苑第一居委会",
		"id": "310109016001005001",
		"parentid": "310109016000"
	},
	{
		"shortname": "华苑第二居委会",
		"id": "310109016001006001",
		"parentid": "310109016000"
	},
	{
		"shortname": "锦一居委会",
		"id": "310109016001007001",
		"parentid": "310109016000"
	},
	{
		"shortname": "锦二居委会",
		"id": "310109016001008001",
		"parentid": "310109016000"
	},
	{
		"shortname": "锦三居委会",
		"id": "310109016001009001",
		"parentid": "310109016000"
	},
	{
		"shortname": "复旦居委会",
		"id": "310109016001010001",
		"parentid": "310109016000"
	},
	{
		"shortname": "文苑第一居委会",
		"id": "310109016001011001",
		"parentid": "310109016000"
	},
	{
		"shortname": "文苑第二居委会",
		"id": "310109016001012001",
		"parentid": "310109016000"
	},
	{
		"shortname": "文苑第三居委会",
		"id": "310109016001013001",
		"parentid": "310109016000"
	},
	{
		"shortname": "秀苑居委会",
		"id": "310109016001014001",
		"parentid": "310109016000"
	},
	{
		"shortname": "凉城新村第一居委会",
		"id": "310109016001015001",
		"parentid": "310109016000"
	},
	{
		"shortname": "凉城新村第二居委会",
		"id": "310109016001016001",
		"parentid": "310109016000"
	},
	{
		"shortname": "凉城新村第三居委会",
		"id": "310109016001017001",
		"parentid": "310109016000"
	},
	{
		"shortname": "凉城新村第四居委会",
		"id": "310109016001018001",
		"parentid": "310109016000"
	},
	{
		"shortname": "凉城新村第五居委会",
		"id": "310109016001019001",
		"parentid": "310109016000"
	},
	{
		"shortname": "凉城新村第六居委会",
		"id": "310109016001020001",
		"parentid": "310109016000"
	},
	{
		"shortname": "广凉居委会",
		"id": "310109016001021001",
		"parentid": "310109016000"
	},
	{
		"shortname": "广粤居委会",
		"id": "310109016001022001",
		"parentid": "310109016000"
	},
	{
		"shortname": "梦湖苑居委会",
		"id": "310109016001025001",
		"parentid": "310109016000"
	},
	{
		"shortname": "馨苑居委会",
		"id": "310109016001026001",
		"parentid": "310109016000"
	},
	{
		"shortname": "广灵二路居委会",
		"id": "310109016001027001",
		"parentid": "310109016000"
	},
	{
		"shortname": "科佳居委会",
		"id": "310109016001029001",
		"parentid": "310109016000"
	},
	{
		"shortname": "中虹居委会",
		"id": "310109016001030001",
		"parentid": "310109016000"
	}, {
		"shortname": "山一居委会",
		"id": "310109017001001001",
		"parentid": "310109017000"
	},
	{
		"shortname": "山二居委会",
		"id": "310109017001002001",
		"parentid": "310109017000"
	},
	{
		"shortname": "山三居委会",
		"id": "310109017001003001",
		"parentid": "310109017000"
	},
	{
		"shortname": "黄渡路居委会",
		"id": "310109017001004001",
		"parentid": "310109017000"
	},
	{
		"shortname": "多伦路居委会",
		"id": "310109017001005001",
		"parentid": "310109017000"
	},
	{
		"shortname": "柳林里居委会",
		"id": "310109017001007001",
		"parentid": "310109017000"
	},
	{
		"shortname": "永美居委会",
		"id": "310109017001008001",
		"parentid": "310109017000"
	},
	{
		"shortname": "浙兴里居委会",
		"id": "310109017001010001",
		"parentid": "310109017000"
	},
	{
		"shortname": "余庆坊居委会",
		"id": "310109017001011001",
		"parentid": "310109017000"
	},
	{
		"shortname": "长春路居委会",
		"id": "310109017001012001",
		"parentid": "310109017000"
	},
	{
		"shortname": "邢长居委会",
		"id": "310109017001013001",
		"parentid": "310109017000"
	},
	{
		"shortname": "新乡居委会",
		"id": "310109017001015001",
		"parentid": "310109017000"
	},
	{
		"shortname": "永德居委会",
		"id": "310109017001016001",
		"parentid": "310109017000"
	},
	{
		"shortname": "正兴居委会",
		"id": "310109017001017001",
		"parentid": "310109017000"
	},
	{
		"shortname": "中州路居委会",
		"id": "310109017001020001",
		"parentid": "310109017000"
	},
	{
		"shortname": "南克俭居委会",
		"id": "310109017001022001",
		"parentid": "310109017000"
	},
	{
		"shortname": "四川里居委会",
		"id": "310109017001026001",
		"parentid": "310109017000"
	},
	{
		"shortname": "永丰居委会",
		"id": "310109017001028001",
		"parentid": "310109017000"
	},
	{
		"shortname": "宝安居委会",
		"id": "310109017001029001",
		"parentid": "310109017000"
	},
	{
		"shortname": "吉祥居委会",
		"id": "310109017001030001",
		"parentid": "310109017000"
	},
	{
		"shortname": "河南北居委会",
		"id": "310109017001033001",
		"parentid": "310109017000"
	},
	{
		"shortname": "江西北居委会",
		"id": "310109017001041001",
		"parentid": "310109017000"
	},
	{
		"shortname": "武进居委会",
		"id": "310109017001042001",
		"parentid": "310109017000"
	}, {
		"shortname": "长治居委会",
		"id": "310109018001001001",
		"parentid": "310109018001"
	},
	{
		"shortname": "百福居委会",
		"id": "310109018001004001",
		"parentid": "310109018001"
	},
	{
		"shortname": "汉阳居委会",
		"id": "310109018001005001",
		"parentid": "310109018001"
	},
	{
		"shortname": "高阳居委会",
		"id": "310109018001008001",
		"parentid": "310109018001"
	},
	{
		"shortname": "前进居委会",
		"id": "310109018001011001",
		"parentid": "310109018001"
	},
	{
		"shortname": "德裕居委会",
		"id": "310109018001013001",
		"parentid": "310109018001"
	},
	{
		"shortname": "西安居委会",
		"id": "310109018001014001",
		"parentid": "310109018001"
	},
	{
		"shortname": "东村居委会",
		"id": "310109018001016001",
		"parentid": "310109018001"
	},
	{
		"shortname": "惠民居委会",
		"id": "310109018001017001",
		"parentid": "310109018001"
	},
	{
		"shortname": "春江居委会",
		"id": "310109018001018001",
		"parentid": "310109018001"
	},
	{
		"shortname": "明华坊居委会",
		"id": "310109018001019001",
		"parentid": "310109018001"
	},
	{
		"shortname": "兰村居委会",
		"id": "310109018001020001",
		"parentid": "310109018001"
	},
	{
		"shortname": "晋阳居委会",
		"id": "310109018001021001",
		"parentid": "310109018001"
	},
	{
		"shortname": "西村居委会",
		"id": "310109018001022001",
		"parentid": "310109018001"
	},
	{
		"shortname": "舟山居委会",
		"id": "310109018001024001",
		"parentid": "310109018001"
	},
	{
		"shortname": "东大名居委会",
		"id": "310109018001025001",
		"parentid": "310109018001"
	},
	{
		"shortname": "北外滩居委会",
		"id": "310109018001030001",
		"parentid": "310109018001"
	},
	{
		"shortname": "大名路第二居委会",
		"id": "310109018001031001",
		"parentid": "310109018001"
	},
	{
		"shortname": "塘汉居委会",
		"id": "310109018001032001",
		"parentid": "310109018001"
	},
	{
		"shortname": "久耕居委会",
		"id": "310109018001033001",
		"parentid": "310109018001"
	},
	{
		"shortname": "兆庆居委会",
		"id": "310109018001034001",
		"parentid": "310109018001"
	},
	{
		"shortname": "三联居委会",
		"id": "310109018001035001",
		"parentid": "310109018001"
	},
	{
		"shortname": "景星居委会",
		"id": "310109018001036001",
		"parentid": "310109018001"
	},
	{
		"shortname": "蕃兴居委会",
		"id": "310109018001037001",
		"parentid": "310109018001"
	},
	{
		"shortname": "业广居委会",
		"id": "310109018001038001",
		"parentid": "310109018001"
	},
	{
		"shortname": "源福居委会",
		"id": "310109018001039001",
		"parentid": "310109018001"
	},
	{
		"shortname": "逢源居委会",
		"id": "310109018001040001",
		"parentid": "310109018001"
	},
	{
		"shortname": "禄寿居委会",
		"id": "310109018001041001",
		"parentid": "310109018001"
	},
	{
		"shortname": "华兴居委会",
		"id": "310109018001042001",
		"parentid": "310109018001"
	},
	{
		"shortname": "唐山居委会",
		"id": "310109018001043001",
		"parentid": "310109018001"
	},
	{
		"shortname": "鸿兴居委会",
		"id": "310109018001044001",
		"parentid": "310109018001"
	},
	{
		"shortname": "恒泰居委会",
		"id": "310109018001045001",
		"parentid": "310109018001"
	},
	{
		"shortname": "东泰华居委会",
		"id": "310109018001802001",
		"parentid": "310109018001"
	},
	{
		"shortname": "彭泽居委会",
		"id": "310109018001803001",
		"parentid": "310109018001"
	},
	{
		"shortname": "天武居委会",
		"id": "310109018001804001",
		"parentid": "310109018001"
	},
	{
		"shortname": "南天潼居委会",
		"id": "310109018001805001",
		"parentid": "310109018001"
	},
	{
		"shortname": "昆山居委会",
		"id": "310109018001806001",
		"parentid": "310109018001"
	},
	{
		"shortname": "海宁居委会",
		"id": "310109018001807001",
		"parentid": "310109018001"
	}, {
		"shortname": "奎照路居委会",
		"id": "310109019001001001",
		"parentid": "310109019000"
	},
	{
		"shortname": "新市南路居委会",
		"id": "310109019001002001",
		"parentid": "310109019000"
	},
	{
		"shortname": "纪念路居委会",
		"id": "310109019001003001",
		"parentid": "310109019000"
	},
	{
		"shortname": "文治路居委会",
		"id": "310109019001004001",
		"parentid": "310109019000"
	},
	{
		"shortname": "车站西路居委会",
		"id": "310109019001005001",
		"parentid": "310109019000"
	},
	{
		"shortname": "万安路西居委会",
		"id": "310109019001006001",
		"parentid": "310109019000"
	},
	{
		"shortname": "忠烈居委会",
		"id": "310109019001007001",
		"parentid": "310109019000"
	},
	{
		"shortname": "丰镇路居委会",
		"id": "310109019001008001",
		"parentid": "310109019000"
	},
	{
		"shortname": "沽源路居委会",
		"id": "310109019001009001",
		"parentid": "310109019000"
	},
	{
		"shortname": "新市北路居委会",
		"id": "310109019001010001",
		"parentid": "310109019000"
	},
	{
		"shortname": "逸仙路居委会",
		"id": "310109019001011001",
		"parentid": "310109019000"
	},
	{
		"shortname": "仁德路居委会",
		"id": "310109019001012001",
		"parentid": "310109019000"
	},
	{
		"shortname": "池沟路居委会",
		"id": "310109019001013001",
		"parentid": "310109019000"
	},
	{
		"shortname": "镇西居委会",
		"id": "310109019001014001",
		"parentid": "310109019000"
	},
	{
		"shortname": "镇北居委会",
		"id": "310109019001015001",
		"parentid": "310109019000"
	},
	{
		"shortname": "三门路居委会",
		"id": "310109019001016001",
		"parentid": "310109019000"
	},
	{
		"shortname": "车南居委会",
		"id": "310109019001017001",
		"parentid": "310109019000"
	},
	{
		"shortname": "春生居委会",
		"id": "310109019001018001",
		"parentid": "310109019000"
	},
	{
		"shortname": "丰镇路第二居委会",
		"id": "310109019001019001",
		"parentid": "310109019000"
	},
	{
		"shortname": "胜利居委会",
		"id": "310109019001020001",
		"parentid": "310109019000"
	},
	{
		"shortname": "韶嘉居委会",
		"id": "310109019001021001",
		"parentid": "310109019000"
	},
	{
		"shortname": "学府居委会",
		"id": "310109019001022001",
		"parentid": "310109019000"
	},
	{
		"shortname": "宝鸿居委会",
		"id": "310109019001023001",
		"parentid": "310109019000"
	},
	{
		"shortname": "三门路二居委会",
		"id": "310109019001024001",
		"parentid": "310109019000"
	},
	{
		"shortname": "方浜居委会",
		"id": "310109019001025001",
		"parentid": "310109019000"
	},
	{
		"shortname": "新南二居委会",
		"id": "310109019001026001",
		"parentid": "310109019000"
	},
	{
		"shortname": "场中居委会",
		"id": "310109019001027001",
		"parentid": "310109019000"
	},
	{
		"shortname": "韶嘉第二居委会",
		"id": "310109019001028001",
		"parentid": "310109019000"
	},
	{
		"shortname": "安汾路居委会",
		"id": "310109019001029001",
		"parentid": "310109019000"
	},
	{
		"shortname": "欣逸居委会",
		"id": "310109019001030001",
		"parentid": "310109019000"
	},
	{
		"shortname": "场中二居委会",
		"id": "310109019001031001",
		"parentid": "310109019000"
	},
	{
		"shortname": "虹湾居委会",
		"id": "310109019001032001",
		"parentid": "310109019000"
	},
	{
		"shortname": "虹纺居委会（筹）",
		"id": "310109019001033001",
		"parentid": "310109019000"
	}, {
		"shortname": "十七棉工房第二居委会",
		"id": "310110001001001001",
		"parentid": "310110001000"
	},
	{
		"shortname": "十九棉居委会会",
		"id": "310110001001003001",
		"parentid": "310110001000"
	},
	{
		"shortname": "公助一村居委会",
		"id": "310110001001005001",
		"parentid": "310110001000"
	},
	{
		"shortname": "中联村居委会",
		"id": "310110001001006001",
		"parentid": "310110001000"
	},
	{
		"shortname": "东白林寺居委会",
		"id": "310110001001008001",
		"parentid": "310110001000"
	},
	{
		"shortname": "白洋淀居委会",
		"id": "310110001001009001",
		"parentid": "310110001000"
	},
	{
		"shortname": "西白林寺居委会",
		"id": "310110001001010001",
		"parentid": "310110001000"
	},
	{
		"shortname": "军工路居委会",
		"id": "310110001001011001",
		"parentid": "310110001000"
	},
	{
		"shortname": "沈家滩居委会",
		"id": "310110001001012001",
		"parentid": "310110001000"
	},
	{
		"shortname": "波阳路居委会",
		"id": "310110001001013001",
		"parentid": "310110001000"
	},
	{
		"shortname": "定海居委会",
		"id": "310110001001014001",
		"parentid": "310110001000"
	},
	{
		"shortname": "定海港路居委会",
		"id": "310110001001015001",
		"parentid": "310110001000"
	},
	{
		"shortname": "复兴岛居委会",
		"id": "310110001001016001",
		"parentid": "310110001000"
	},
	{
		"shortname": "凉州路居委会",
		"id": "310110001001017001",
		"parentid": "310110001000"
	},
	{
		"shortname": "海州路居委会",
		"id": "310110001001018001",
		"parentid": "310110001000"
	},
	{
		"shortname": "爱国二村第二居委会",
		"id": "310110001001020001",
		"parentid": "310110001000"
	},
	{
		"shortname": "隆昌居委会",
		"id": "310110001001021001",
		"parentid": "310110001000"
	}, {
		"shortname": "许阳居委会",
		"id": "310110006001002001",
		"parentid": "310110006000"
	},
	{
		"shortname": "惠明居委会",
		"id": "310110006001005001",
		"parentid": "310110006000"
	},
	{
		"shortname": "平三居委会",
		"id": "310110006001006001",
		"parentid": "310110006000"
	},
	{
		"shortname": "纺三居委会",
		"id": "310110006001008001",
		"parentid": "310110006000"
	},
	{
		"shortname": "明园村居委会",
		"id": "310110006001009001",
		"parentid": "310110006000"
	},
	{
		"shortname": "怀德居委会",
		"id": "310110006001011001",
		"parentid": "310110006000"
	},
	{
		"shortname": "江浦居委会",
		"id": "310110006001012001",
		"parentid": "310110006000"
	},
	{
		"shortname": "上水工房居委会",
		"id": "310110006001015001",
		"parentid": "310110006000"
	},
	{
		"shortname": "秦家弄居委会",
		"id": "310110006001020001",
		"parentid": "310110006000"
	},
	{
		"shortname": "兰州居委会",
		"id": "310110006001021001",
		"parentid": "310110006000"
	},
	{
		"shortname": "隆仁居委会",
		"id": "310110006001023001",
		"parentid": "310110006000"
	},
	{
		"shortname": "新康里居委会",
		"id": "310110006001026001",
		"parentid": "310110006000"
	},
	{
		"shortname": "福宁居委会",
		"id": "310110006001027001",
		"parentid": "310110006000"
	},
	{
		"shortname": "八埭头居委会",
		"id": "310110006001029001",
		"parentid": "310110006000"
	},
	{
		"shortname": "霍新居委会",
		"id": "310110006001031001",
		"parentid": "310110006000"
	},
	{
		"shortname": "万新居委会",
		"id": "310110006001032001",
		"parentid": "310110006000"
	},
	{
		"shortname": "锦杨苑居委会",
		"id": "310110006001033001",
		"parentid": "310110006000"
	},
	{
		"shortname": "海杨居委会",
		"id": "310110006001034001",
		"parentid": "310110006000"
	},
	{
		"shortname": "嘉禄居委会",
		"id": "310110006001036001",
		"parentid": "310110006000"
	},
	{
		"shortname": "福禄居委会",
		"id": "310110006001037001",
		"parentid": "310110006000"
	}, {
		"shortname": "吴家浜居委会",
		"id": "310110008001004001",
		"parentid": "310110008000"
	},
	{
		"shortname": "兰州新村居委会",
		"id": "310110008001005001",
		"parentid": "310110008000"
	},
	{
		"shortname": "辽源新村居委会",
		"id": "310110008001006001",
		"parentid": "310110008000"
	},
	{
		"shortname": "陈家头第一居委会",
		"id": "310110008001007001",
		"parentid": "310110008000"
	},
	{
		"shortname": "蒋家浜居委会",
		"id": "310110008001009001",
		"parentid": "310110008000"
	},
	{
		"shortname": "张家浜居委会",
		"id": "310110008001011001",
		"parentid": "310110008000"
	},
	{
		"shortname": "陈家头第二居委会",
		"id": "310110008001012001",
		"parentid": "310110008000"
	},
	{
		"shortname": "陈家头第三居委会",
		"id": "310110008001013001",
		"parentid": "310110008000"
	},
	{
		"shortname": "辽源二村第一居委会",
		"id": "310110008001015001",
		"parentid": "310110008000"
	},
	{
		"shortname": "辽源二村第二居委会",
		"id": "310110008001016001",
		"parentid": "310110008000"
	},
	{
		"shortname": "辽源三村居委会",
		"id": "310110008001017001",
		"parentid": "310110008000"
	},
	{
		"shortname": "姚家桥居委会",
		"id": "310110008001018001",
		"parentid": "310110008000"
	},
	{
		"shortname": "辽源一村居委会",
		"id": "310110008001019001",
		"parentid": "310110008000"
	},
	{
		"shortname": "五环居委会",
		"id": "310110008001020001",
		"parentid": "310110008000"
	},
	{
		"shortname": "辽源四村居委会",
		"id": "310110008001021001",
		"parentid": "310110008000"
	},
	{
		"shortname": "金鹏居委会",
		"id": "310110008001022001",
		"parentid": "310110008000"
	},
	{
		"shortname": "又一村居委会",
		"id": "310110008001025001",
		"parentid": "310110008000"
	},
	{
		"shortname": "大花园居委会",
		"id": "310110008001026001",
		"parentid": "310110008000"
	},
	{
		"shortname": "星泰居委会",
		"id": "310110008001027001",
		"parentid": "310110008000"
	},
	{
		"shortname": "阳明居委会",
		"id": "310110008001028001",
		"parentid": "310110008000"
	},
	{
		"shortname": "金上海居委会",
		"id": "310110008001029001",
		"parentid": "310110008000"
	},
	{
		"shortname": "辽昆居委会",
		"id": "310110008001030001",
		"parentid": "310110008000"
	},
	{
		"shortname": "恒阳居委会",
		"id": "310110008001031001",
		"parentid": "310110008000"
	},
	{
		"shortname": "海上海居委会",
		"id": "310110008001032001",
		"parentid": "310110008000"
	},
	{
		"shortname": "大连路居委会",
		"id": "310110008001033001",
		"parentid": "310110008000"
	}, {
		"shortname": "控江路二零二六弄居委会",
		"id": "310110009001001001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山三村居委会",
		"id": "310110009001002001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山四村第一居委会",
		"id": "310110009001003001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山四村第二居委会",
		"id": "310110009001004001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山四村第三居委会",
		"id": "310110009001005001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山五村居委会",
		"id": "310110009001006001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山六村居委会",
		"id": "310110009001007001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山七村居委会",
		"id": "310110009001008001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山八村居委会",
		"id": "310110009001009001",
		"parentid": "310110009000"
	},
	{
		"shortname": "抚顺路三六三弄居委会",
		"id": "310110009001010001",
		"parentid": "310110009000"
	},
	{
		"shortname": "大连西路四弄居委会",
		"id": "310110009001011001",
		"parentid": "310110009000"
	},
	{
		"shortname": "同济新村居委会",
		"id": "310110009001012001",
		"parentid": "310110009000"
	},
	{
		"shortname": "密云路居委会",
		"id": "310110009001013001",
		"parentid": "310110009000"
	},
	{
		"shortname": "公交新村居委会",
		"id": "310110009001016001",
		"parentid": "310110009000"
	},
	{
		"shortname": "铁岭路五十弄居委会",
		"id": "310110009001017001",
		"parentid": "310110009000"
	},
	{
		"shortname": "铁岭路九十弄居委会",
		"id": "310110009001018001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山一村第二居委会",
		"id": "310110009001019001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山一村第三居委会",
		"id": "310110009001021001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山路三一零弄居委会",
		"id": "310110009001022001",
		"parentid": "310110009000"
	},
	{
		"shortname": "金安居委会",
		"id": "310110009001023001",
		"parentid": "310110009000"
	},
	{
		"shortname": "同济绿园居委会",
		"id": "310110009001025001",
		"parentid": "310110009000"
	},
	{
		"shortname": "鞍山一村第一居委会",
		"id": "310110009001026001",
		"parentid": "310110009000"
	},
	{
		"shortname": "和平花苑居委会",
		"id": "310110009001027001",
		"parentid": "310110009000"
	}, {
		"shortname": "控一居委会",
		"id": "310110012001001001",
		"parentid": "310110012000"
	},
	{
		"shortname": "欣辉居委会",
		"id": "310110012001003001",
		"parentid": "310110012000"
	},
	{
		"shortname": "控江四村第一居委会",
		"id": "310110012001004001",
		"parentid": "310110012000"
	},
	{
		"shortname": "控江四村第二居委会",
		"id": "310110012001005001",
		"parentid": "310110012000"
	},
	{
		"shortname": "控江二村一零七弄居委会",
		"id": "310110012001007001",
		"parentid": "310110012000"
	},
	{
		"shortname": "沧州路一八零弄居委会",
		"id": "310110012001008001",
		"parentid": "310110012000"
	},
	{
		"shortname": "双阳居委会",
		"id": "310110012001009001",
		"parentid": "310110012000"
	},
	{
		"shortname": "双花居委会",
		"id": "310110012001010001",
		"parentid": "310110012000"
	},
	{
		"shortname": "控江路一一九七弄居委会",
		"id": "310110012001011001",
		"parentid": "310110012000"
	},
	{
		"shortname": "新凤城居委会",
		"id": "310110012001012001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤二(1)居委会",
		"id": "310110012001013001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤三(1)居委会",
		"id": "310110012001014001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤三(2)居委会",
		"id": "310110012001015001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤三(3)居委会",
		"id": "310110012001016001",
		"parentid": "310110012000"
	},
	{
		"shortname": "抚岭居委会",
		"id": "310110012001018001",
		"parentid": "310110012000"
	},
	{
		"shortname": "黄兴居委会",
		"id": "310110012001019001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤南居委会",
		"id": "310110012001020001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤新居委会",
		"id": "310110012001021001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤二(2)居委会",
		"id": "310110012001022001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤三(4)居委会",
		"id": "310110012001023001",
		"parentid": "310110012000"
	},
	{
		"shortname": "控江路一千二百弄居委会",
		"id": "310110012001025001",
		"parentid": "310110012000"
	},
	{
		"shortname": "望春花居委会",
		"id": "310110012001026001",
		"parentid": "310110012000"
	},
	{
		"shortname": "凤联居委会",
		"id": "310110012001027001",
		"parentid": "310110012000"
	},
	{
		"shortname": "大运盛居委会",
		"id": "310110012001028001",
		"parentid": "310110012000"
	},
	{
		"shortname": "紫城居委会",
		"id": "310110012001030001",
		"parentid": "310110012000"
	}, {
		"shortname": "上理居委会",
		"id": "310110013001001001",
		"parentid": "310110013000"
	},
	{
		"shortname": "内江大楼居委会",
		"id": "310110013001003001",
		"parentid": "310110013000"
	},
	{
		"shortname": "图们路居委会",
		"id": "310110013001004001",
		"parentid": "310110013000"
	},
	{
		"shortname": "长白路第二居委会",
		"id": "310110013001006001",
		"parentid": "310110013000"
	},
	{
		"shortname": "长白一村居委会",
		"id": "310110013001007001",
		"parentid": "310110013000"
	},
	{
		"shortname": "长白二村第一居委会",
		"id": "310110013001008001",
		"parentid": "310110013000"
	},
	{
		"shortname": "安图新村居委会",
		"id": "310110013001009001",
		"parentid": "310110013000"
	},
	{
		"shortname": "松花新村居委会",
		"id": "310110013001011001",
		"parentid": "310110013000"
	},
	{
		"shortname": "民治路居委会",
		"id": "310110013001014001",
		"parentid": "310110013000"
	},
	{
		"shortname": "内江路三八四弄居委会",
		"id": "310110013001015001",
		"parentid": "310110013000"
	},
	{
		"shortname": "广远新村居委会",
		"id": "310110013001016001",
		"parentid": "310110013000"
	},
	{
		"shortname": "控江路一二一弄居委会",
		"id": "310110013001017001",
		"parentid": "310110013000"
	},
	{
		"shortname": "控江路十八弄居委会",
		"id": "310110013001018001",
		"parentid": "310110013000"
	},
	{
		"shortname": "松延居委会",
		"id": "310110013001019001",
		"parentid": "310110013000"
	},
	{
		"shortname": "延东居委会",
		"id": "310110013001020001",
		"parentid": "310110013000"
	},
	{
		"shortname": "松花江路九十五弄居委会",
		"id": "310110013001021001",
		"parentid": "310110013000"
	},
	{
		"shortname": "长白新城居委会",
		"id": "310110013001022001",
		"parentid": "310110013000"
	},
	{
		"shortname": "敦化路居委会",
		"id": "310110015001001001",
		"parentid": "310110015000"
	},
	{
		"shortname": "控江路六四五弄居委会",
		"id": "310110015001002001",
		"parentid": "310110015000"
	},
	{
		"shortname": "控江七村居委会",
		"id": "310110015001003001",
		"parentid": "310110015000"
	},
	{
		"shortname": "友谊新村居委会",
		"id": "310110015001004001",
		"parentid": "310110015000"
	},
	{
		"shortname": "松花江路居委会",
		"id": "310110015001005001",
		"parentid": "310110015000"
	},
	{
		"shortname": "舒兰路居委会",
		"id": "310110015001006001",
		"parentid": "310110015000"
	},
	{
		"shortname": "内江新村居委会",
		"id": "310110015001007001",
		"parentid": "310110015000"
	},
	{
		"shortname": "长白三村居委会",
		"id": "310110015001008001",
		"parentid": "310110015000"
	},
	{
		"shortname": "延吉一村居委会",
		"id": "310110015001009001",
		"parentid": "310110015000"
	},
	{
		"shortname": "延吉二、三村居委会",
		"id": "310110015001010001",
		"parentid": "310110015000"
	},
	{
		"shortname": "延吉四村居委会",
		"id": "310110015001011001",
		"parentid": "310110015000"
	},
	{
		"shortname": "延吉五、六村居委会",
		"id": "310110015001012001",
		"parentid": "310110015000"
	},
	{
		"shortname": "延吉七村居委会",
		"id": "310110015001013001",
		"parentid": "310110015000"
	},
	{
		"shortname": "控江东三村居委会",
		"id": "310110015001014001",
		"parentid": "310110015000"
	},
	{
		"shortname": "控江西三村居委会",
		"id": "310110015001015001",
		"parentid": "310110015000"
	},
	{
		"shortname": "控江五村居委会",
		"id": "310110015001016001",
		"parentid": "310110015000"
	},
	{
		"shortname": "杨家浜居委会",
		"id": "310110015001017001",
		"parentid": "310110015000"
	}, {
		"shortname": "殷行一村居委会",
		"id": "310110016001001002",
		"parentid": "310110016000"
	},
	{
		"shortname": "殷行二村居委会",
		"id": "310110016001003002",
		"parentid": "310110016000"
	},
	{
		"shortname": "工农新村居委会",
		"id": "310110016001005002",
		"parentid": "310110016000"
	},
	{
		"shortname": "工二(1)居委会",
		"id": "310110016001007001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工二(2)居委会",
		"id": "310110016001008001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工二(3)居委会",
		"id": "310110016001009001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工二(4)居委会",
		"id": "310110016001010001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工三(1)居委会",
		"id": "310110016001011001",
		"parentid": "310110016000"
	},
	{
		"shortname": "闸一居委会",
		"id": "310110016001012001",
		"parentid": "310110016000"
	},
	{
		"shortname": "闸二居委会",
		"id": "310110016001013001",
		"parentid": "310110016000"
	},
	{
		"shortname": "开一居委会",
		"id": "310110016001014001",
		"parentid": "310110016000"
	},
	{
		"shortname": "开二居委会",
		"id": "310110016001015001",
		"parentid": "310110016000"
	},
	{
		"shortname": "开三居委会",
		"id": "310110016001016001",
		"parentid": "310110016000"
	},
	{
		"shortname": "开四居委会",
		"id": "310110016001017001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市一(1)居委会",
		"id": "310110016001018001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市一(3)居委会",
		"id": "310110016001019001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市二(1)居委会",
		"id": "310110016001020001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市二(2)居委会",
		"id": "310110016001021001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市二(3)居委会",
		"id": "310110016001022001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市四(2)居委会",
		"id": "310110016001023001",
		"parentid": "310110016000"
	},
	{
		"shortname": "国一(1)居委会",
		"id": "310110016001024001",
		"parentid": "310110016000"
	},
	{
		"shortname": "国一(3)居委会",
		"id": "310110016001025001",
		"parentid": "310110016000"
	},
	{
		"shortname": "国二(1)居委会",
		"id": "310110016001026001",
		"parentid": "310110016000"
	},
	{
		"shortname": "国二(3)居委会",
		"id": "310110016001027001",
		"parentid": "310110016000"
	},
	{
		"shortname": "民一(1)居委会",
		"id": "310110016001028001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市光三村第一居委会",
		"id": "310110016001030001",
		"parentid": "310110016000"
	},
	{
		"shortname": "开鲁五村居委会",
		"id": "310110016001032001",
		"parentid": "310110016000"
	},
	{
		"shortname": "开鲁六村居委会",
		"id": "310110016001033001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市光一村(2)居委会",
		"id": "310110016001034001",
		"parentid": "310110016000"
	},
	{
		"shortname": "殷行路四七零弄居委会",
		"id": "310110016001035001",
		"parentid": "310110016000"
	},
	{
		"shortname": "殷行路三一零弄居委会",
		"id": "310110016001036001",
		"parentid": "310110016000"
	},
	{
		"shortname": "中原一村居委会",
		"id": "310110016001037001",
		"parentid": "310110016000"
	},
	{
		"shortname": "闸殷路八十一弄居委会",
		"id": "310110016001038001",
		"parentid": "310110016000"
	},
	{
		"shortname": "殷行路二百五十弄居委会",
		"id": "310110016001039001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市光四村(3)居委会",
		"id": "310110016001040001",
		"parentid": "310110016000"
	},
	{
		"shortname": "民星路六百弄居委会",
		"id": "310110016001041001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工农四村(2)居委会",
		"id": "310110016001042001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工三(2)居委会",
		"id": "310110016001043001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工三(3)居委会",
		"id": "310110016001044001",
		"parentid": "310110016000"
	},
	{
		"shortname": "工四(1)居委会",
		"id": "310110016001045001",
		"parentid": "310110016000"
	},
	{
		"shortname": "中原路九九零弄居委会",
		"id": "310110016001046001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市光三(2)居委会",
		"id": "310110016001047001",
		"parentid": "310110016000"
	},
	{
		"shortname": "市光四(1)居委会",
		"id": "310110016001048001",
		"parentid": "310110016000"
	},
	{
		"shortname": "民一(2)居委会",
		"id": "310110016001049001",
		"parentid": "310110016000"
	},
	{
		"shortname": "民星二村居委会",
		"id": "310110016001050001",
		"parentid": "310110016000"
	},
	{
		"shortname": "国一(2)居委会",
		"id": "310110016001051001",
		"parentid": "310110016000"
	},
	{
		"shortname": "国二(2)居委会",
		"id": "310110016001052001",
		"parentid": "310110016000"
	},
	{
		"shortname": "城市名园居委会",
		"id": "310110016001053001",
		"parentid": "310110016000"
	},
	{
		"shortname": "城市庭园居委会",
		"id": "310110016001054001",
		"parentid": "310110016000"
	},
	{
		"shortname": "城市方园居委会",
		"id": "310110016001055001",
		"parentid": "310110016000"
	}, {
		"shortname": "仁兴街居委会",
		"id": "310110018001001001",
		"parentid": "310110018000"
	},
	{
		"shortname": "方子桥居委会",
		"id": "310110018001002001",
		"parentid": "310110018000"
	},
	{
		"shortname": "顺成里居委会",
		"id": "310110018001003001",
		"parentid": "310110018000"
	},
	{
		"shortname": "杨家宅居委会",
		"id": "310110018001004001",
		"parentid": "310110018000"
	},
	{
		"shortname": "华忻坊居委会",
		"id": "310110018001005001",
		"parentid": "310110018000"
	},
	{
		"shortname": "永安里居委会",
		"id": "310110018001006001",
		"parentid": "310110018000"
	},
	{
		"shortname": "周家牌路居委会",
		"id": "310110018001007001",
		"parentid": "310110018000"
	},
	{
		"shortname": "富禄里居委会",
		"id": "310110018001008001",
		"parentid": "310110018000"
	},
	{
		"shortname": "鸿德坊居委会",
		"id": "310110018001009001",
		"parentid": "310110018000"
	},
	{
		"shortname": "锦州湾路居委会",
		"id": "310110018001011001",
		"parentid": "310110018000"
	},
	{
		"shortname": "临青路居委会",
		"id": "310110018001012001",
		"parentid": "310110018000"
	},
	{
		"shortname": "双阳路居委会",
		"id": "310110018001013001",
		"parentid": "310110018000"
	},
	{
		"shortname": "引翔港居委会",
		"id": "310110018001014001",
		"parentid": "310110018000"
	},
	{
		"shortname": "幸福村居委会",
		"id": "310110018001015001",
		"parentid": "310110018000"
	},
	{
		"shortname": "长眉居委会",
		"id": "310110018001016001",
		"parentid": "310110018000"
	},
	{
		"shortname": "宁武路居委会",
		"id": "310110018001017001",
		"parentid": "310110018000"
	},
	{
		"shortname": "河间路居委会",
		"id": "310110018001018001",
		"parentid": "310110018000"
	},
	{
		"shortname": "中王家宅居委会",
		"id": "310110018001019001",
		"parentid": "310110018000"
	},
	{
		"shortname": "申新村居委会",
		"id": "310110018001020001",
		"parentid": "310110018000"
	},
	{
		"shortname": "平眉居委会",
		"id": "310110018001021001",
		"parentid": "310110018000"
	},
	{
		"shortname": "新华里居委会",
		"id": "310110018001022001",
		"parentid": "310110018000"
	},
	{
		"shortname": "渭南路居委会",
		"id": "310110018001024001",
		"parentid": "310110018000"
	},
	{
		"shortname": "宁国里居委会",
		"id": "310110018001025001",
		"parentid": "310110018000"
	},
	{
		"shortname": "广杭居委会",
		"id": "310110018001026001",
		"parentid": "310110018000"
	},
	{
		"shortname": "杭州路居委会",
		"id": "310110018001027001",
		"parentid": "310110018000"
	},
	{
		"shortname": "银河苑居委会",
		"id": "310110018001028001",
		"parentid": "310110018000"
	},
	{
		"shortname": "长阳新苑居委会",
		"id": "310110018001029001",
		"parentid": "310110018000"
	},
	{
		"shortname": "富阳居委会",
		"id": "310110018001030001",
		"parentid": "310110018000"
	},
	{
		"shortname": "月坊居委会",
		"id": "310110018001031001",
		"parentid": "310110018000"
	}, {
		"shortname": "武东居委会",
		"id": "310110019001001001",
		"parentid": "310110019000"
	},
	{
		"shortname": "五一居委会",
		"id": "310110019001002001",
		"parentid": "310110019000"
	},
	{
		"shortname": "政民居委会",
		"id": "310110019001003001",
		"parentid": "310110019000"
	},
	{
		"shortname": "建新居委会",
		"id": "310110019001004001",
		"parentid": "310110019000"
	},
	{
		"shortname": "复旦居委会",
		"id": "310110019001005002",
		"parentid": "310110019000"
	},
	{
		"shortname": "国定一居委会",
		"id": "310110019001007001",
		"parentid": "310110019000"
	},
	{
		"shortname": "铁路新村居委会",
		"id": "310110019001009001",
		"parentid": "310110019000"
	},
	{
		"shortname": "四平居委会",
		"id": "310110019001011001",
		"parentid": "310110019000"
	},
	{
		"shortname": "四平一居委会",
		"id": "310110019001012001",
		"parentid": "310110019000"
	},
	{
		"shortname": "国年居委会",
		"id": "310110019001013001",
		"parentid": "310110019000"
	},
	{
		"shortname": "国顺居委会",
		"id": "310110019001014001",
		"parentid": "310110019000"
	},
	{
		"shortname": "国权居委会",
		"id": "310110019001016001",
		"parentid": "310110019000"
	},
	{
		"shortname": "航天居委会",
		"id": "310110019001018001",
		"parentid": "310110019000"
	},
	{
		"shortname": "政翔殷居委会",
		"id": "310110019001020002",
		"parentid": "310110019000"
	},
	{
		"shortname": "东郸居委会",
		"id": "310110019001021001",
		"parentid": "310110019000"
	},
	{
		"shortname": "蓝天居委会",
		"id": "310110019001022001",
		"parentid": "310110019000"
	},
	{
		"shortname": "三门路居委会",
		"id": "310110019001023001",
		"parentid": "310110019000"
	},
	{
		"shortname": "吉浦居委会",
		"id": "310110019001025001",
		"parentid": "310110019000"
	},
	{
		"shortname": "南茶园居委会",
		"id": "310110019001026001",
		"parentid": "310110019000"
	},
	{
		"shortname": "邯郸路居委会",
		"id": "310110019001027001",
		"parentid": "310110019000"
	},
	{
		"shortname": "国权北路居委会",
		"id": "310110019001028001",
		"parentid": "310110019000"
	},
	{
		"shortname": "仁德路居委会",
		"id": "310110019001029001",
		"parentid": "310110019000"
	},
	{
		"shortname": "北茶园路居委会",
		"id": "310110019001030001",
		"parentid": "310110019000"
	},
	{
		"shortname": "政通路第一居委会",
		"id": "310110019001031001",
		"parentid": "310110019000"
	},
	{
		"shortname": "财大居委会",
		"id": "310110019001032001",
		"parentid": "310110019000"
	},
	{
		"shortname": "国权路第一居委会",
		"id": "310110019001033001",
		"parentid": "310110019000"
	},
	{
		"shortname": "文化花园居委会",
		"id": "310110019001034001",
		"parentid": "310110019000"
	},
	{
		"shortname": "三湘居委会",
		"id": "310110019001035001",
		"parentid": "310110019000"
	},
	{
		"shortname": "正文居委会",
		"id": "310110019001036001",
		"parentid": "310110019000"
	},
	{
		"shortname": "汇元坊居委会",
		"id": "310110019001037001",
		"parentid": "310110019000"
	},
	{
		"shortname": "吉浦一居委会",
		"id": "310110019001038001",
		"parentid": "310110019000"
	},
	{
		"shortname": "创智坊居委会（筹）",
		"id": "310110019001039001",
		"parentid": "310110019000"
	},
	{
		"shortname": "政立路第一居委会",
		"id": "310110020001001001",
		"parentid": "310110020000"
	},
	{
		"shortname": "时代花园居委会",
		"id": "310110020001003001",
		"parentid": "310110020000"
	},
	{
		"shortname": "政立路第二居委会",
		"id": "310110020001004001",
		"parentid": "310110020000"
	},
	{
		"shortname": "建德国际公寓居委会",
		"id": "310110020001005001",
		"parentid": "310110020000"
	},
	{
		"shortname": "雍景苑居委会",
		"id": "310110020001006001",
		"parentid": "310110020000"
	},
	{
		"shortname": "东森涵碧居委会",
		"id": "310110020001007001",
		"parentid": "310110020000"
	},
	{
		"shortname": "江湾国际公寓居委会",
		"id": "310110020001008001",
		"parentid": "310110020000"
	},
	{
		"shortname": "橡树湾居委会",
		"id": "310110020001009001",
		"parentid": "310110020000"
	},
	{
		"shortname": "加州水郡居委会 （筹）",
		"id": "310110020001010001",
		"parentid": "310110020000"
	},
	{
		"shortname": "仁恒怡庭居委会（筹）",
		"id": "310110020001011001",
		"parentid": "310110020000"
	},
	{
		"shortname": "尚景园居委会（筹）",
		"id": "310110020001012001",
		"parentid": "310110020000"
	},
	{
		"shortname": "政青路居委会（筹）",
		"id": "310110020001013001",
		"parentid": "310110020000"
	},
	{
		"shortname": "祥生泰宝居委会（筹）",
		"id": "310110020001014001",
		"parentid": "310110020000"
	},
	{
		"shortname": "中建大公馆居委会（筹）",
		"id": "310110020001016001",
		"parentid": "310110020000"
	},
	{
		"shortname": "九龙仓玺园居委会（筹）",
		"id": "310110020001017001",
		"parentid": "310110020000"
	}, {
		"shortname": "国和路第一居委会",
		"id": "310110101001001001",
		"parentid": "310110101000"
	},
	{
		"shortname": "市光居委会",
		"id": "310110101001002001",
		"parentid": "310110101000"
	},
	{
		"shortname": "市光路第三居委会",
		"id": "310110101001003001",
		"parentid": "310110101000"
	},
	{
		"shortname": "黑山新村居委会",
		"id": "310110101001004001",
		"parentid": "310110101000"
	},
	{
		"shortname": "洪东居委会",
		"id": "310110101001005001",
		"parentid": "310110101000"
	},
	{
		"shortname": "梅林居委会",
		"id": "310110101001006001",
		"parentid": "310110101000"
	},
	{
		"shortname": "虬江居委会",
		"id": "310110101001007001",
		"parentid": "310110101000"
	},
	{
		"shortname": "翔殷路四九一弄居委会",
		"id": "310110101001008001",
		"parentid": "310110101000"
	},
	{
		"shortname": "梅花村居委会",
		"id": "310110101001009001",
		"parentid": "310110101000"
	},
	{
		"shortname": "兰花村居委会",
		"id": "310110101001010001",
		"parentid": "310110101000"
	},
	{
		"shortname": "长海居委会",
		"id": "310110101001011001",
		"parentid": "310110101000"
	},
	{
		"shortname": "体院居委会",
		"id": "310110101001012001",
		"parentid": "310110101000"
	},
	{
		"shortname": "长海一村居委会",
		"id": "310110101001013001",
		"parentid": "310110101000"
	},
	{
		"shortname": "长海三村居委会",
		"id": "310110101001014001",
		"parentid": "310110101000"
	},
	{
		"shortname": "浣纱三村居委会",
		"id": "310110101001016001",
		"parentid": "310110101000"
	},
	{
		"shortname": "浣纱四村居委会",
		"id": "310110101001017001",
		"parentid": "310110101000"
	},
	{
		"shortname": "浣纱六村居委会",
		"id": "310110101001018001",
		"parentid": "310110101000"
	},
	{
		"shortname": "市京一村居委会",
		"id": "310110101001019001",
		"parentid": "310110101000"
	},
	{
		"shortname": "市光路第二居委会",
		"id": "310110101001020001",
		"parentid": "310110101000"
	},
	{
		"shortname": "民京路第一居委会",
		"id": "310110101001022001",
		"parentid": "310110101000"
	},
	{
		"shortname": "国顺东路二十六弄居委会",
		"id": "310110101001023001",
		"parentid": "310110101000"
	},
	{
		"shortname": "中翔居委会",
		"id": "310110101001024001",
		"parentid": "310110101000"
	},
	{
		"shortname": "兰新居委会",
		"id": "310110101001025001",
		"parentid": "310110101000"
	},
	{
		"shortname": "中原路九十九弄居委会",
		"id": "310110101001026001",
		"parentid": "310110101000"
	},
	{
		"shortname": "长海二村居委会",
		"id": "310110101001027001",
		"parentid": "310110101000"
	},
	{
		"shortname": "佳木斯路居委会",
		"id": "310110101001028001",
		"parentid": "310110101000"
	},
	{
		"shortname": "佳木斯路三一五弄居委会",
		"id": "310110101001029001",
		"parentid": "310110101000"
	},
	{
		"shortname": "中农新村居委会",
		"id": "310110101001030001",
		"parentid": "310110101000"
	},
	{
		"shortname": "翔殷新村居委会",
		"id": "310110101001031001",
		"parentid": "310110101000"
	},
	{
		"shortname": "教师公寓居委会",
		"id": "310110101001032001",
		"parentid": "310110101000"
	},
	{
		"shortname": "佳泰居委会",
		"id": "310110101001033001",
		"parentid": "310110101000"
	},
	{
		"shortname": "黄兴花园居委会",
		"id": "310110101001034001",
		"parentid": "310110101000"
	},
	{
		"shortname": "世界居委会",
		"id": "310110101001035001",
		"parentid": "310110101000"
	},
	{
		"shortname": "东方名城居委会",
		"id": "310110101001036001",
		"parentid": "310110101000"
	},
	{
		"shortname": "佳龙居委会",
		"id": "310110101001037001",
		"parentid": "310110101000"
	},
	{
		"shortname": "黄兴绿园居委会",
		"id": "310110101001038001",
		"parentid": "310110101000"
	},
	{
		"shortname": "香阁丽苑居委会",
		"id": "310110101001039001",
		"parentid": "310110101000"
	},
	{
		"shortname": "文化佳园居委会",
		"id": "310110101001040001",
		"parentid": "310110101000"
	},
	{
		"shortname": "莱茵居委会",
		"id": "310110101001041001",
		"parentid": "310110101000"
	},
	{
		"shortname": "盛世豪园居委会（筹）",
		"id": "310110101001042001",
		"parentid": "310110101000"
	},
	{
		"shortname": "民庆家园居委会",
		"id": "310110101001043001",
		"parentid": "310110101000"
	},
	{
		"shortname": "星云居委会",
		"id": "310110101001044001",
		"parentid": "310110101000"
	},
	{
		"shortname": "海上硕和城居委会",
		"id": "310110101001045001",
		"parentid": "310110101000"
	}, {
		"shortname": "北街居委会",
		"id": "310112001001001001",
		"parentid": "310112001000"
	},
	{
		"shortname": "河东居委会",
		"id": "310112001001002001",
		"parentid": "310112001000"
	},
	{
		"shortname": "华江新村第一居委会",
		"id": "310112001001003001",
		"parentid": "310112001000"
	},
	{
		"shortname": "华江新村第二居委会",
		"id": "310112001001004001",
		"parentid": "310112001000"
	},
	{
		"shortname": "高华新村第二居委会",
		"id": "310112001001006001",
		"parentid": "310112001000"
	},
	{
		"shortname": "高华新村第三居委会",
		"id": "310112001001007001",
		"parentid": "310112001000"
	},
	{
		"shortname": "东风新村第一居委会",
		"id": "310112001001009001",
		"parentid": "310112001000"
	},
	{
		"shortname": "东风新村第三居委会",
		"id": "310112001001011001",
		"parentid": "310112001000"
	},
	{
		"shortname": "新闵新村居委会",
		"id": "310112001001013001",
		"parentid": "310112001000"
	},
	{
		"shortname": "沧源新村第一居委会",
		"id": "310112001001014001",
		"parentid": "310112001000"
	},
	{
		"shortname": "沧源新村第二居委会",
		"id": "310112001001015001",
		"parentid": "310112001000"
	},
	{
		"shortname": "沧源新村第三居委会",
		"id": "310112001001016001",
		"parentid": "310112001000"
	},
	{
		"shortname": "兰坪新村第一居委会",
		"id": "310112001001017001",
		"parentid": "310112001000"
	},
	{
		"shortname": "兰坪新村第二居委会",
		"id": "310112001001018001",
		"parentid": "310112001000"
	},
	{
		"shortname": "汽轮新村第一居委会",
		"id": "310112001001019001",
		"parentid": "310112001000"
	},
	{
		"shortname": "汽轮新村第三居委会",
		"id": "310112001001020001",
		"parentid": "310112001000"
	},
	{
		"shortname": "瑞丽新村居委会",
		"id": "310112001001021001",
		"parentid": "310112001000"
	},
	{
		"shortname": "电机新村第一居委会",
		"id": "310112001001022001",
		"parentid": "310112001000"
	},
	{
		"shortname": "电机新村第二居委会",
		"id": "310112001001023001",
		"parentid": "310112001000"
	},
	{
		"shortname": "电机新村第四居委会",
		"id": "310112001001024001",
		"parentid": "310112001000"
	},
	{
		"shortname": "电机新村第五居委会",
		"id": "310112001001025001",
		"parentid": "310112001000"
	},
	{
		"shortname": "红旗新村居委会",
		"id": "310112001001027001",
		"parentid": "310112001000"
	},
	{
		"shortname": "红旗新村第三居委会",
		"id": "310112001001028001",
		"parentid": "310112001000"
	},
	{
		"shortname": "红旗新村第四居委会",
		"id": "310112001001029001",
		"parentid": "310112001000"
	},
	{
		"shortname": "红旗新村第五居委会",
		"id": "310112001001030001",
		"parentid": "310112001000"
	},
	{
		"shortname": "红旗新村第七居委会",
		"id": "310112001001031001",
		"parentid": "310112001000"
	},
	{
		"shortname": "昆阳新村第一居委会",
		"id": "310112001001032001",
		"parentid": "310112001000"
	},
	{
		"shortname": "昆阳新村第三居委会",
		"id": "310112001001033001",
		"parentid": "310112001000"
	},
	{
		"shortname": "鹤北新村第一居委会",
		"id": "310112001001034001",
		"parentid": "310112001000"
	},
	{
		"shortname": "鹤北新村第三居委会",
		"id": "310112001001035001",
		"parentid": "310112001000"
	},
	{
		"shortname": "鹤庆新村第一居委会",
		"id": "310112001001036001",
		"parentid": "310112001000"
	},
	{
		"shortname": "鹤庆新村第二居委会",
		"id": "310112001001037001",
		"parentid": "310112001000"
	},
	{
		"shortname": "紫藤新园居委会",
		"id": "310112001001039001",
		"parentid": "310112001000"
	},
	{
		"shortname": "富仕名邸居委会",
		"id": "310112001001040001",
		"parentid": "310112001000"
	},
	{
		"shortname": "红旗新村第六居委会",
		"id": "310112001001041001",
		"parentid": "310112001000"
	},
	{
		"shortname": "安宁路第一居委会",
		"id": "310112001001042001",
		"parentid": "310112001000"
	},
	{
		"shortname": "鹤北新村第四居委会",
		"id": "310112001001043001",
		"parentid": "310112001000"
	},
	{
		"shortname": "金平新村居委会",
		"id": "310112001001044001",
		"parentid": "310112001000"
	},
	{
		"shortname": "南洋博士欣居居委会",
		"id": "310112001001045001",
		"parentid": "310112001000"
	},
	{
		"shortname": "好第坊文馨苑居委会",
		"id": "310112001001046001",
		"parentid": "310112001000"
	},
	{
		"shortname": "假日景苑居委会",
		"id": "310112001001047001",
		"parentid": "310112001000"
	},
	{
		"shortname": "合生城邦城第一居委会",
		"id": "310112001001048001",
		"parentid": "310112001000"
	},
	{
		"shortname": "合生城邦城第二居委会",
		"id": "310112001001049001",
		"parentid": "310112001000"
	},
	{
		"shortname": "合生城邦城第三居委会",
		"id": "310112001001050001",
		"parentid": "310112001000"
	},
	{
		"shortname": "合生城邦城第四居委会",
		"id": "310112001001051001",
		"parentid": "310112001000"
	},
	{
		"shortname": "凤凰景苑居委会（筹）",
		"id": "310112001001816002",
		"parentid": "310112001000"
	},
	{
		"shortname": "永平南路第一居委会（筹）",
		"id": "310112001001852001",
		"parentid": "310112001000"
	},
	{
		"shortname": "友好村村居委（筹）",
		"id": "310112001001854001",
		"parentid": "310112001000"
	},
	{
		"shortname": "五星村村居委（筹）",
		"id": "310112001001855001",
		"parentid": "310112001000"
	},
	{
		"shortname": "新闵村村居委（筹）",
		"id": "310112001001856001",
		"parentid": "310112001000"
	},
	{
		"shortname": "黄一村村委会（筹）",
		"id": "310112001001857001",
		"parentid": "310112001000"
	},
	{
		"shortname": "黄二村村委会（筹）",
		"id": "310112001001858001",
		"parentid": "310112001000"
	},
	{
		"shortname": "瑞丽名邸海赋尚品居（筹）",
		"id": "310112001001864001",
		"parentid": "310112001000"
	},
	{
		"shortname": "满庭春雅苑居委会（筹）",
		"id": "310112001001865001",
		"parentid": "310112001000"
	},
	{
		"shortname": "古美一村居委会",
		"id": "310112006001001001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古美三村居委会",
		"id": "310112006001002001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古美四村居委会",
		"id": "310112006001003001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古美七村居委会",
		"id": "310112006001005001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古美八村居委会",
		"id": "310112006001006001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古美十村居委会",
		"id": "310112006001007001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平阳一村居委会",
		"id": "310112006001008001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平阳三村居委会",
		"id": "310112006001009001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平阳四村居委会",
		"id": "310112006001010001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平阳六村居委会",
		"id": "310112006001011001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平吉一村居委会",
		"id": "310112006001012001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平吉二村居委会",
		"id": "310112006001013001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平南新村第一居委会",
		"id": "310112006001014001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平南新村第二居委会",
		"id": "310112006001015001",
		"parentid": "310112006000"
	},
	{
		"shortname": "东兰新村第一居委会",
		"id": "310112006001016001",
		"parentid": "310112006000"
	},
	{
		"shortname": "华梅花苑居委会",
		"id": "310112006001017001",
		"parentid": "310112006000"
	},
	{
		"shortname": "梅莲苑居委会",
		"id": "310112006001018001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古龙一村居委会",
		"id": "310112006001019001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平吉三村居委会",
		"id": "310112006001020001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平吉四村居委会",
		"id": "310112006001021001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平吉六村居委会",
		"id": "310112006001022001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平南新村第三居委会",
		"id": "310112006001023001",
		"parentid": "310112006000"
	},
	{
		"shortname": "华一新城居委会",
		"id": "310112006001024001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平阳五村居委会",
		"id": "310112006001025001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古龙二村居委会",
		"id": "310112006001031001",
		"parentid": "310112006000"
	},
	{
		"shortname": "东兰新村第二居委会",
		"id": "310112006001032001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古美九村居委会",
		"id": "310112006001033001",
		"parentid": "310112006000"
	},
	{
		"shortname": "东兰新村第三居委会",
		"id": "310112006001034001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古龙三村居委会",
		"id": "310112006001035001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古龙四村居委会",
		"id": "310112006001036001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古龙五村居委会",
		"id": "310112006001037001",
		"parentid": "310112006000"
	},
	{
		"shortname": "古龙六村居委会",
		"id": "310112006001038001",
		"parentid": "310112006000"
	},
	{
		"shortname": "东兰新村第四居委会",
		"id": "310112006001039001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平阳二村居委会",
		"id": "310112006001040001",
		"parentid": "310112006000"
	},
	{
		"shortname": "平吉五村居委会",
		"id": "310112006001041001",
		"parentid": "310112006000"
	},
	{
		"shortname": "万源城第三居委会",
		"id": "310112006001042001",
		"parentid": "310112006000"
	},
	{
		"shortname": "万源城第二居委会",
		"id": "310112006001043001",
		"parentid": "310112006000"
	},
	{
		"shortname": "万源城第四居委会",
		"id": "310112006001044001",
		"parentid": "310112006000"
	},
	{
		"shortname": "万源城第一居委会(筹)",
		"id": "310112006001815002",
		"parentid": "310112006000"
	}, {
		"shortname": "航华一村第二居委会",
		"id": "310112008001001001",
		"parentid": "310112008000"
	},
	{
		"shortname": "航华一村第五居委会",
		"id": "310112008001002001",
		"parentid": "310112008000"
	},
	{
		"shortname": "航华一村第六居委会",
		"id": "310112008001003001",
		"parentid": "310112008000"
	},
	{
		"shortname": "航华一村第七居委会",
		"id": "310112008001004001",
		"parentid": "310112008000"
	},
	{
		"shortname": "沙茂居委会",
		"id": "310112008001005001",
		"parentid": "310112008000"
	},
	{
		"shortname": "华美路居委会",
		"id": "310112008001006001",
		"parentid": "310112008000"
	},
	{
		"shortname": "华美路第二居委会",
		"id": "310112008001007001",
		"parentid": "310112008000"
	},
	{
		"shortname": "爱博一村居委会",
		"id": "310112008001008001",
		"parentid": "310112008000"
	},
	{
		"shortname": "爱博二村居委会",
		"id": "310112008001009001",
		"parentid": "310112008000"
	},
	{
		"shortname": "爱博三村居委会",
		"id": "310112008001010001",
		"parentid": "310112008000"
	},
	{
		"shortname": "爱博五村居委会",
		"id": "310112008001011001",
		"parentid": "310112008000"
	},
	{
		"shortname": "爱博四村居委会",
		"id": "310112008001012001",
		"parentid": "310112008000"
	},
	{
		"shortname": "万科润园居委会",
		"id": "310112008001013001",
		"parentid": "310112008000"
	},
	{
		"shortname": "光华村村委会",
		"id": "310112008001202001",
		"parentid": "310112008000"
	},
	{
		"shortname": "范巷村村委会",
		"id": "310112008001203001",
		"parentid": "310112008000"
	},
	{
		"shortname": "建设村村委会",
		"id": "310112008001205001",
		"parentid": "310112008000"
	},
	{
		"shortname": "红星村村委会",
		"id": "310112008001206001",
		"parentid": "310112008000"
	},
	{
		"shortname": "新家弄村村委会",
		"id": "310112008001209001",
		"parentid": "310112008000"
	},
	{
		"shortname": "陶家角村村委会",
		"id": "310112008001210001",
		"parentid": "310112008000"
	}, {
		"shortname": "世博家园第一居委会",
		"id": "310112009001001002",
		"parentid": "310112090000"
	},
	{
		"shortname": "世博家园第二居委会",
		"id": "310112009001002002",
		"parentid": "310112090000"
	},
	{
		"shortname": "世博家园第三居委会",
		"id": "310112009001003002",
		"parentid": "310112090000"
	},
	{
		"shortname": "世博家园第四居委会",
		"id": "310112009001004002",
		"parentid": "310112090000"
	},
	{
		"shortname": "世博家园第五居委会",
		"id": "310112009001005002",
		"parentid": "310112090000"
	},
	{
		"shortname": "世博家园第六居委会",
		"id": "310112009001006002",
		"parentid": "310112090000"
	},
	{
		"shortname": "陈行居委会",
		"id": "310112009001007002",
		"parentid": "310112090000"
	},
	{
		"shortname": "景江苑居委会",
		"id": "310112009001008001",
		"parentid": "310112090000"
	},
	{
		"shortname": "景舒苑第一居委会",
		"id": "310112009001009001",
		"parentid": "310112090000"
	},
	{
		"shortname": "景舒苑第二居委会",
		"id": "310112009001010001",
		"parentid": "310112090000"
	},
	{
		"shortname": "景舒苑第三居委会",
		"id": "310112009001011001",
		"parentid": "310112090000"
	},
	{
		"shortname": "滨浦第一居委会",
		"id": "310112009001012001",
		"parentid": "310112090000"
	},
	{
		"shortname": "滨浦第二居委会",
		"id": "310112009001013001",
		"parentid": "310112090000"
	},
	{
		"shortname": "新浦江城第一居委会",
		"id": "310112009001014001",
		"parentid": "310112090000"
	},
	{
		"shortname": "一品漫城第一居委会",
		"id": "310112009001015001",
		"parentid": "310112090000"
	},
	{
		"shortname": "新浦江城第二居委会",
		"id": "310112009001016001",
		"parentid": "310112090000"
	},
	{
		"shortname": "一品漫城第二居委会",
		"id": "310112009001017001",
		"parentid": "310112090000"
	},
	{
		"shortname": "茉莉名邸居委会",
		"id": "310112009001018001",
		"parentid": "310112090000"
	},
	{
		"shortname": "浦江颐城居委会",
		"id": "310112009001019001",
		"parentid": "310112090000"
	},
	{
		"shortname": "滨浦新苑第三居委会",
		"id": "310112009001020001",
		"parentid": "310112090000"
	},
	{
		"shortname": "滨浦新苑第四居委会",
		"id": "310112009001021001",
		"parentid": "310112090000"
	},
	{
		"shortname": "丁连村村委会",
		"id": "310112009001201001",
		"parentid": "310112090000"
	},
	{
		"shortname": "丰收村村委会",
		"id": "310112009001202001",
		"parentid": "310112090000"
	},
	{
		"shortname": "陈行村村委会",
		"id": "310112009001203001",
		"parentid": "310112090000"
	},
	{
		"shortname": "芦胜村村委会",
		"id": "310112009001204001",
		"parentid": "310112090000"
	},
	{
		"shortname": "近浦村村委会",
		"id": "310112009001205001",
		"parentid": "310112090000"
	},
	{
		"shortname": "郁宋村村委会",
		"id": "310112009001206001",
		"parentid": "310112090000"
	},
	{
		"shortname": "浦江村村委会",
		"id": "310112009001207001",
		"parentid": "310112090000"
	},
	{
		"shortname": "跃农村村委会",
		"id": "310112009001208001",
		"parentid": "310112090000"
	},
	{
		"shortname": "勤俭村村委会",
		"id": "310112009001209001",
		"parentid": "310112090000"
	},
	{
		"shortname": "塘口村村委会",
		"id": "310112009001210001",
		"parentid": "310112090000"
	},
	{
		"shortname": "亭子村村委会",
		"id": "310112009001214002",
		"parentid": "310112090000"
	},
	{
		"shortname": "浦江坤庭居委（筹）",
		"id": "310112009001818001",
		"parentid": "310112090000"
	},
	{
		"shortname": "浦恒馨苑居委（筹）",
		"id": "310112009001819001",
		"parentid": "310112090000"
	}, {
		"shortname": "东街居委会",
		"id": "310112101001001001",
		"parentid": "310112101000"
	},
	{
		"shortname": "西街居委会",
		"id": "310112101001003001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘松一村居委会",
		"id": "310112101001005001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘松三村居委会",
		"id": "310112101001007001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘松四村居委会",
		"id": "310112101001009001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘松五村居委会",
		"id": "310112101001010001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘松九村居委会",
		"id": "310112101001014001",
		"parentid": "310112101000"
	},
	{
		"shortname": "绿梅一村居委会",
		"id": "310112101001015001",
		"parentid": "310112101000"
	},
	{
		"shortname": "绿梅二村居委会",
		"id": "310112101001016001",
		"parentid": "310112101000"
	},
	{
		"shortname": "绿梅三村居委会",
		"id": "310112101001018001",
		"parentid": "310112101000"
	},
	{
		"shortname": "水清一村居委会",
		"id": "310112101001020001",
		"parentid": "310112101000"
	},
	{
		"shortname": "水清三村居委会",
		"id": "310112101001021001",
		"parentid": "310112101000"
	},
	{
		"shortname": "报春新村第一居委会",
		"id": "310112101001022001",
		"parentid": "310112101000"
	},
	{
		"shortname": "报春新村第二居委会",
		"id": "310112101001023001",
		"parentid": "310112101000"
	},
	{
		"shortname": "佳佳花园居委会",
		"id": "310112101001024001",
		"parentid": "310112101000"
	},
	{
		"shortname": "黎安新村第一居委会",
		"id": "310112101001025001",
		"parentid": "310112101000"
	},
	{
		"shortname": "黎安新村第二居委会",
		"id": "310112101001026001",
		"parentid": "310112101000"
	},
	{
		"shortname": "西湖苑居委会",
		"id": "310112101001030001",
		"parentid": "310112101000"
	},
	{
		"shortname": "沁春园第二居委会",
		"id": "310112101001031001",
		"parentid": "310112101000"
	},
	{
		"shortname": "新梅花苑居委会",
		"id": "310112101001032001",
		"parentid": "310112101000"
	},
	{
		"shortname": "绿世界花园居委会",
		"id": "310112101001033001",
		"parentid": "310112101000"
	},
	{
		"shortname": "星丰苑居委会",
		"id": "310112101001034001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘南花苑居委会",
		"id": "310112101001036001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘城公寓居委会",
		"id": "310112101001037001",
		"parentid": "310112101000"
	},
	{
		"shortname": "团结花苑居委会",
		"id": "310112101001038001",
		"parentid": "310112101000"
	},
	{
		"shortname": "宝安新苑居委会",
		"id": "310112101001039001",
		"parentid": "310112101000"
	},
	{
		"shortname": "新申花城居委会",
		"id": "310112101001040001",
		"parentid": "310112101000"
	},
	{
		"shortname": "众众家园居委会",
		"id": "310112101001042001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘城苑居委会",
		"id": "310112101001044001",
		"parentid": "310112101000"
	},
	{
		"shortname": "丽华公寓居委会",
		"id": "310112101001045001",
		"parentid": "310112101000"
	},
	{
		"shortname": "圣淘沙花园居委会",
		"id": "310112101001046001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘纪苑居委会",
		"id": "310112101001047001",
		"parentid": "310112101000"
	},
	{
		"shortname": "新梅广场居委会",
		"id": "310112101001048001",
		"parentid": "310112101000"
	},
	{
		"shortname": "虹莘新村居委会",
		"id": "310112101001049001",
		"parentid": "310112101000"
	},
	{
		"shortname": "春申新村居委会",
		"id": "310112101001050001",
		"parentid": "310112101000"
	},
	{
		"shortname": "香树丽舍居委会",
		"id": "310112101001051001",
		"parentid": "310112101000"
	},
	{
		"shortname": "沁春园第一居委会",
		"id": "310112101001052001",
		"parentid": "310112101000"
	},
	{
		"shortname": "西环新村居委会",
		"id": "310112101001053001",
		"parentid": "310112101000"
	},
	{
		"shortname": "世纪名门居委会",
		"id": "310112101001054001",
		"parentid": "310112101000"
	},
	{
		"shortname": "名都新城居委会",
		"id": "310112101001056001",
		"parentid": "310112101000"
	},
	{
		"shortname": "阳明花苑居委会",
		"id": "310112101001057001",
		"parentid": "310112101000"
	},
	{
		"shortname": "康城第一居委会",
		"id": "310112101001059001",
		"parentid": "310112101000"
	},
	{
		"shortname": "世纪阳光苑居委会",
		"id": "310112101001060001",
		"parentid": "310112101000"
	},
	{
		"shortname": "春申复地城居委会",
		"id": "310112101001061001",
		"parentid": "310112101000"
	},
	{
		"shortname": "春申万科城居委会",
		"id": "310112101001062001",
		"parentid": "310112101000"
	},
	{
		"shortname": "东苑新天地居委会",
		"id": "310112101001063001",
		"parentid": "310112101000"
	},
	{
		"shortname": "东苑利华苑居委会",
		"id": "310112101001064001",
		"parentid": "310112101000"
	},
	{
		"shortname": "沁春园第三居委会",
		"id": "310112101001065001",
		"parentid": "310112101000"
	},
	{
		"shortname": "都市星城居委会",
		"id": "310112101001066001",
		"parentid": "310112101000"
	},
	{
		"shortname": "上海康城第二居委会",
		"id": "310112101001067001",
		"parentid": "310112101000"
	},
	{
		"shortname": "邻里苑居委会",
		"id": "310112101001068001",
		"parentid": "310112101000"
	},
	{
		"shortname": "康城第三居委会",
		"id": "310112101001069001",
		"parentid": "310112101000"
	},
	{
		"shortname": "康城第四居委会",
		"id": "310112101001070001",
		"parentid": "310112101000"
	},
	{
		"shortname": "莘北村村委会",
		"id": "310112101001201001",
		"parentid": "310112101000"
	},
	{
		"shortname": "青春村村委会",
		"id": "310112101001203001",
		"parentid": "310112101000"
	}, {
		"shortname": "塘南居委会",
		"id": "310112102001001001",
		"parentid": "310112102000"
	},
	{
		"shortname": "塘北居委会",
		"id": "310112102001002001",
		"parentid": "310112102000"
	},
	{
		"shortname": "蒲汇新村居委会",
		"id": "310112102001004001",
		"parentid": "310112102000"
	},
	{
		"shortname": "佳宝新村第一居委会",
		"id": "310112102001006001",
		"parentid": "310112102000"
	},
	{
		"shortname": "三佳花苑居委会",
		"id": "310112102001007001",
		"parentid": "310112102000"
	},
	{
		"shortname": "园艺新村居委会",
		"id": "310112102001008001",
		"parentid": "310112102000"
	},
	{
		"shortname": "黎明花园居委会",
		"id": "310112102001009001",
		"parentid": "310112102000"
	},
	{
		"shortname": "宝仪新村居委会",
		"id": "310112102001011001",
		"parentid": "310112102000"
	},
	{
		"shortname": "茂盛新村居委会",
		"id": "310112102001012001",
		"parentid": "310112102000"
	},
	{
		"shortname": "万泰花园第一居委会",
		"id": "310112102001015001",
		"parentid": "310112102000"
	},
	{
		"shortname": "万科城市花园居委会",
		"id": "310112102001019001",
		"parentid": "310112102000"
	},
	{
		"shortname": "大上海国际花园居委会",
		"id": "310112102001020001",
		"parentid": "310112102000"
	},
	{
		"shortname": "东方花园居委会",
		"id": "310112102001027001",
		"parentid": "310112102000"
	},
	{
		"shortname": "富丽公寓居委会",
		"id": "310112102001029001",
		"parentid": "310112102000"
	},
	{
		"shortname": "红明新村居委会",
		"id": "310112102001030001",
		"parentid": "310112102000"
	},
	{
		"shortname": "京都苑居委会",
		"id": "310112102001031001",
		"parentid": "310112102000"
	},
	{
		"shortname": "万兆家园居委会",
		"id": "310112102001032001",
		"parentid": "310112102000"
	},
	{
		"shortname": "静安新城第一居委会",
		"id": "310112102001033001",
		"parentid": "310112102000"
	},
	{
		"shortname": "静安新城第二居委会",
		"id": "310112102001034001",
		"parentid": "310112102000"
	},
	{
		"shortname": "静安新城第三居委会",
		"id": "310112102001035001",
		"parentid": "310112102000"
	},
	{
		"shortname": "静安新城第四居委会",
		"id": "310112102001036001",
		"parentid": "310112102000"
	},
	{
		"shortname": "豪世盛地园居委会",
		"id": "310112102001038001",
		"parentid": "310112102000"
	},
	{
		"shortname": "万科城市花园第二居委会",
		"id": "310112102001039001",
		"parentid": "310112102000"
	},
	{
		"shortname": "莲浦府邸居委会",
		"id": "310112102001040001",
		"parentid": "310112102000"
	},
	{
		"shortname": "静安新城第六居委会",
		"id": "310112102001041001",
		"parentid": "310112102000"
	},
	{
		"shortname": "华林路第一居委会",
		"id": "310112102001042001",
		"parentid": "310112102000"
	},
	{
		"shortname": "华林路第二居委会",
		"id": "310112102001043001",
		"parentid": "310112102000"
	},
	{
		"shortname": "牡丹居委会",
		"id": "310112102001044001",
		"parentid": "310112102000"
	},
	{
		"shortname": "吴宝路第一居委会",
		"id": "310112102001045001",
		"parentid": "310112102000"
	},
	{
		"shortname": "吴宝路第二居委会",
		"id": "310112102001046001",
		"parentid": "310112102000"
	},
	{
		"shortname": "皇都花园居委会",
		"id": "310112102001047001",
		"parentid": "310112102000"
	},
	{
		"shortname": "静安新城第五居委会",
		"id": "310112102001048001",
		"parentid": "310112102000"
	},
	{
		"shortname": "中春路居委会",
		"id": "310112102001049001",
		"parentid": "310112102000"
	},
	{
		"shortname": "漕宝路居委会",
		"id": "310112102001050001",
		"parentid": "310112102000"
	},
	{
		"shortname": "漕宝路第二居委会",
		"id": "310112102001051001",
		"parentid": "310112102000"
	},
	{
		"shortname": "华林路第四居委会",
		"id": "310112102001052001",
		"parentid": "310112102000"
	},
	{
		"shortname": "华林路第三居委会",
		"id": "310112102001053001",
		"parentid": "310112102000"
	},
	{
		"shortname": "万科城市花园第三居委会",
		"id": "310112102001054001",
		"parentid": "310112102000"
	},
	{
		"shortname": "东方花园第二居委会",
		"id": "310112102001055001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华一村第一居委会",
		"id": "310112102001056001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华一村第三居委会",
		"id": "310112102001057001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华一村第四居委会",
		"id": "310112102001058001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华二村第一居委会",
		"id": "310112102001059001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华二村第三居委会",
		"id": "310112102001060001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华二村第四居委会",
		"id": "310112102001061001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华三村第一居委会",
		"id": "310112102001062001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华四村第一居委会",
		"id": "310112102001063001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华四村第二居委会",
		"id": "310112102001064001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华四村第三居委会",
		"id": "310112102001065001",
		"parentid": "310112102000"
	},
	{
		"shortname": "航华四村第四居委会",
		"id": "310112102001066001",
		"parentid": "310112102000"
	},
	{
		"shortname": "中春路第三居委会",
		"id": "310112102001067001",
		"parentid": "310112102000"
	},
	{
		"shortname": "吴宝路第三居委会",
		"id": "310112102001068001",
		"parentid": "310112102000"
	},
	{
		"shortname": "中春路第二居委会",
		"id": "310112102001069001",
		"parentid": "310112102000"
	},
	{
		"shortname": "七韵美地苑居委会",
		"id": "310112102001070001",
		"parentid": "310112102000"
	},
	{
		"shortname": "万科第四居委会",
		"id": "310112102001071002",
		"parentid": "310112102000"
	},
	{
		"shortname": "漕宝路第三居委会",
		"id": "310112102001072001",
		"parentid": "310112102000"
	},
	{
		"shortname": "沪星村村委会",
		"id": "310112102001201001",
		"parentid": "310112102000"
	},
	{
		"shortname": "七宝村村委会",
		"id": "310112102001202001",
		"parentid": "310112102000"
	},
	{
		"shortname": "九星村村委会",
		"id": "310112102001203001",
		"parentid": "310112102000"
	},
	{
		"shortname": "联明村村委会",
		"id": "310112102001204001",
		"parentid": "310112102000"
	},
	{
		"shortname": "红明村村委会",
		"id": "310112102001205001",
		"parentid": "310112102000"
	},
	{
		"shortname": "中华村村委会",
		"id": "310112102001206001",
		"parentid": "310112102000"
	},
	{
		"shortname": "友谊村村委会",
		"id": "310112102001207001",
		"parentid": "310112102000"
	}, {
		"shortname": "秀龙居委会",
		"id": "310112103001001001",
		"parentid": "310112103000"
	},
	{
		"shortname": "众安居委会",
		"id": "310112103001002001",
		"parentid": "310112103000"
	},
	{
		"shortname": "颛溪新村第五居委会",
		"id": "310112103001003001",
		"parentid": "310112103000"
	},
	{
		"shortname": "颛溪新村第八居委会",
		"id": "310112103001004001",
		"parentid": "310112103000"
	},
	{
		"shortname": "银都苑第一居委会",
		"id": "310112103001005001",
		"parentid": "310112103000"
	},
	{
		"shortname": "银都苑第三居委会",
		"id": "310112103001006001",
		"parentid": "310112103000"
	},
	{
		"shortname": "金都新村第三居委会",
		"id": "310112103001007001",
		"parentid": "310112103000"
	},
	{
		"shortname": "兴银花园居委会",
		"id": "310112103001008001",
		"parentid": "310112103000"
	},
	{
		"shortname": "北桥居委会",
		"id": "310112103001009001",
		"parentid": "310112103000"
	},
	{
		"shortname": "银桥花园居委会",
		"id": "310112103001011001",
		"parentid": "310112103000"
	},
	{
		"shortname": "樱缘花园居委会",
		"id": "310112103001012001",
		"parentid": "310112103000"
	},
	{
		"shortname": "银春花园居委会",
		"id": "310112103001013001",
		"parentid": "310112103000"
	},
	{
		"shortname": "好世凤凰城居委会",
		"id": "310112103001014001",
		"parentid": "310112103000"
	},
	{
		"shortname": "莘闵荣顺苑居委会",
		"id": "310112103001015001",
		"parentid": "310112103000"
	},
	{
		"shortname": "繁盛苑居委会",
		"id": "310112103001016001",
		"parentid": "310112103000"
	},
	{
		"shortname": "君临花园居委会",
		"id": "310112103001017001",
		"parentid": "310112103000"
	},
	{
		"shortname": "众众新家园居委会",
		"id": "310112103001018001",
		"parentid": "310112103000"
	},
	{
		"shortname": "日月华城居委会",
		"id": "310112103001019001",
		"parentid": "310112103000"
	},
	{
		"shortname": "复地北桥城居委会",
		"id": "310112103001020001",
		"parentid": "310112103000"
	},
	{
		"shortname": "君莲新城第二居委会",
		"id": "310112103001021001",
		"parentid": "310112103000"
	},
	{
		"shortname": "君莲新城第一居委会",
		"id": "310112103001022001",
		"parentid": "310112103000"
	},
	{
		"shortname": "骏苑居委会",
		"id": "310112103001023001",
		"parentid": "310112103000"
	},
	{
		"shortname": "君莲新城第三居委会",
		"id": "310112103001024001",
		"parentid": "310112103000"
	},
	{
		"shortname": "翔泰苑居委会",
		"id": "310112103001025001",
		"parentid": "310112103000"
	},
	{
		"shortname": "金榜新苑居委会",
		"id": "310112103001026001",
		"parentid": "310112103000"
	},
	{
		"shortname": "都市富苑居委会",
		"id": "310112103001027001",
		"parentid": "310112103000"
	},
	{
		"shortname": "招商雍华苑居委会",
		"id": "310112103001028001",
		"parentid": "310112103000"
	},
	{
		"shortname": "君莲新城第四居委会",
		"id": "310112103001029001",
		"parentid": "310112103000"
	},
	{
		"shortname": "文博水景居委会",
		"id": "310112103001030001",
		"parentid": "310112103000"
	},
	{
		"shortname": "集体村村委会",
		"id": "310112103001201002",
		"parentid": "310112103000"
	},
	{
		"shortname": "颛桥村村委会",
		"id": "310112103001202001",
		"parentid": "310112103000"
	},
	{
		"shortname": "向阳村村委会",
		"id": "310112103001203001",
		"parentid": "310112103000"
	},
	{
		"shortname": "中沟村村委会",
		"id": "310112103001205001",
		"parentid": "310112103000"
	},
	{
		"shortname": "中心村村委会",
		"id": "310112103001207001",
		"parentid": "310112103000"
	},
	{
		"shortname": "北桥村村委会",
		"id": "310112103001210001",
		"parentid": "310112103000"
	},
	{
		"shortname": "安乐村村委会",
		"id": "310112103001211001",
		"parentid": "310112103000"
	},
	{
		"shortname": "灯塔村村委会",
		"id": "310112103001212001",
		"parentid": "310112103000"
	},
	{
		"shortname": "光明村村委会",
		"id": "310112103001215001",
		"parentid": "310112103000"
	},
	{
		"shortname": "君莲新城第五居委会（筹）",
		"id": "310112103001816002",
		"parentid": "310112103000"
	}, {
		"shortname": "华漕第二居委会",
		"id": "310112106001002001",
		"parentid": "310112106000"
	},
	{
		"shortname": "紫薇新村居委会",
		"id": "310112106001004001",
		"parentid": "310112106000"
	},
	{
		"shortname": "诸新路居委会",
		"id": "310112106001005001",
		"parentid": "310112106000"
	},
	{
		"shortname": "诸翟居委会",
		"id": "310112106001006001",
		"parentid": "310112106000"
	},
	{
		"shortname": "金丰城第一居委会",
		"id": "310112106001007001",
		"parentid": "310112106000"
	},
	{
		"shortname": "纪王居委会",
		"id": "310112106001008001",
		"parentid": "310112106000"
	},
	{
		"shortname": "银杏新村居委会",
		"id": "310112106001009001",
		"parentid": "310112106000"
	},
	{
		"shortname": "美邻苑居委会",
		"id": "310112106001010001",
		"parentid": "310112106000"
	},
	{
		"shortname": "南华路居委会",
		"id": "310112106001011001",
		"parentid": "310112106000"
	},
	{
		"shortname": "九韵城居委会",
		"id": "310112106001013001",
		"parentid": "310112106000"
	},
	{
		"shortname": "西郊城第一居委会",
		"id": "310112106001014001",
		"parentid": "310112106000"
	},
	{
		"shortname": "西郊虹韵城居委会",
		"id": "310112106001015002",
		"parentid": "310112106000"
	},
	{
		"shortname": "爱博六村居委会",
		"id": "310112106001017001",
		"parentid": "310112106000"
	},
	{
		"shortname": "华漕村村委会",
		"id": "310112106001206001",
		"parentid": "310112106000"
	},
	{
		"shortname": "许浦村村委会",
		"id": "310112106001207001",
		"parentid": "310112106000"
	},
	{
		"shortname": "王泥浜村村委会",
		"id": "310112106001208001",
		"parentid": "310112106000"
	},
	{
		"shortname": "卫星村村委会",
		"id": "310112106001212001",
		"parentid": "310112106000"
	},
	{
		"shortname": "赵家村村委会",
		"id": "310112106001213001",
		"parentid": "310112106000"
	},
	{
		"shortname": "诸翟村村委会",
		"id": "310112106001214001",
		"parentid": "310112106000"
	},
	{
		"shortname": "杨家巷村村委会",
		"id": "310112106001215001",
		"parentid": "310112106000"
	},
	{
		"shortname": "朱家泾村村委会",
		"id": "310112106001216001",
		"parentid": "310112106000"
	},
	{
		"shortname": "肖王庙村村委会",
		"id": "310112106001218001",
		"parentid": "310112106000"
	},
	{
		"shortname": "纪王村村委会",
		"id": "310112106001219001",
		"parentid": "310112106000"
	},
	{
		"shortname": "红卫村村委会",
		"id": "310112106001220001",
		"parentid": "310112106000"
	},
	{
		"shortname": "鹫山村村委会",
		"id": "310112106001221001",
		"parentid": "310112106000"
	},
	{
		"shortname": "纪东村村委会",
		"id": "310112106001222001",
		"parentid": "310112106000"
	},
	{
		"shortname": "纪西村村委会",
		"id": "310112106001223001",
		"parentid": "310112106000"
	},
	{
		"shortname": "陈家角村村委会",
		"id": "310112106001225001",
		"parentid": "310112106000"
	},
	{
		"shortname": "石皮弄村村委会",
		"id": "310112106001226001",
		"parentid": "310112106000"
	}, {
		"shortname": "虹桥居委会",
		"id": "310112107001001001",
		"parentid": "310112107000"
	},
	{
		"shortname": "河南居委会",
		"id": "310112107001002001",
		"parentid": "310112107000"
	},
	{
		"shortname": "河西居委会",
		"id": "310112107001003001",
		"parentid": "310112107000"
	},
	{
		"shortname": "虹鹿居委会",
		"id": "310112107001004001",
		"parentid": "310112107000"
	},
	{
		"shortname": "红春公寓居委会",
		"id": "310112107001005001",
		"parentid": "310112107000"
	},
	{
		"shortname": "上虹新村居委会",
		"id": "310112107001006001",
		"parentid": "310112107000"
	},
	{
		"shortname": "华光花园居委会",
		"id": "310112107001007001",
		"parentid": "310112107000"
	},
	{
		"shortname": "古北新城居委会",
		"id": "310112107001008001",
		"parentid": "310112107000"
	},
	{
		"shortname": "海申花园居委会",
		"id": "310112107001009001",
		"parentid": "310112107000"
	},
	{
		"shortname": "振宏公寓居委会",
		"id": "310112107001010001",
		"parentid": "310112107000"
	},
	{
		"shortname": "锦华公寓居委会",
		"id": "310112107001011001",
		"parentid": "310112107000"
	},
	{
		"shortname": "金虹大厦居委会",
		"id": "310112107001012001",
		"parentid": "310112107000"
	},
	{
		"shortname": "虹华苑居委会",
		"id": "310112107001013001",
		"parentid": "310112107000"
	},
	{
		"shortname": "金斯花园居委会",
		"id": "310112107001014001",
		"parentid": "310112107000"
	},
	{
		"shortname": "锦绣江南家园居委会",
		"id": "310112107001015001",
		"parentid": "310112107000"
	},
	{
		"shortname": "虹桥花苑居委会",
		"id": "310112107001016001",
		"parentid": "310112107000"
	},
	{
		"shortname": "井亭苑居委会",
		"id": "310112107001017001",
		"parentid": "310112107000"
	},
	{
		"shortname": "古北虹苑居委会",
		"id": "310112107001018001",
		"parentid": "310112107000"
	},
	{
		"shortname": "名都城居委会",
		"id": "310112107001019001",
		"parentid": "310112107000"
	},
	{
		"shortname": "万源新城居委会",
		"id": "310112107001020001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏一村第一居委会",
		"id": "310112107001021001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏一村第二居委会",
		"id": "310112107001022001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏二村居委会",
		"id": "310112107001023001",
		"parentid": "310112107000"
	},
	{
		"shortname": "兰竹居委会",
		"id": "310112107001024001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏三村居委会",
		"id": "310112107001025001",
		"parentid": "310112107000"
	},
	{
		"shortname": "先锋公寓居委会",
		"id": "310112107001026001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏四村居委会",
		"id": "310112107001027001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏五村居委会",
		"id": "310112107001029001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏六村居委会",
		"id": "310112107001031001",
		"parentid": "310112107000"
	},
	{
		"shortname": "龙柏七村居委会",
		"id": "310112107001032001",
		"parentid": "310112107000"
	},
	{
		"shortname": "金汇华光城居委会",
		"id": "310112107001033001",
		"parentid": "310112107000"
	},
	{
		"shortname": "金汇花园居委会",
		"id": "310112107001035001",
		"parentid": "310112107000"
	},
	{
		"shortname": "西郊居委会",
		"id": "310112107001037001",
		"parentid": "310112107000"
	}, {
		"shortname": "梅陇第一居委会",
		"id": "310112108001001001",
		"parentid": "310112108000"
	},
	{
		"shortname": "梅陇第二居委会",
		"id": "310112108001002001",
		"parentid": "310112108000"
	},
	{
		"shortname": "梅陇第三居委会",
		"id": "310112108001003001",
		"parentid": "310112108000"
	},
	{
		"shortname": "梅陇第四居委会",
		"id": "310112108001004001",
		"parentid": "310112108000"
	},
	{
		"shortname": "梅陇第五居委会",
		"id": "310112108001005001",
		"parentid": "310112108000"
	},
	{
		"shortname": "梅陇第六居委会",
		"id": "310112108001006001",
		"parentid": "310112108000"
	},
	{
		"shortname": "梅陇第七居委会",
		"id": "310112108001007001",
		"parentid": "310112108000"
	},
	{
		"shortname": "朱行第一居委会",
		"id": "310112108001008001",
		"parentid": "310112108000"
	},
	{
		"shortname": "朱行第二居委会",
		"id": "310112108001009001",
		"parentid": "310112108000"
	},
	{
		"shortname": "南方新村第一居委会",
		"id": "310112108001011001",
		"parentid": "310112108000"
	},
	{
		"shortname": "南方新村第二居委会",
		"id": "310112108001012001",
		"parentid": "310112108000"
	},
	{
		"shortname": "南方新村第三居委会",
		"id": "310112108001013001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第一居委会",
		"id": "310112108001014001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第二居委会",
		"id": "310112108001015001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第四居委会",
		"id": "310112108001016001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第五居委会",
		"id": "310112108001017001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第六居委会",
		"id": "310112108001018001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第七居委会",
		"id": "310112108001019001",
		"parentid": "310112108000"
	},
	{
		"shortname": "普乐新村第一居委会",
		"id": "310112108001020001",
		"parentid": "310112108000"
	},
	{
		"shortname": "普乐新村第二居委会",
		"id": "310112108001021001",
		"parentid": "310112108000"
	},
	{
		"shortname": "上陇新村居委会",
		"id": "310112108001022001",
		"parentid": "310112108000"
	},
	{
		"shortname": "鸿福新村居委会",
		"id": "310112108001023001",
		"parentid": "310112108000"
	},
	{
		"shortname": "莲花新村居委会",
		"id": "310112108001024001",
		"parentid": "310112108000"
	},
	{
		"shortname": "莲花公寓居委会",
		"id": "310112108001025001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗秀苑居委会",
		"id": "310112108001026001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗锦苑居委会",
		"id": "310112108001027001",
		"parentid": "310112108000"
	},
	{
		"shortname": "蔷薇新村第一居委会",
		"id": "310112108001028001",
		"parentid": "310112108000"
	},
	{
		"shortname": "蔷薇新村第二居委会",
		"id": "310112108001029001",
		"parentid": "310112108000"
	},
	{
		"shortname": "蔷薇新村第三居委会",
		"id": "310112108001030001",
		"parentid": "310112108000"
	},
	{
		"shortname": "未名园居委会",
		"id": "310112108001031001",
		"parentid": "310112108000"
	},
	{
		"shortname": "曹行居委会",
		"id": "310112108001032001",
		"parentid": "310112108000"
	},
	{
		"shortname": "华唐苑居委会",
		"id": "310112108001033001",
		"parentid": "310112108000"
	},
	{
		"shortname": "虹景苑居委会",
		"id": "310112108001034001",
		"parentid": "310112108000"
	},
	{
		"shortname": "源梦苑居委会",
		"id": "310112108001035001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第三居委会",
		"id": "310112108001036001",
		"parentid": "310112108000"
	},
	{
		"shortname": "望族苑居委会",
		"id": "310112108001037001",
		"parentid": "310112108000"
	},
	{
		"shortname": "嘉和花苑居委会",
		"id": "310112108001038001",
		"parentid": "310112108000"
	},
	{
		"shortname": "高兴花园第一居委会",
		"id": "310112108001039001",
		"parentid": "310112108000"
	},
	{
		"shortname": "高兴花园第二居委会",
		"id": "310112108001040001",
		"parentid": "310112108000"
	},
	{
		"shortname": "高兴花园第三居委会",
		"id": "310112108001041001",
		"parentid": "310112108000"
	},
	{
		"shortname": "世纪苑居委会",
		"id": "310112108001042001",
		"parentid": "310112108000"
	},
	{
		"shortname": "上海欣苑居委会",
		"id": "310112108001043001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第八居委会",
		"id": "310112108001044001",
		"parentid": "310112108000"
	},
	{
		"shortname": "上海春城第一居委会",
		"id": "310112108001045001",
		"parentid": "310112108000"
	},
	{
		"shortname": "春申花园居委会",
		"id": "310112108001046001",
		"parentid": "310112108000"
	},
	{
		"shortname": "中梅苑居委会",
		"id": "310112108001047001",
		"parentid": "310112108000"
	},
	{
		"shortname": "望族新苑居委会",
		"id": "310112108001048001",
		"parentid": "310112108000"
	},
	{
		"shortname": "罗阳新村第九居委会",
		"id": "310112108001049001",
		"parentid": "310112108000"
	},
	{
		"shortname": "春申景城居委会",
		"id": "310112108001050001",
		"parentid": "310112108000"
	},
	{
		"shortname": "上海春城第二居委会",
		"id": "310112108001051001",
		"parentid": "310112108000"
	},
	{
		"shortname": "都市宜家园居委会",
		"id": "310112108001052001",
		"parentid": "310112108000"
	},
	{
		"shortname": "南方城居委会",
		"id": "310112108001053001",
		"parentid": "310112108000"
	},
	{
		"shortname": "银兆银都居委会",
		"id": "310112108001054001",
		"parentid": "310112108000"
	},
	{
		"shortname": "燕南麒麟居委会",
		"id": "310112108001055001",
		"parentid": "310112108000"
	},
	{
		"shortname": "银泰园居委会",
		"id": "310112108001056001",
		"parentid": "310112108000"
	},
	{
		"shortname": "银河新都居委会",
		"id": "310112108001057001",
		"parentid": "310112108000"
	},
	{
		"shortname": "金都路居委会",
		"id": "310112108001060001",
		"parentid": "310112108000"
	},
	{
		"shortname": "锦梅馨苑居委会",
		"id": "310112108001061001",
		"parentid": "310112108000"
	},
	{
		"shortname": "上海晶城第一居委会",
		"id": "310112108001062001",
		"parentid": "310112108000"
	},
	{
		"shortname": "上海晶城第二居委会",
		"id": "310112108001063001",
		"parentid": "310112108000"
	},
	{
		"shortname": "中海寰宇居委会",
		"id": "310112108001064001",
		"parentid": "310112108000"
	},
	{
		"shortname": "华一村村委会",
		"id": "310112108001202001",
		"parentid": "310112108000"
	},
	{
		"shortname": "张慕村村委会",
		"id": "310112108001205001",
		"parentid": "310112108000"
	},
	{
		"shortname": "行西村村委会",
		"id": "310112108001206001",
		"parentid": "310112108000"
	},
	{
		"shortname": "集心村村委会",
		"id": "310112108001207001",
		"parentid": "310112108000"
	},
	{
		"shortname": "行南村村委会",
		"id": "310112108001208001",
		"parentid": "310112108000"
	},
	{
		"shortname": "曙建村村委会",
		"id": "310112108001211001",
		"parentid": "310112108000"
	},
	{
		"shortname": "五一村村委会",
		"id": "310112108001212001",
		"parentid": "310112108000"
	},
	{
		"shortname": "永联村村委会",
		"id": "310112108001213001",
		"parentid": "310112108000"
	},
	{
		"shortname": "民建村村委会",
		"id": "310112108001214001",
		"parentid": "310112108000"
	},
	{
		"shortname": "车沟村村委会",
		"id": "310112108001215001",
		"parentid": "310112108000"
	},
	{
		"shortname": "双溪村村委会",
		"id": "310112108001216001",
		"parentid": "310112108000"
	},
	{
		"shortname": "爱国村村委会",
		"id": "310112108001217001",
		"parentid": "310112108000"
	},
	{
		"shortname": "许泾村村委会",
		"id": "310112108001218001",
		"parentid": "310112108000"
	},
	{
		"shortname": "曹行村村委会",
		"id": "310112108001219001",
		"parentid": "310112108000"
	},
	{
		"shortname": "曹中村村委会",
		"id": "310112108001220001",
		"parentid": "310112108000"
	},
	{
		"shortname": "陇西村村委会（筹）",
		"id": "310112108001801002",
		"parentid": "310112108000"
	},
	{
		"shortname": "锦乐馨苑居委会（筹）",
		"id": "310112108001822002",
		"parentid": "310112108000"
	},
	{
		"shortname": "上海晶城第三居委会（筹）",
		"id": "310112108001823002",
		"parentid": "310112108000"
	},
	{
		"shortname": "吴泾新村居委会",
		"id": "310112110001001001",
		"parentid": "310112110000"
	},
	{
		"shortname": "双柏新村居委会",
		"id": "310112110001014001",
		"parentid": "310112110000"
	},
	{
		"shortname": "氯碱新村居委会",
		"id": "310112110001015001",
		"parentid": "310112110000"
	},
	{
		"shortname": "通海新村居委会",
		"id": "310112110001016001",
		"parentid": "310112110000"
	},
	{
		"shortname": "永南新村居委会",
		"id": "310112110001017001",
		"parentid": "310112110000"
	},
	{
		"shortname": "永北新村居委会",
		"id": "310112110001018001",
		"parentid": "310112110000"
	},
	{
		"shortname": "新华新村居委会",
		"id": "310112110001019001",
		"parentid": "310112110000"
	},
	{
		"shortname": "宝秀路居委会",
		"id": "310112110001020001",
		"parentid": "310112110000"
	},
	{
		"shortname": "紫晶南园居委会",
		"id": "310112110001021001",
		"parentid": "310112110000"
	},
	{
		"shortname": "枫桦景苑居委会",
		"id": "310112110001022001",
		"parentid": "310112110000"
	},
	{
		"shortname": "万科阳光苑居委会",
		"id": "310112110001025001",
		"parentid": "310112110000"
	},
	{
		"shortname": "虹梅新苑第一居委会",
		"id": "310112110001026001",
		"parentid": "310112110000"
	},
	{
		"shortname": "虹梅新苑第二居委会",
		"id": "310112110001027001",
		"parentid": "310112110000"
	},
	{
		"shortname": "虹梅景苑第一居委会",
		"id": "310112110001028001",
		"parentid": "310112110000"
	},
	{
		"shortname": "虹梅景苑第二居委会",
		"id": "310112110001029001",
		"parentid": "310112110000"
	},
	{
		"shortname": "嘉怡水岸居委会",
		"id": "310112110001030001",
		"parentid": "310112110000"
	},
	{
		"shortname": "塘泾南苑居委会",
		"id": "310112110001031001",
		"parentid": "310112110000"
	},
	{
		"shortname": "幸福村村委会",
		"id": "310112110001201001",
		"parentid": "310112110000"
	},
	{
		"shortname": "英武村村委会",
		"id": "310112110001202001",
		"parentid": "310112110000"
	},
	{
		"shortname": "星火村村委会",
		"id": "310112110001204001",
		"parentid": "310112110000"
	},
	{
		"shortname": "友爱村村委会",
		"id": "310112110001205001",
		"parentid": "310112110000"
	},
	{
		"shortname": "共和村村委会",
		"id": "310112110001206001",
		"parentid": "310112110000"
	},
	{
		"shortname": "和平村村委会",
		"id": "310112110001207001",
		"parentid": "310112110000"
	},
	{
		"shortname": "新建村村委会",
		"id": "310112110001211001",
		"parentid": "310112110000"
	},
	{
		"shortname": "塘湾村村委会",
		"id": "310112110001212001",
		"parentid": "310112110000"
	},
	{
		"shortname": "塘泾北苑居委（筹）",
		"id": "310112110001813001",
		"parentid": "310112110000"
	},
	{
		"shortname": "紫竹半岛居委会（筹）",
		"id": "310112110001814001",
		"parentid": "310112110000"
	}, {
		"shortname": "马桥居委会",
		"id": "310112112001001001",
		"parentid": "310112112000"
	},
	{
		"shortname": "华银坊居委会",
		"id": "310112112001002001",
		"parentid": "310112112000"
	},
	{
		"shortname": "飞碟苑居委会",
		"id": "310112112001003001",
		"parentid": "310112112000"
	},
	{
		"shortname": "元吉新村居委会",
		"id": "310112112001004001",
		"parentid": "310112112000"
	},
	{
		"shortname": "元祥新村居委会",
		"id": "310112112001005001",
		"parentid": "310112112000"
	},
	{
		"shortname": "夏朵园居委会",
		"id": "310112112001006001",
		"parentid": "310112112000"
	},
	{
		"shortname": "敬南路居委会",
		"id": "310112112001007001",
		"parentid": "310112112000"
	},
	{
		"shortname": "茜昆路居委会",
		"id": "310112112001008001",
		"parentid": "310112112000"
	},
	{
		"shortname": "景城乐康苑居委会",
		"id": "310112112001009001",
		"parentid": "310112112000"
	},
	{
		"shortname": "景城银春苑居委会",
		"id": "310112112001010001",
		"parentid": "310112112000"
	},
	{
		"shortname": "景城保利佳苑居委会",
		"id": "310112112001011001",
		"parentid": "310112112000"
	},
	{
		"shortname": "景城保利雅苑居委会",
		"id": "310112112001012001",
		"parentid": "310112112000"
	},
	{
		"shortname": "景城馨苑居委会",
		"id": "310112112001013001",
		"parentid": "310112112000"
	},
	{
		"shortname": "景城品雅苑居委会",
		"id": "310112112001014001",
		"parentid": "310112112000"
	},
	{
		"shortname": "望海村村委会",
		"id": "310112112001203001",
		"parentid": "310112112000"
	},
	{
		"shortname": "俞塘村村委会",
		"id": "310112112001205001",
		"parentid": "310112112000"
	},
	{
		"shortname": "工农村村委会",
		"id": "310112112001206001",
		"parentid": "310112112000"
	},
	{
		"shortname": "旗忠村村委会",
		"id": "310112112001208001",
		"parentid": "310112112000"
	},
	{
		"shortname": "同心村村委会",
		"id": "310112112001209001",
		"parentid": "310112112000"
	},
	{
		"shortname": "民主村村委会",
		"id": "310112112001212001",
		"parentid": "310112112000"
	},
	{
		"shortname": "吴会村村委会",
		"id": "310112112001213001",
		"parentid": "310112112000"
	},
	{
		"shortname": "金星村村委会",
		"id": "310112112001214001",
		"parentid": "310112112000"
	},
	{
		"shortname": "彭渡村村委会",
		"id": "310112112001215001",
		"parentid": "310112112000"
	},
	{
		"shortname": "旭丽花园居委会（筹）",
		"id": "310112112001824001",
		"parentid": "310112112000"
	},
	{
		"shortname": "银康苑居委会(筹)",
		"id": "310112112001825001",
		"parentid": "310112112000"
	},
	{
		"shortname": "四季悦园居委会（筹）",
		"id": "310112112001826001",
		"parentid": "310112112000"
	},
	{
		"shortname": "景城和苑居委会（筹）",
		"id": "310112112001827001",
		"parentid": "310112112000"
	}, {
		"shortname": "杜行居委会",
		"id": "310112114001002001",
		"parentid": "310112114000"
	},
	{
		"shortname": "鲁汇居委会",
		"id": "310112114001003001",
		"parentid": "310112114000"
	},
	{
		"shortname": "闵浦第三居委会",
		"id": "310112114001017001",
		"parentid": "310112114000"
	},
	{
		"shortname": "闵浦新苑第二居委会",
		"id": "310112114001019001",
		"parentid": "310112114000"
	},
	{
		"shortname": "新汇绿苑居委会",
		"id": "310112114001020001",
		"parentid": "310112114000"
	},
	{
		"shortname": "宝邸第一居委会",
		"id": "310112114001022001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦航新城第二居委会",
		"id": "310112114001023001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦航新城第三居委会",
		"id": "310112114001024001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦航新城第四居委会",
		"id": "310112114001025001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦航新城第五居委会",
		"id": "310112114001026001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦航新城第六居委会",
		"id": "310112114001027001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦航第七居委会",
		"id": "310112114001028001",
		"parentid": "310112114000"
	},
	{
		"shortname": "智汇园居委会",
		"id": "310112114001029001",
		"parentid": "310112114000"
	},
	{
		"shortname": "欣佳宝邸居委会",
		"id": "310112114001030001",
		"parentid": "310112114000"
	},
	{
		"shortname": "闵浦第一居委会",
		"id": "310112114001031001",
		"parentid": "310112114000"
	},
	{
		"shortname": "红梅苑居委会",
		"id": "310112114001033001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦润苑居委会",
		"id": "310112114001034001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦江馨都居委会",
		"id": "310112114001035001",
		"parentid": "310112114000"
	},
	{
		"shortname": "瑞和华苑居委会",
		"id": "310112114001036001",
		"parentid": "310112114000"
	},
	{
		"shortname": "汇秀景苑居委会",
		"id": "310112114001037001",
		"parentid": "310112114000"
	},
	{
		"shortname": "聚缘居委会",
		"id": "310112114001038001",
		"parentid": "310112114000"
	},
	{
		"shortname": "中虹浦江苑居委会",
		"id": "310112114001039001",
		"parentid": "310112114000"
	},
	{
		"shortname": "瑞和城第三居委会",
		"id": "310112114001040001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第一居委会",
		"id": "310112114001044001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第七居委会",
		"id": "310112114001045001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第八居委会",
		"id": "310112114001046001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第九居委会",
		"id": "310112114001047001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦江瑞和城第五居委会",
		"id": "310112114001048002",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦江宝邸第二居委会",
		"id": "310112114001051001",
		"parentid": "310112114000"
	},
	{
		"shortname": "浦航新城第八居委会",
		"id": "310112114001052001",
		"parentid": "310112114000"
	},
	{
		"shortname": "立民村村委会",
		"id": "310112114001201001",
		"parentid": "310112114000"
	},
	{
		"shortname": "勤劳村村委会",
		"id": "310112114001203001",
		"parentid": "310112114000"
	},
	{
		"shortname": "知新村村委会",
		"id": "310112114001205001",
		"parentid": "310112114000"
	},
	{
		"shortname": "东风村村委会",
		"id": "310112114001210001",
		"parentid": "310112114000"
	},
	{
		"shortname": "建中村村委会",
		"id": "310112114001211001",
		"parentid": "310112114000"
	},
	{
		"shortname": "友建村村委会",
		"id": "310112114001212001",
		"parentid": "310112114000"
	},
	{
		"shortname": "苏民村村委会",
		"id": "310112114001217001",
		"parentid": "310112114000"
	},
	{
		"shortname": "联星村村委会",
		"id": "310112114001222001",
		"parentid": "310112114000"
	},
	{
		"shortname": "群益村村委会",
		"id": "310112114001223001",
		"parentid": "310112114000"
	},
	{
		"shortname": "联胜村村委会",
		"id": "310112114001224001",
		"parentid": "310112114000"
	},
	{
		"shortname": "万里村村委会",
		"id": "310112114001226001",
		"parentid": "310112114000"
	},
	{
		"shortname": "张行村村委会",
		"id": "310112114001227001",
		"parentid": "310112114000"
	},
	{
		"shortname": "联合村村委会",
		"id": "310112114001228001",
		"parentid": "310112114000"
	},
	{
		"shortname": "建东村村委会",
		"id": "310112114001231001",
		"parentid": "310112114000"
	},
	{
		"shortname": "镇北村村委会",
		"id": "310112114001232001",
		"parentid": "310112114000"
	},
	{
		"shortname": "胜利村村委会",
		"id": "310112114001233001",
		"parentid": "310112114000"
	},
	{
		"shortname": "杜行村村委会",
		"id": "310112114001234001",
		"parentid": "310112114000"
	},
	{
		"shortname": "建新村村委会",
		"id": "310112114001235001",
		"parentid": "310112114000"
	},
	{
		"shortname": "建岗村村委会",
		"id": "310112114001236001",
		"parentid": "310112114000"
	},
	{
		"shortname": "联民村村委会",
		"id": "310112114001239001",
		"parentid": "310112114000"
	},
	{
		"shortname": "跃进村村委会",
		"id": "310112114001240001",
		"parentid": "310112114000"
	},
	{
		"shortname": "革新村村委会",
		"id": "310112114001241001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永丰村村委会",
		"id": "310112114001242001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永建村村委会",
		"id": "310112114001243001",
		"parentid": "310112114000"
	},
	{
		"shortname": "先进村村委会",
		"id": "310112114001244001",
		"parentid": "310112114000"
	},
	{
		"shortname": "汇红村村委会",
		"id": "310112114001245001",
		"parentid": "310112114000"
	},
	{
		"shortname": "新风村村委会",
		"id": "310112114001246001",
		"parentid": "310112114000"
	},
	{
		"shortname": "光继村村委会",
		"id": "310112114001247001",
		"parentid": "310112114000"
	},
	{
		"shortname": "汇西村村委会",
		"id": "310112114001248001",
		"parentid": "310112114000"
	},
	{
		"shortname": "汇东村村委会",
		"id": "310112114001249001",
		"parentid": "310112114000"
	},
	{
		"shortname": "正义村村委会",
		"id": "310112114001251001",
		"parentid": "310112114000"
	},
	{
		"shortname": "汇北村村委会",
		"id": "310112114001252001",
		"parentid": "310112114000"
	},
	{
		"shortname": "北徐村村委会",
		"id": "310112114001253001",
		"parentid": "310112114000"
	},
	{
		"shortname": "汇南村村委会",
		"id": "310112114001254001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永新村村委会",
		"id": "310112114001255001",
		"parentid": "310112114000"
	},
	{
		"shortname": "汇中村村委会",
		"id": "310112114001256001",
		"parentid": "310112114000"
	},
	{
		"shortname": "瑞和城第六居委会（筹）",
		"id": "310112114001801002",
		"parentid": "310112114000"
	},
	{
		"shortname": "叶凌村村委会（托管）",
		"id": "310112114001829001",
		"parentid": "310112114000"
	},
	{
		"shortname": "恒星村村委会（托管）",
		"id": "310112114001830001",
		"parentid": "310112114000"
	},
	{
		"shortname": "为民村村委会（托管）",
		"id": "310112114001831001",
		"parentid": "310112114000"
	},
	{
		"shortname": "李巷村村委会（托管）",
		"id": "310112114001832001",
		"parentid": "310112114000"
	},
	{
		"shortname": "徐凌村村委会（托管）",
		"id": "310112114001833001",
		"parentid": "310112114000"
	},
	{
		"shortname": "康桥村村委会（托管）",
		"id": "310112114001834001",
		"parentid": "310112114000"
	},
	{
		"shortname": "亭子村村委会（托管）",
		"id": "310112114001835001",
		"parentid": "310112114000"
	},
	{
		"shortname": "瑞和城第二居委会（筹）",
		"id": "310112114001857001",
		"parentid": "310112114000"
	},
	{
		"shortname": "瑞和城第四居委会（筹）",
		"id": "310112114001858001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第二居委会（筹）",
		"id": "310112114001859001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第三居委会（筹）",
		"id": "310112114001860001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第四居委会（筹）",
		"id": "310112114001861001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第五居委会（筹）",
		"id": "310112114001862001",
		"parentid": "310112114000"
	},
	{
		"shortname": "永康城第六居委会（筹）",
		"id": "310112114001863001",
		"parentid": "310112114000"
	}, {
		"shortname": "申莘新村第一居委会",
		"id": "310112501001001001",
		"parentid": "310112501000"
	},
	{
		"shortname": "春辉新村居委会",
		"id": "310112501001002001",
		"parentid": "310112501000"
	},
	{
		"shortname": "申莘新村第二居委会",
		"id": "310112501001003001",
		"parentid": "310112501000"
	},
	{
		"shortname": "申莘新村第三居委会",
		"id": "310112501001004001",
		"parentid": "310112501000"
	},
	{
		"shortname": "新源路第一居委会",
		"id": "310112501001005001",
		"parentid": "310112501000"
	},
	{
		"shortname": "南郊别墅居委会",
		"id": "310112501001006001",
		"parentid": "310112501000"
	},
	{
		"shortname": "鑫峰苑居委会",
		"id": "310112501001007001",
		"parentid": "310112501000"
	},
	{
		"shortname": "正峰苑居委会",
		"id": "310112501001008001",
		"parentid": "310112501000"
	},
	{
		"shortname": "天恒名城居委会",
		"id": "310112501001009001",
		"parentid": "310112501000"
	},
	{
		"shortname": "瓶安路居委会",
		"id": "310112501001010001",
		"parentid": "310112501000"
	}, {
		"shortname": "宝钢一村居委会",
		"id": "310113003001001001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢二村居委会",
		"id": "310113003001002001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢三村居委会",
		"id": "310113003001003001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢四村居委会",
		"id": "310113003001004001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢五村居委会",
		"id": "310113003001005001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢六村居委会",
		"id": "310113003001006001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢七村居委会",
		"id": "310113003001007001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢八村居委会",
		"id": "310113003001008001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢九村居委会",
		"id": "310113003001009001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢十村居委会",
		"id": "310113003001010001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝钢十一村居委会",
		"id": "310113003001011001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林一村居委会",
		"id": "310113003001012001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林二村居委会",
		"id": "310113003001014001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林三村居委会",
		"id": "310113003001016001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林四村居委会",
		"id": "310113003001017001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林五村居委会",
		"id": "310113003001018001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林六村居委会",
		"id": "310113003001019001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林七村居委会",
		"id": "310113003001021001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林八村居委会",
		"id": "310113003001022001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝林九村居委会",
		"id": "310113003001023001",
		"parentid": "310113003000"
	},
	{
		"shortname": "密山二村居委会",
		"id": "310113003001025001",
		"parentid": "310113003000"
	},
	{
		"shortname": "临江新村居委会",
		"id": "310113003001026001",
		"parentid": "310113003000"
	},
	{
		"shortname": "临江公园居委会",
		"id": "310113003001028001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝城新村居委会",
		"id": "310113003001029001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山一村居委会",
		"id": "310113003001034001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山二村居委会",
		"id": "310113003001035001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山三村居委会",
		"id": "310113003001036001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山五村居委会",
		"id": "310113003001037001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山八村居委会",
		"id": "310113003001038001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山九村居委会",
		"id": "310113003001040001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山十村居委会",
		"id": "310113003001041001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山七村居委会",
		"id": "310113003001043001",
		"parentid": "310113003000"
	},
	{
		"shortname": "华能城市花园居委会",
		"id": "310113003001044001",
		"parentid": "310113003000"
	},
	{
		"shortname": "白玉兰花园居委会",
		"id": "310113003001045001",
		"parentid": "310113003000"
	},
	{
		"shortname": "宝山六村居委会",
		"id": "310113003001046001",
		"parentid": "310113003000"
	},
	{
		"shortname": "同济公寓居委会",
		"id": "310113003001047001",
		"parentid": "310113003000"
	},
	{
		"shortname": "住友宝莲花园居委会",
		"id": "310113003001048001",
		"parentid": "310113003000"
	},
	{
		"shortname": "炮台村村委会",
		"id": "310113003001201001",
		"parentid": "310113003000"
	}, {
		"shortname": "和丰居委会",
		"id": "310113007001001001",
		"parentid": "310113007000"
	},
	{
		"shortname": "淞新居委会",
		"id": "310113007001002001",
		"parentid": "310113007000"
	},
	{
		"shortname": "泗东居委会",
		"id": "310113007001003001",
		"parentid": "310113007000"
	},
	{
		"shortname": "李金居委会",
		"id": "310113007001004001",
		"parentid": "310113007000"
	},
	{
		"shortname": "八棉一纺居委会",
		"id": "310113007001005001",
		"parentid": "310113007000"
	},
	{
		"shortname": "八棉二纺居委会",
		"id": "310113007001006001",
		"parentid": "310113007000"
	},
	{
		"shortname": "桃园居委会",
		"id": "310113007001007001",
		"parentid": "310113007000"
	},
	{
		"shortname": "淞西居委会",
		"id": "310113007001008001",
		"parentid": "310113007000"
	},
	{
		"shortname": "长征居委会",
		"id": "310113007001009001",
		"parentid": "310113007000"
	},
	{
		"shortname": "吴淞三村居委会",
		"id": "310113007001010001",
		"parentid": "310113007000"
	},
	{
		"shortname": "吴淞新城居委会",
		"id": "310113007001011001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨二村一居委会",
		"id": "310113007001013001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨二村二居委会",
		"id": "310113007001014001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨三村居委会",
		"id": "310113007001015001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨四村居委会",
		"id": "310113007001016001",
		"parentid": "310113007000"
	},
	{
		"shortname": "西朱新村居委会",
		"id": "310113007001019001",
		"parentid": "310113007000"
	},
	{
		"shortname": "三营房居委会",
		"id": "310113007001020001",
		"parentid": "310113007000"
	},
	{
		"shortname": "永清新村居委会",
		"id": "310113007001021001",
		"parentid": "310113007000"
	},
	{
		"shortname": "永清二村居委会",
		"id": "310113007001022001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海江新村居委会",
		"id": "310113007001024001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨新村第一居委会",
		"id": "310113007001025001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨新村第二居委会",
		"id": "310113007001026001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海江二村第一居委会",
		"id": "310113007001027001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海江二村第二居委会",
		"id": "310113007001028001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨八村第一居委会",
		"id": "310113007001029001",
		"parentid": "310113007000"
	},
	{
		"shortname": "海滨八村第二居委会",
		"id": "310113007001030001",
		"parentid": "310113007000"
	},
	{
		"shortname": "牡丹江路第一居委会（筹建）",
		"id": "310113007001804001",
		"parentid": "310113007000"
	},
	{
		"shortname": "牡丹江路第二居委会（筹建）",
		"id": "310113007001805001",
		"parentid": "310113007000"
	}, {
		"shortname": "虎林居委会",
		"id": "310113008001001001",
		"parentid": "310113008000"
	},
	{
		"shortname": "新桥居委会",
		"id": "310113008001002001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘居委会",
		"id": "310113008001003001",
		"parentid": "310113008000"
	},
	{
		"shortname": "虎林二居委会",
		"id": "310113008001004001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘三村居委会",
		"id": "310113008001005001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘四村一居委会",
		"id": "310113008001006001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘四村三居委会",
		"id": "310113008001007001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘五村一居委会",
		"id": "310113008001008001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘五村二居委会",
		"id": "310113008001009001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘六村居委会",
		"id": "310113008001010001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘七村居委会",
		"id": "310113008001011001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘八村居委会",
		"id": "310113008001012001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛一村二居委会",
		"id": "310113008001013001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛一村三居委会",
		"id": "310113008001014001",
		"parentid": "310113008000"
	},
	{
		"shortname": "富浩居委会",
		"id": "310113008001015001",
		"parentid": "310113008000"
	},
	{
		"shortname": "泗塘七村三居委会",
		"id": "310113008001016001",
		"parentid": "310113008000"
	},
	{
		"shortname": "振兴居委会",
		"id": "310113008001017001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河一村居委会",
		"id": "310113008001018001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河二村居委会",
		"id": "310113008001019001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河三村一居委会",
		"id": "310113008001020001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河三村二居委会",
		"id": "310113008001021001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河四村一居委会",
		"id": "310113008001022001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河四村二居委会",
		"id": "310113008001023001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河六村一居委会",
		"id": "310113008001024001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河六村二居委会",
		"id": "310113008001025001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河七村一居委会",
		"id": "310113008001026001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河八村一居委会",
		"id": "310113008001027001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河八村二居委会",
		"id": "310113008001028001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河八村三居委会",
		"id": "310113008001029001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛二村一居委会",
		"id": "310113008001030001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛二村二居委会",
		"id": "310113008001031001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛三村一居委会",
		"id": "310113008001032001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛三村二居委会",
		"id": "310113008001033001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛三村三居委会",
		"id": "310113008001034001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛三村四居委会",
		"id": "310113008001035001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛四村居委会",
		"id": "310113008001036001",
		"parentid": "310113008000"
	},
	{
		"shortname": "呼玛五村居委会",
		"id": "310113008001037001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河七村二居委会",
		"id": "310113008001038001",
		"parentid": "310113008000"
	},
	{
		"shortname": "通河九村居委会",
		"id": "310113008001039001",
		"parentid": "310113008000"
	},
	{
		"shortname": "三湘盛世花苑居委会",
		"id": "310113008001040001",
		"parentid": "310113008000"
	}, {
		"shortname": "古镇居委会",
		"id": "310113101001001001",
		"parentid": "310113101000"
	},
	{
		"shortname": "向阳居委会",
		"id": "310113101001002001",
		"parentid": "310113101000"
	},
	{
		"shortname": "祁南居委会",
		"id": "310113101001003001",
		"parentid": "310113101000"
	},
	{
		"shortname": "新桥居委会",
		"id": "310113101001004001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗南居委会",
		"id": "310113101001005001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗溪居委会",
		"id": "310113101001006001",
		"parentid": "310113101000"
	},
	{
		"shortname": "富辰居委会",
		"id": "310113101001007001",
		"parentid": "310113101000"
	},
	{
		"shortname": "富丽居委会",
		"id": "310113101001008001",
		"parentid": "310113101000"
	},
	{
		"shortname": "金星居委会",
		"id": "310113101001009001",
		"parentid": "310113101000"
	},
	{
		"shortname": "富南居委会",
		"id": "310113101001010001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗新居委会",
		"id": "310113101001011001",
		"parentid": "310113101000"
	},
	{
		"shortname": "金星第二居委会",
		"id": "310113101001012001",
		"parentid": "310113101000"
	},
	{
		"shortname": "顺驰美兰湖居委会",
		"id": "310113101001013001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖颐景园居委会",
		"id": "310113101001014001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖景瑞欧兰高邸居委会",
		"id": "310113101001015001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖琥珀郡园居委会",
		"id": "310113101001016001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖朗诗绿岛园居委会",
		"id": "310113101001017001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗溪村村委会",
		"id": "310113101001201001",
		"parentid": "310113101000"
	},
	{
		"shortname": "毛家弄村村委会",
		"id": "310113101001203001",
		"parentid": "310113101000"
	},
	{
		"shortname": "光明村村委会",
		"id": "310113101001206001",
		"parentid": "310113101000"
	},
	{
		"shortname": "天平村村委会",
		"id": "310113101001207001",
		"parentid": "310113101000"
	},
	{
		"shortname": "金星村村委会",
		"id": "310113101001208001",
		"parentid": "310113101000"
	},
	{
		"shortname": "四方村村委会",
		"id": "310113101001209001",
		"parentid": "310113101000"
	},
	{
		"shortname": "东南弄村村委会",
		"id": "310113101001210001",
		"parentid": "310113101000"
	},
	{
		"shortname": "束里桥村村委会",
		"id": "310113101001211001",
		"parentid": "310113101000"
	},
	{
		"shortname": "义品村村委会",
		"id": "310113101001212001",
		"parentid": "310113101000"
	},
	{
		"shortname": "王家村村委会",
		"id": "310113101001214001",
		"parentid": "310113101000"
	},
	{
		"shortname": "蔡家弄村村委会",
		"id": "310113101001215001",
		"parentid": "310113101000"
	},
	{
		"shortname": "繁荣村村委会",
		"id": "310113101001216001",
		"parentid": "310113101000"
	},
	{
		"shortname": "北金村村委会",
		"id": "310113101001217001",
		"parentid": "310113101000"
	},
	{
		"shortname": "张士村村委会",
		"id": "310113101001218001",
		"parentid": "310113101000"
	},
	{
		"shortname": "富强村村委会",
		"id": "310113101001219001",
		"parentid": "310113101000"
	},
	{
		"shortname": "十年村村委会",
		"id": "310113101001220001",
		"parentid": "310113101000"
	},
	{
		"shortname": "朱家店村村委会",
		"id": "310113101001221001",
		"parentid": "310113101000"
	},
	{
		"shortname": "西埝村村委会",
		"id": "310113101001222001",
		"parentid": "310113101000"
	},
	{
		"shortname": "远景村村委会",
		"id": "310113101001223001",
		"parentid": "310113101000"
	},
	{
		"shortname": "南周村村委会",
		"id": "310113101001224001",
		"parentid": "310113101000"
	},
	{
		"shortname": "联合村村委会",
		"id": "310113101001225001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗盛居委会（筹建）",
		"id": "310113101001812001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖中华园居委会（筹建）",
		"id": "310113101001814001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖琥珀臻园居委会（筹建）",
		"id": "310113101001815001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖香岛原墅居委会（筹建）",
		"id": "310113101001816001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗贤苑居委会（筹建）",
		"id": "310113101001817001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美平苑居委会（筹建）",
		"id": "310113101001818001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美安苑居委会（筹建）",
		"id": "310113101001819001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗智苑居委会（筹建）",
		"id": "310113101001820001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第三居委会（筹建）",
		"id": "310113101001821001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第四居委会（筹建）",
		"id": "310113101001822001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第五居委会（筹建）",
		"id": "310113101001823001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第六居委会（筹建）",
		"id": "310113101001824001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第七居委会（筹建）",
		"id": "310113101001825001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第八居委会（筹建）",
		"id": "310113101001826001",
		"parentid": "310113101000"
	},
	{
		"shortname": "保翔苑居委会（筹建）",
		"id": "310113101001827001",
		"parentid": "310113101000"
	},
	{
		"shortname": "融侨馨苑居委会（筹建）",
		"id": "310113101001829001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美兰湖中华园第二居委会（筹建）",
		"id": "310113101001830001",
		"parentid": "310113101000"
	},
	{
		"shortname": "佳欣苑居委会（筹建）",
		"id": "310113101001831001",
		"parentid": "310113101000"
	},
	{
		"shortname": "佳境苑居委会（筹建）",
		"id": "310113101001832001",
		"parentid": "310113101000"
	},
	{
		"shortname": "佳翔苑居委会（筹建）",
		"id": "310113101001833001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第一居委会（筹建）",
		"id": "310113101001834001",
		"parentid": "310113101000"
	},
	{
		"shortname": "金丰苑第二居委会（筹建）",
		"id": "310113101001835001",
		"parentid": "310113101000"
	},
	{
		"shortname": "金丰苑第三居委会（筹建）",
		"id": "310113101001836001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园润苑居委会（筹建）",
		"id": "310113101001837001",
		"parentid": "310113101000"
	},
	{
		"shortname": "金丰苑第一居委会（筹建）",
		"id": "310113101001838001",
		"parentid": "310113101000"
	},
	{
		"shortname": "宝欣苑第二居委会（筹建）",
		"id": "310113101001839001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗兰佳苑居委会（筹建）",
		"id": "310113101001840001",
		"parentid": "310113101000"
	},
	{
		"shortname": "罗兰佳苑第二居委会（筹建）",
		"id": "310113101001841001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美文苑居委会（筹建）",
		"id": "310113101001842001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园鼎苑居委会（筹建）",
		"id": "310113101001843001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园罗安苑居委会（筹建）",
		"id": "310113101001844001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园罗翔苑居委会（筹建）",
		"id": "310113101001845001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园罗秀苑居委会（筹建）",
		"id": "310113101001846001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园雅苑居委会（筹建）",
		"id": "310113101001847001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园绣苑居委会（筹建）",
		"id": "310113101001848001",
		"parentid": "310113101000"
	},
	{
		"shortname": "美罗家园宝欣苑第九居委会（筹建）",
		"id": "310113101001849001",
		"parentid": "310113101000"
	},
	{
		"shortname": "大华一村一居委会",
		"id": "310113102001001001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华一村二居委会",
		"id": "310113102001002001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华一村三居委会",
		"id": "310113102001003001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华一村四居委会",
		"id": "310113102001004001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华一村五居委会",
		"id": "310113102001005001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村一居委会",
		"id": "310113102001006001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村二居委会",
		"id": "310113102001007001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村四居委会",
		"id": "310113102001009001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村五居委会",
		"id": "310113102001011001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村七居委会",
		"id": "310113102001012001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华三村四居委会",
		"id": "310113102001013001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华三村七居委会",
		"id": "310113102001014001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华四村一居委会",
		"id": "310113102001015001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾溪新村一居委会",
		"id": "310113102001016001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾溪新村二居委会",
		"id": "310113102001017001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾溪新村四居委会",
		"id": "310113102001018001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾溪新村六居委会",
		"id": "310113102001019001",
		"parentid": "310113102000"
	},
	{
		"shortname": "东街居委会",
		"id": "310113102001020001",
		"parentid": "310113102000"
	},
	{
		"shortname": "西街居委会",
		"id": "310113102001021001",
		"parentid": "310113102000"
	},
	{
		"shortname": "联建居委会",
		"id": "310113102001022001",
		"parentid": "310113102000"
	},
	{
		"shortname": "联合居委会",
		"id": "310113102001023001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连一村一居委会",
		"id": "310113102001026001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连一村二居委会",
		"id": "310113102001027001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连二村一居委会",
		"id": "310113102001028001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连二村二居委会",
		"id": "310113102001029001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连三村第一居委会",
		"id": "310113102001030001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连四村居委会",
		"id": "310113102001031001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华一村七居委会",
		"id": "310113102001032001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村八居委会",
		"id": "310113102001033001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华三村一居委会",
		"id": "310113102001034001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华三村二居委会",
		"id": "310113102001035001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华三村三居委会",
		"id": "310113102001036001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华三村五居委会",
		"id": "310113102001037001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华三村六居委会",
		"id": "310113102001038001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾溪新村五居委会",
		"id": "310113102001040001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村嘉华苑居委会",
		"id": "310113102001041001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村第六居委会",
		"id": "310113102001042001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华四村第二居委会",
		"id": "310113102001043001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华四村第三居委会",
		"id": "310113102001044001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华四村第四居委会",
		"id": "310113102001045001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华四村第五居委会",
		"id": "310113102001046001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华四村第六居委会",
		"id": "310113102001047001",
		"parentid": "310113102000"
	},
	{
		"shortname": "联乾居委会",
		"id": "310113102001048001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾溪新村第八居委会",
		"id": "310113102001049001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连三村第二居委会",
		"id": "310113102001050001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连三村第三居委会",
		"id": "310113102001051001",
		"parentid": "310113102000"
	},
	{
		"shortname": "锦秋第一居委会",
		"id": "310113102001052001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾溪新村第七居委会",
		"id": "310113102001053001",
		"parentid": "310113102000"
	},
	{
		"shortname": "新华居委会",
		"id": "310113102001054001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾宁苑居委会",
		"id": "310113102001055001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连一村第三居委会",
		"id": "310113102001056001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连二村第三居委会",
		"id": "310113102001057001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华四村第七居委会",
		"id": "310113102001058001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村滨江雅苑居委会",
		"id": "310113102001059001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华一村第六居委会",
		"id": "310113102001060001",
		"parentid": "310113102000"
	},
	{
		"shortname": "和泰苑居委会",
		"id": "310113102001061001",
		"parentid": "310113102000"
	},
	{
		"shortname": "城市绿洲第一居委会",
		"id": "310113102001062001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华二村铂金华府居委会",
		"id": "310113102001063001",
		"parentid": "310113102000"
	},
	{
		"shortname": "慧华苑居委会",
		"id": "310113102001064001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华五村第一居委会",
		"id": "310113102001065001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华五村第二居委会",
		"id": "310113102001066001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华五村第三居委会",
		"id": "310113102001067001",
		"parentid": "310113102000"
	},
	{
		"shortname": "聚丰景都居委会",
		"id": "310113102001068001",
		"parentid": "310113102000"
	},
	{
		"shortname": "经纬城市绿洲第二居委会",
		"id": "310113102001069001",
		"parentid": "310113102000"
	},
	{
		"shortname": "经纬城市绿洲第三居委会",
		"id": "310113102001070001",
		"parentid": "310113102000"
	},
	{
		"shortname": "葑润华庭居委会",
		"id": "310113102001071001",
		"parentid": "310113102000"
	},
	{
		"shortname": "当代高邸居委会",
		"id": "310113102001072001",
		"parentid": "310113102000"
	},
	{
		"shortname": "锦秋第二居委会",
		"id": "310113102001073001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华五村第四居委会",
		"id": "310113102001074001",
		"parentid": "310113102000"
	},
	{
		"shortname": "联东村村委会",
		"id": "310113102001202001",
		"parentid": "310113102000"
	},
	{
		"shortname": "场南村村委会",
		"id": "310113102001203001",
		"parentid": "310113102000"
	},
	{
		"shortname": "东方红村村委会",
		"id": "310113102001204001",
		"parentid": "310113102000"
	},
	{
		"shortname": "场中村村委会",
		"id": "310113102001205001",
		"parentid": "310113102000"
	},
	{
		"shortname": "联西村村委会",
		"id": "310113102001206001",
		"parentid": "310113102000"
	},
	{
		"shortname": "南大村村委会",
		"id": "310113102001207001",
		"parentid": "310113102000"
	},
	{
		"shortname": "红光村村委会",
		"id": "310113102001208001",
		"parentid": "310113102000"
	},
	{
		"shortname": "葑村村村委会",
		"id": "310113102001209001",
		"parentid": "310113102000"
	},
	{
		"shortname": "丰收村村委会",
		"id": "310113102001210001",
		"parentid": "310113102000"
	},
	{
		"shortname": "丰明村村委会",
		"id": "310113102001211001",
		"parentid": "310113102000"
	},
	{
		"shortname": "大华五村第五居委会（筹建）",
		"id": "310113102001836001",
		"parentid": "310113102000"
	},
	{
		"shortname": "聚丰福邸居委会（筹建）",
		"id": "310113102001837001",
		"parentid": "310113102000"
	},
	{
		"shortname": "宝祁雅苑第一居委会（筹）",
		"id": "310113102001838001",
		"parentid": "310113102000"
	},
	{
		"shortname": "宝祁雅苑第二居委会（筹建）",
		"id": "310113102001839001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连汇枫景苑居委会（筹建）",
		"id": "310113102001840001",
		"parentid": "310113102000"
	},
	{
		"shortname": "祁连保利叶之林居委会（筹建）",
		"id": "310113102001841001",
		"parentid": "310113102000"
	},
	{
		"shortname": "丰宝苑居委会（筹建）",
		"id": "310113102001842001",
		"parentid": "310113102000"
	},
	{
		"shortname": "南秀雅苑居委会（筹建）",
		"id": "310113102001843001",
		"parentid": "310113102000"
	},
	{
		"shortname": "天缘华城居委会（筹建）",
		"id": "310113102001844001",
		"parentid": "310113102000"
	},
	{
		"shortname": "乾皓苑居委会（筹建）",
		"id": "310113102001845001",
		"parentid": "310113102000"
	},
	{
		"shortname": "丰皓苑居委会（筹建）",
		"id": "310113102001846001",
		"parentid": "310113102000"
	},
	{
		"shortname": "学士逸居居委会（筹建）",
		"id": "310113102001847001",
		"parentid": "310113102000"
	},
	{
		"shortname": "学府阳光居委会（筹建）",
		"id": "310113102001848001",
		"parentid": "310113102000"
	}, {
		"shortname": "杨泰一村一居委会",
		"id": "310113103001001001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨泰一村二居委会",
		"id": "310113103001002001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨泰二村一居委会",
		"id": "310113103001003001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨泰二村二居委会",
		"id": "310113103001004001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨泰三村一居委会",
		"id": "310113103001005001",
		"parentid": "310113103000"
	},
	{
		"shortname": "天馨花园第一居委会",
		"id": "310113103001006001",
		"parentid": "310113103000"
	},
	{
		"shortname": "宝杨路二零二一弄居委会",
		"id": "310113103001007001",
		"parentid": "310113103000"
	},
	{
		"shortname": "宝启花园一居委会",
		"id": "310113103001008001",
		"parentid": "310113103000"
	},
	{
		"shortname": "富锦苑居委会",
		"id": "310113103001009001",
		"parentid": "310113103000"
	},
	{
		"shortname": "城西居委会",
		"id": "310113103001010001",
		"parentid": "310113103000"
	},
	{
		"shortname": "宝启公寓居委会",
		"id": "310113103001011001",
		"parentid": "310113103000"
	},
	{
		"shortname": "富杨居委会",
		"id": "310113103001012001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨泰春城居委会",
		"id": "310113103001013001",
		"parentid": "310113103000"
	},
	{
		"shortname": "梅林居委会",
		"id": "310113103001014001",
		"parentid": "310113103000"
	},
	{
		"shortname": "宝地绿洲居委会",
		"id": "310113103001015001",
		"parentid": "310113103000"
	},
	{
		"shortname": "四季花城居委会",
		"id": "310113103001016001",
		"parentid": "310113103000"
	},
	{
		"shortname": "天馨花园第二居委会",
		"id": "310113103001017001",
		"parentid": "310113103000"
	},
	{
		"shortname": "友谊家园第一居委会",
		"id": "310113103001018001",
		"parentid": "310113103000"
	},
	{
		"shortname": "友谊家园第二居委会",
		"id": "310113103001019001",
		"parentid": "310113103000"
	},
	{
		"shortname": "康桥水都第一居委会",
		"id": "310113103001020001",
		"parentid": "310113103000"
	},
	{
		"shortname": "禄德嘉苑居委会",
		"id": "310113103001021001",
		"parentid": "310113103000"
	},
	{
		"shortname": "柏丽华庭居委会",
		"id": "310113103001022001",
		"parentid": "310113103000"
	},
	{
		"shortname": "同盛嘉园居委会",
		"id": "310113103001023001",
		"parentid": "310113103000"
	},
	{
		"shortname": "四季花城第二居委会",
		"id": "310113103001024001",
		"parentid": "310113103000"
	},
	{
		"shortname": "大黄馨园居委会",
		"id": "310113103001025001",
		"parentid": "310113103000"
	},
	{
		"shortname": "丽景翠庭居委会",
		"id": "310113103001026001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨鑫居委会",
		"id": "310113103001027001",
		"parentid": "310113103000"
	},
	{
		"shortname": "福地苑第一居委会",
		"id": "310113103001028001",
		"parentid": "310113103000"
	},
	{
		"shortname": "福地苑第二居委会",
		"id": "310113103001029001",
		"parentid": "310113103000"
	},
	{
		"shortname": "保集绿岛家园居委会",
		"id": "310113103001030001",
		"parentid": "310113103000"
	},
	{
		"shortname": "盛高香逸湾庭院居委会",
		"id": "310113103001031001",
		"parentid": "310113103000"
	},
	{
		"shortname": "飘鹰锦和花园居委会",
		"id": "310113103001032001",
		"parentid": "310113103000"
	},
	{
		"shortname": "春江美庐居委会",
		"id": "310113103001033001",
		"parentid": "310113103000"
	},
	{
		"shortname": "紫辰苑居委会",
		"id": "310113103001034001",
		"parentid": "310113103000"
	},
	{
		"shortname": "东方丽都居委会",
		"id": "310113103001035001",
		"parentid": "310113103000"
	},
	{
		"shortname": "宝虹水岸景苑居委会",
		"id": "310113103001036001",
		"parentid": "310113103000"
	},
	{
		"shortname": "友谊苑居委会",
		"id": "310113103001037001",
		"parentid": "310113103000"
	},
	{
		"shortname": "和家欣苑居委会",
		"id": "310113103001038001",
		"parentid": "310113103000"
	},
	{
		"shortname": "远洋悦庭居委会",
		"id": "310113103001039001",
		"parentid": "310113103000"
	},
	{
		"shortname": "海德花园居委会",
		"id": "310113103001040001",
		"parentid": "310113103000"
	},
	{
		"shortname": "绿地香颂居委会",
		"id": "310113103001041001",
		"parentid": "310113103000"
	},
	{
		"shortname": "东街村村委会",
		"id": "310113103001201001",
		"parentid": "310113103000"
	},
	{
		"shortname": "城西一村村委会",
		"id": "310113103001202001",
		"parentid": "310113103000"
	},
	{
		"shortname": "大黄村村委会",
		"id": "310113103001203001",
		"parentid": "310113103000"
	},
	{
		"shortname": "钱湾村村委会",
		"id": "310113103001204001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨北村村委会",
		"id": "310113103001205001",
		"parentid": "310113103000"
	},
	{
		"shortname": "苏家村村委会",
		"id": "310113103001206001",
		"parentid": "310113103000"
	},
	{
		"shortname": "北宗村村委会",
		"id": "310113103001207001",
		"parentid": "310113103000"
	},
	{
		"shortname": "西街村村委会",
		"id": "310113103001208001",
		"parentid": "310113103000"
	},
	{
		"shortname": "城西二村村委会",
		"id": "310113103001209001",
		"parentid": "310113103000"
	},
	{
		"shortname": "西浜村村委会",
		"id": "310113103001210001",
		"parentid": "310113103000"
	},
	{
		"shortname": "湄浦村村委会",
		"id": "310113103001212001",
		"parentid": "310113103000"
	},
	{
		"shortname": "桂家木村村委会",
		"id": "310113103001213001",
		"parentid": "310113103000"
	},
	{
		"shortname": "陈巷村村委会",
		"id": "310113103001214001",
		"parentid": "310113103000"
	},
	{
		"shortname": "三汀沟村村委会",
		"id": "310113103001216001",
		"parentid": "310113103000"
	},
	{
		"shortname": "杨东村村委会",
		"id": "310113103001217001",
		"parentid": "310113103000"
	},
	{
		"shortname": "泗塘村村委会",
		"id": "310113103001218001",
		"parentid": "310113103000"
	}, {
		"shortname": "月浦四村居委会",
		"id": "310113104001004001",
		"parentid": "310113104000"
	},
	{
		"shortname": "月浦五村居委会",
		"id": "310113104001005001",
		"parentid": "310113104000"
	},
	{
		"shortname": "月浦七村居委会",
		"id": "310113104001006001",
		"parentid": "310113104000"
	},
	{
		"shortname": "月浦八村居委会",
		"id": "310113104001007001",
		"parentid": "310113104000"
	},
	{
		"shortname": "月浦九村居委会",
		"id": "310113104001008001",
		"parentid": "310113104000"
	},
	{
		"shortname": "月浦十村居委会",
		"id": "310113104001009001",
		"parentid": "310113104000"
	},
	{
		"shortname": "乐业二村居委会",
		"id": "310113104001012001",
		"parentid": "310113104000"
	},
	{
		"shortname": "乐业四村二居委会",
		"id": "310113104001013001",
		"parentid": "310113104000"
	},
	{
		"shortname": "庆安一村居委会",
		"id": "310113104001016001",
		"parentid": "310113104000"
	},
	{
		"shortname": "庆安二村居委会",
		"id": "310113104001017001",
		"parentid": "310113104000"
	},
	{
		"shortname": "马泾桥新村居委会",
		"id": "310113104001018001",
		"parentid": "310113104000"
	},
	{
		"shortname": "盛桥三村居委会",
		"id": "310113104001021001",
		"parentid": "310113104000"
	},
	{
		"shortname": "盛桥四村居委会",
		"id": "310113104001022001",
		"parentid": "310113104000"
	},
	{
		"shortname": "庆安第四居委会",
		"id": "310113104001023001",
		"parentid": "310113104000"
	},
	{
		"shortname": "庆安第五居委会",
		"id": "310113104001024001",
		"parentid": "310113104000"
	},
	{
		"shortname": "宝月尚园居委会",
		"id": "310113104001029001",
		"parentid": "310113104000"
	},
	{
		"shortname": "新月明珠园居委会",
		"id": "310113104001030001",
		"parentid": "310113104000"
	},
	{
		"shortname": "鸿锦苑居委会",
		"id": "310113104001031001",
		"parentid": "310113104000"
	},
	{
		"shortname": "北岸郡庭居委会",
		"id": "310113104001032001",
		"parentid": "310113104000"
	},
	{
		"shortname": "梅园村村委会",
		"id": "310113104001201001",
		"parentid": "310113104000"
	},
	{
		"shortname": "段泾村村委会",
		"id": "310113104001202001",
		"parentid": "310113104000"
	},
	{
		"shortname": "茂盛村村委会",
		"id": "310113104001203001",
		"parentid": "310113104000"
	},
	{
		"shortname": "勤丰村村委会",
		"id": "310113104001204001",
		"parentid": "310113104000"
	},
	{
		"shortname": "长春村村委会",
		"id": "310113104001205001",
		"parentid": "310113104000"
	},
	{
		"shortname": "沈巷村村委会",
		"id": "310113104001206001",
		"parentid": "310113104000"
	},
	{
		"shortname": "友谊村村委会",
		"id": "310113104001208001",
		"parentid": "310113104000"
	},
	{
		"shortname": "月狮村村委会",
		"id": "310113104001209001",
		"parentid": "310113104000"
	},
	{
		"shortname": "沈家桥村村委会",
		"id": "310113104001210001",
		"parentid": "310113104000"
	},
	{
		"shortname": "钱潘村村委会",
		"id": "310113104001211001",
		"parentid": "310113104000"
	},
	{
		"shortname": "海陆村村委会",
		"id": "310113104001212001",
		"parentid": "310113104000"
	},
	{
		"shortname": "盛星村村委会",
		"id": "310113104001213001",
		"parentid": "310113104000"
	},
	{
		"shortname": "聚源桥村村委会",
		"id": "310113104001214001",
		"parentid": "310113104000"
	},
	{
		"shortname": "新丰村村委会",
		"id": "310113104001215001",
		"parentid": "310113104000"
	},
	{
		"shortname": "阳光锦园居委会（筹建）",
		"id": "310113104001810001",
		"parentid": "310113104000"
	},
	{
		"shortname": "昱翠湾居委会（筹建）",
		"id": "310113104001811001",
		"parentid": "310113104000"
	},
	{
		"shortname": "乐业五村居委会（筹建）",
		"id": "310113104001812001",
		"parentid": "310113104000"
	},
	{
		"shortname": "乐业一村居委会（筹建）",
		"id": "310113104001813001",
		"parentid": "310113104000"
	},
	{
		"shortname": "时代富浩居委会（筹建）",
		"id": "310113104001814001",
		"parentid": "310113104000"
	},
	{
		"shortname": "月浦二三村居委会（筹建）",
		"id": "310113104001815001",
		"parentid": "310113104000"
	},
	{
		"shortname": "盛桥新村居委会（筹建）",
		"id": "310113104001816001",
		"parentid": "310113104000"
	},
	{
		"shortname": "星月居委会（筹建）",
		"id": "310113104001817001",
		"parentid": "310113104000"
	}, {
		"shortname": "罗泾镇一居委会",
		"id": "310113106001001001",
		"parentid": "310113106000"
	},
	{
		"shortname": "宝虹家园居委会",
		"id": "310113106001002001",
		"parentid": "310113106000"
	},
	{
		"shortname": "宝通家园居委会",
		"id": "310113106001003001",
		"parentid": "310113106000"
	},
	{
		"shortname": "宝悦家苑居委会",
		"id": "310113106001004001",
		"parentid": "310113106000"
	},
	{
		"shortname": "宝祥宝邸居委会",
		"id": "310113106001005001",
		"parentid": "310113106000"
	},
	{
		"shortname": "上河苑居委会",
		"id": "310113106001006001",
		"parentid": "310113106000"
	},
	{
		"shortname": "海星村村委会",
		"id": "310113106001201001",
		"parentid": "310113106000"
	},
	{
		"shortname": "潘桥村村委会",
		"id": "310113106001202001",
		"parentid": "310113106000"
	},
	{
		"shortname": "合建村村委会",
		"id": "310113106001203001",
		"parentid": "310113106000"
	},
	{
		"shortname": "新陆村村委会",
		"id": "310113106001204001",
		"parentid": "310113106000"
	},
	{
		"shortname": "川沙村村委会",
		"id": "310113106001205001",
		"parentid": "310113106000"
	},
	{
		"shortname": "三桥村村委会",
		"id": "310113106001206001",
		"parentid": "310113106000"
	},
	{
		"shortname": "合众村村委会",
		"id": "310113106001207001",
		"parentid": "310113106000"
	},
	{
		"shortname": "肖泾村村委会",
		"id": "310113106001208001",
		"parentid": "310113106000"
	},
	{
		"shortname": "高椿树村村委会",
		"id": "310113106001209001",
		"parentid": "310113106000"
	},
	{
		"shortname": "陈行村村委会",
		"id": "310113106001210001",
		"parentid": "310113106000"
	},
	{
		"shortname": "花红村村委会",
		"id": "310113106001211001",
		"parentid": "310113106000"
	},
	{
		"shortname": "牌楼村村委会",
		"id": "310113106001212001",
		"parentid": "310113106000"
	},
	{
		"shortname": "新苗村村委会",
		"id": "310113106001213001",
		"parentid": "310113106000"
	},
	{
		"shortname": "塘湾村村委会",
		"id": "310113106001214001",
		"parentid": "310113106000"
	},
	{
		"shortname": "洋桥村村委会",
		"id": "310113106001215001",
		"parentid": "310113106000"
	},
	{
		"shortname": "海红村村委会",
		"id": "310113106001216001",
		"parentid": "310113106000"
	},
	{
		"shortname": "宝丰村村委会",
		"id": "310113106001217001",
		"parentid": "310113106000"
	},
	{
		"shortname": "解放村村委会",
		"id": "310113106001218001",
		"parentid": "310113106000"
	},
	{
		"shortname": "王家楼村村委会",
		"id": "310113106001219001",
		"parentid": "310113106000"
	},
	{
		"shortname": "和平村村委会",
		"id": "310113106001220001",
		"parentid": "310113106000"
	},
	{
		"shortname": "民众村村委会",
		"id": "310113106001221001",
		"parentid": "310113106000"
	},
	{
		"shortname": "海上御景园居委会（筹建）",
		"id": "310113106001807001",
		"parentid": "310113106000"
	}, {
		"shortname": "泰和新城一居委会",
		"id": "310113109001001001",
		"parentid": "310113109000"
	},
	{
		"shortname": "泰和新城二居委会",
		"id": "310113109001002001",
		"parentid": "310113109000"
	},
	{
		"shortname": "泰和新城三居委会",
		"id": "310113109001003001",
		"parentid": "310113109000"
	},
	{
		"shortname": "荻泾花苑居委会",
		"id": "310113109001004001",
		"parentid": "310113109000"
	},
	{
		"shortname": "大唐花园居委会",
		"id": "310113109001005001",
		"parentid": "310113109000"
	},
	{
		"shortname": "顾村居委会",
		"id": "310113109001006001",
		"parentid": "310113109000"
	},
	{
		"shortname": "天极盛宅花园居委会",
		"id": "310113109001007001",
		"parentid": "310113109000"
	},
	{
		"shortname": "菊泉居委会",
		"id": "310113109001008001",
		"parentid": "310113109000"
	},
	{
		"shortname": "共富新村第七居委会",
		"id": "310113109001009001",
		"parentid": "310113109000"
	},
	{
		"shortname": "共富新村第一居委会",
		"id": "310113109001010001",
		"parentid": "310113109000"
	},
	{
		"shortname": "共富新村第二居委会",
		"id": "310113109001011001",
		"parentid": "310113109000"
	},
	{
		"shortname": "共富新村第四居委会",
		"id": "310113109001012001",
		"parentid": "310113109000"
	},
	{
		"shortname": "共富新村第五居委会",
		"id": "310113109001013001",
		"parentid": "310113109000"
	},
	{
		"shortname": "共富新村第六居委会",
		"id": "310113109001014001",
		"parentid": "310113109000"
	},
	{
		"shortname": "共富新村第三居委会",
		"id": "310113109001015001",
		"parentid": "310113109000"
	},
	{
		"shortname": "新顾村大家园第一居委会",
		"id": "310113109001016001",
		"parentid": "310113109000"
	},
	{
		"shortname": "新顾村大家园第二居委会",
		"id": "310113109001017001",
		"parentid": "310113109000"
	},
	{
		"shortname": "新顾村大家园第三居委会",
		"id": "310113109001018001",
		"parentid": "310113109000"
	},
	{
		"shortname": "成亿宝盛家苑居委会",
		"id": "310113109001019001",
		"parentid": "310113109000"
	},
	{
		"shortname": "菊泉新城第二居委会",
		"id": "310113109001020001",
		"parentid": "310113109000"
	},
	{
		"shortname": "菊泉新城第三居委会",
		"id": "310113109001021001",
		"parentid": "310113109000"
	},
	{
		"shortname": "丰水宝邸居委会",
		"id": "310113109001022001",
		"parentid": "310113109000"
	},
	{
		"shortname": "盛宅新村第一居委会",
		"id": "310113109001023001",
		"parentid": "310113109000"
	},
	{
		"shortname": "绿洲花园居委会",
		"id": "310113109001024001",
		"parentid": "310113109000"
	},
	{
		"shortname": "铂庭居委会",
		"id": "310113109001025001",
		"parentid": "310113109000"
	},
	{
		"shortname": "菊泉新城第四居委会",
		"id": "310113109001026001",
		"parentid": "310113109000"
	},
	{
		"shortname": "菊泉新城第一居委会",
		"id": "310113109001027001",
		"parentid": "310113109000"
	},
	{
		"shortname": "新天地荻泾花园居委会",
		"id": "310113109001028001",
		"parentid": "310113109000"
	},
	{
		"shortname": "好日子大家园第一居委会",
		"id": "310113109001029001",
		"parentid": "310113109000"
	},
	{
		"shortname": "好日子大家园第二居委会",
		"id": "310113109001030001",
		"parentid": "310113109000"
	},
	{
		"shortname": "采菊苑居委会",
		"id": "310113109001031001",
		"parentid": "310113109000"
	},
	{
		"shortname": "好日子大家园第三居委会",
		"id": "310113109001032001",
		"parentid": "310113109000"
	},
	{
		"shortname": "好日子大家园第四居委会",
		"id": "310113109001033001",
		"parentid": "310113109000"
	},
	{
		"shortname": "宝山古北菊翔苑居委会",
		"id": "310113109001034001",
		"parentid": "310113109000"
	},
	{
		"shortname": "旭辉依云湾小城居委会",
		"id": "310113109001035001",
		"parentid": "310113109000"
	},
	{
		"shortname": "文宝苑居委会",
		"id": "310113109001036001",
		"parentid": "310113109000"
	},
	{
		"shortname": "世纪长江苑居委会",
		"id": "310113109001037001",
		"parentid": "310113109000"
	},
	{
		"shortname": "上投佳苑居委会",
		"id": "310113109001038001",
		"parentid": "310113109000"
	},
	{
		"shortname": "顾村村委会",
		"id": "310113109001201001",
		"parentid": "310113109000"
	},
	{
		"shortname": "羌家村村委会",
		"id": "310113109001202001",
		"parentid": "310113109000"
	},
	{
		"shortname": "盛宅村村委会",
		"id": "310113109001203001",
		"parentid": "310113109000"
	},
	{
		"shortname": "朱家弄村村委会",
		"id": "310113109001204001",
		"parentid": "310113109000"
	},
	{
		"shortname": "星星村村委会",
		"id": "310113109001205001",
		"parentid": "310113109000"
	},
	{
		"shortname": "白杨村村委会",
		"id": "310113109001206001",
		"parentid": "310113109000"
	},
	{
		"shortname": "谭杨村村委会",
		"id": "310113109001207001",
		"parentid": "310113109000"
	},
	{
		"shortname": "胡庄村村委会",
		"id": "310113109001208001",
		"parentid": "310113109000"
	},
	{
		"shortname": "杨木桥村村委会",
		"id": "310113109001209001",
		"parentid": "310113109000"
	},
	{
		"shortname": "老安村村委会",
		"id": "310113109001211001",
		"parentid": "310113109000"
	},
	{
		"shortname": "沈宅村村委会",
		"id": "310113109001212001",
		"parentid": "310113109000"
	},
	{
		"shortname": "沈杨村村委会",
		"id": "310113109001214001",
		"parentid": "310113109000"
	},
	{
		"shortname": "归王村村委会",
		"id": "310113109001216001",
		"parentid": "310113109000"
	},
	{
		"shortname": "正义村村委会",
		"id": "310113109001217001",
		"parentid": "310113109000"
	},
	{
		"shortname": "广福村村委会",
		"id": "310113109001218001",
		"parentid": "310113109000"
	},
	{
		"shortname": "陈家行村村委会",
		"id": "310113109001220001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园一居委会（筹建）",
		"id": "310113109001826001",
		"parentid": "310113109000"
	},
	{
		"shortname": "自然居居委会（筹建）",
		"id": "310113109001830001",
		"parentid": "310113109000"
	},
	{
		"shortname": "东方帕堤欧居委会（筹建）",
		"id": "310113109001831001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园二居委会（筹建）",
		"id": "310113109001836001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园十二居委会（筹建）",
		"id": "310113109001837001",
		"parentid": "310113109000"
	},
	{
		"shortname": "保利叶城第一居委会（筹建）",
		"id": "310113109001838001",
		"parentid": "310113109000"
	},
	{
		"shortname": "保利叶城第二居委会（筹建）",
		"id": "310113109001839001",
		"parentid": "310113109000"
	},
	{
		"shortname": "保利叶都第一居委会（筹建）",
		"id": "310113109001840001",
		"parentid": "310113109000"
	},
	{
		"shortname": "保利叶都第二居委会（筹建）",
		"id": "310113109001841001",
		"parentid": "310113109000"
	},
	{
		"shortname": "新天地荻泾花园第二居委会（筹建）",
		"id": "310113109001842001",
		"parentid": "310113109000"
	},
	{
		"shortname": "绿地宝里居委会（筹建）",
		"id": "310113109001843001",
		"parentid": "310113109000"
	},
	{
		"shortname": "宝翔苑居委会（筹建）",
		"id": "310113109001844001",
		"parentid": "310113109000"
	},
	{
		"shortname": "宝顾佳苑居委会（筹建）",
		"id": "310113109001845001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第三居委会（筹建）",
		"id": "310113109001846001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第四居委会（筹建）",
		"id": "310113109001847001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第五居委会（筹建）",
		"id": "310113109001848001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第六居委会（筹建）",
		"id": "310113109001849001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第八居委会（筹建）",
		"id": "310113109001850001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第九居委会（筹建）",
		"id": "310113109001851001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第十居委会（筹建）",
		"id": "310113109001852001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第十一居委会（筹建）",
		"id": "310113109001853001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第十三居委会（筹建）",
		"id": "310113109001854001",
		"parentid": "310113109000"
	},
	{
		"shortname": "中怡家园居委会（筹建）",
		"id": "310113109001855001",
		"parentid": "310113109000"
	},
	{
		"shortname": "青秀苑第一居委会（筹建）",
		"id": "310113109001856001",
		"parentid": "310113109000"
	},
	{
		"shortname": "新顾村大家园第四居委会（筹建）",
		"id": "310113109001857001",
		"parentid": "310113109000"
	},
	{
		"shortname": "上坤公园华庭居委会（筹建）",
		"id": "310113109001858001",
		"parentid": "310113109000"
	},
	{
		"shortname": "馨家园第七居委会（筹建）",
		"id": "310113109001859001",
		"parentid": "310113109000"
	},
	{
		"shortname": "宝沁苑居委会（筹建）",
		"id": "310113109001860001",
		"parentid": "310113109000"
	},
	{
		"shortname": "玉兰融创居委会（筹建）",
		"id": "310113109001861001",
		"parentid": "310113109000"
	},
	{
		"shortname": "金地云锦苑居委会（筹建）",
		"id": "310113109001862001",
		"parentid": "310113109000"
	},
	{
		"shortname": "青秀苑第二居委会（筹建）",
		"id": "310113109001863001",
		"parentid": "310113109000"
	}, {
		"shortname": "逸仙一村一居委会",
		"id": "310113111001001001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙一村二居委会",
		"id": "310113111001002001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙一村三居委会",
		"id": "310113111001003001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙一村五居委会",
		"id": "310113111001004001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙二村一居委会",
		"id": "310113111001005001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙二村二居委会",
		"id": "310113111001006001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙二村三居委会",
		"id": "310113111001007001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙二村五居委会",
		"id": "310113111001008001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙三村一居委会",
		"id": "310113111001009001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境一村一居委会",
		"id": "310113111001010001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境一村二居委会",
		"id": "310113111001011001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境二村一居委会",
		"id": "310113111001012001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和一二村居委会",
		"id": "310113111001013001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和三村居委会",
		"id": "310113111001015001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和八村居委会",
		"id": "310113111001016001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和十村居委会",
		"id": "310113111001017001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和十一村居委会",
		"id": "310113111001018001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和五村居委会",
		"id": "310113111001019001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和六村居委会",
		"id": "310113111001020001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共和九村居委会",
		"id": "310113111001021001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境三村居委会",
		"id": "310113111001022001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境四村居委会",
		"id": "310113111001023001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境五村居委会",
		"id": "310113111001024001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙四村居委会",
		"id": "310113111001025001",
		"parentid": "310113111000"
	},
	{
		"shortname": "逸仙一村四居委会（筹建）",
		"id": "310113111001801001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境六村居委会（筹建）",
		"id": "310113111001811001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境七村居委会（筹建）",
		"id": "310113111001812001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境九村居委会（筹建）",
		"id": "310113111001813001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境十一村居委会（筹建）",
		"id": "310113111001814001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境六村第三居委会（筹建）",
		"id": "310113111001815001",
		"parentid": "310113111000"
	},
	{
		"shortname": "高境十村居委会（筹建）",
		"id": "310113111001816001",
		"parentid": "310113111000"
	},
	{
		"shortname": "共康二村居委会",
		"id": "310113112001001001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康五村居委会",
		"id": "310113112001002001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康六村一居委会",
		"id": "310113112001003001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康六村二居委会",
		"id": "310113112001004001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康七村一居委会",
		"id": "310113112001005001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康八村一居委会",
		"id": "310113112001006001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康公寓居委会",
		"id": "310113112001007001",
		"parentid": "310113112000"
	},
	{
		"shortname": "屹立家园居委会",
		"id": "310113112001008001",
		"parentid": "310113112000"
	},
	{
		"shortname": "馨康苑居委会",
		"id": "310113112001009001",
		"parentid": "310113112000"
	},
	{
		"shortname": "和欣国际花园居委会",
		"id": "310113112001010001",
		"parentid": "310113112000"
	},
	{
		"shortname": "九英里居委会",
		"id": "310113112001011001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共和家园居委会",
		"id": "310113112001012001",
		"parentid": "310113112000"
	},
	{
		"shortname": "新梅绿岛苑居委会",
		"id": "310113112001013001",
		"parentid": "310113112000"
	},
	{
		"shortname": "宝宸怡景园居委会",
		"id": "310113112001014001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康雅苑居委会",
		"id": "310113112001015001",
		"parentid": "310113112000"
	},
	{
		"shortname": "中环国际居委会",
		"id": "310113112001016001",
		"parentid": "310113112000"
	},
	{
		"shortname": "共康雅苑第二居委会",
		"id": "310113112001017001",
		"parentid": "310113112000"
	},
	{
		"shortname": "场北居委会",
		"id": "310113112001018001",
		"parentid": "310113112000"
	},
	{
		"shortname": "康家村村委会",
		"id": "310113112001201001",
		"parentid": "310113112000"
	},
	{
		"shortname": "野桥村村委会",
		"id": "310113112001202001",
		"parentid": "310113112000"
	},
	{
		"shortname": "场北村村委会",
		"id": "310113112001203001",
		"parentid": "310113112000"
	},
	{
		"shortname": "中环国际第三居委会（筹建）",
		"id": "310113112001813001",
		"parentid": "310113112000"
	},
	{
		"shortname": "丽都雅苑居委会（筹建）",
		"id": "310113112001814001",
		"parentid": "310113112000"
	}, {
		"shortname": "淞南一村居委会",
		"id": "310113113001001001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南三村一居委会",
		"id": "310113113001002001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南四村一居委会",
		"id": "310113113001003001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南五村一居委会",
		"id": "310113113001004001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南五村二居委会",
		"id": "310113113001005001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南七村一居委会",
		"id": "310113113001006001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南八村居委会",
		"id": "310113113001007001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南九村一居委会",
		"id": "310113113001008001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南九村二居委会",
		"id": "310113113001009001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南十村居委会",
		"id": "310113113001010001",
		"parentid": "310113113000"
	},
	{
		"shortname": "长江路一居委会",
		"id": "310113113001011001",
		"parentid": "310113113000"
	},
	{
		"shortname": "长江路五居委会",
		"id": "310113113001013001",
		"parentid": "310113113000"
	},
	{
		"shortname": "华浜居委会",
		"id": "310113113001014001",
		"parentid": "310113113000"
	},
	{
		"shortname": "张华浜居委会",
		"id": "310113113001015001",
		"parentid": "310113113000"
	},
	{
		"shortname": "华浜二村居委会",
		"id": "310113113001016001",
		"parentid": "310113113000"
	},
	{
		"shortname": "长宏新苑居委会",
		"id": "310113113001017001",
		"parentid": "310113113000"
	},
	{
		"shortname": "嘉骏花苑居委会",
		"id": "310113113001018001",
		"parentid": "310113113000"
	},
	{
		"shortname": "盛达家园居委会",
		"id": "310113113001019001",
		"parentid": "310113113000"
	},
	{
		"shortname": "淞南六村居委会",
		"id": "310113113001020001",
		"parentid": "310113113000"
	},
	{
		"shortname": "新梅淞南苑居委会",
		"id": "310113113001021001",
		"parentid": "310113113000"
	},
	{
		"shortname": "新城尚景居委会",
		"id": "310113113001022001",
		"parentid": "310113113000"
	},
	{
		"shortname": "嘉骏香山苑居委会",
		"id": "310113113001023001",
		"parentid": "310113113000"
	},
	{
		"shortname": "盛世宝邸居委会",
		"id": "310113113001024001",
		"parentid": "310113113000"
	},
	{
		"shortname": "三湘海尚居委会（筹建）",
		"id": "310113113001809001",
		"parentid": "310113113000"
	}, {
		"shortname": "丰翔新城居委会",
		"id": "310113501001001001",
		"parentid": "310113501000"
	},
	{
		"shortname": "三星村村委会",
		"id": "310113501001201001",
		"parentid": "310113501000"
	},
	{
		"shortname": "五星村村委会",
		"id": "310113501001202001",
		"parentid": "310113501000"
	},
	{
		"shortname": "金地艺境居委会（筹建）",
		"id": "310113501001802001",
		"parentid": "310113501000"
	}, {
		"shortname": "社区",
		"id": "310113801001801001",
		"parentid": "310113520000"
	}, {
		"shortname": "社区",
		"id": "310113802001801001",
		"parentid": "310113540000"
	}, {
		"shortname": "社区",
		"id": "310113803001801001",
		"parentid": "310113530000"
	}, {
		"shortname": "社区",
		"id": "310113804001801001",
		"parentid": "310113510000"
	}, {
		"shortname": "迎园社区居委会",
		"id": "310114001001001001",
		"parentid": "310114001000"
	},
	{
		"shortname": "仓场社区居委会",
		"id": "310114001001002001",
		"parentid": "310114001000"
	},
	{
		"shortname": "新成社区居委会",
		"id": "310114001001006001",
		"parentid": "310114001000"
	},
	{
		"shortname": "源珉社区居委会",
		"id": "310114001001009001",
		"parentid": "310114001000"
	},
	{
		"shortname": "嘉乐社区居委会",
		"id": "310114001001010001",
		"parentid": "310114001000"
	},
	{
		"shortname": "南陈社区居委会",
		"id": "310114001001012001",
		"parentid": "310114001000"
	},
	{
		"shortname": "新望社区居委会",
		"id": "310114001001013001",
		"parentid": "310114001000"
	},
	{
		"shortname": "爱里舍花园社区居委会",
		"id": "310114001001014001",
		"parentid": "310114001000"
	},
	{
		"shortname": "沧海社区居委会",
		"id": "310114001001015001",
		"parentid": "310114001000"
	},
	{
		"shortname": "南塘河社区居委会",
		"id": "310114001001016001",
		"parentid": "310114001000"
	},
	{
		"shortname": "墅沟社区居委会",
		"id": "310114001001017001",
		"parentid": "310114001000"
	},
	{
		"shortname": "新成村村委会",
		"id": "310114001001201001",
		"parentid": "310114001000"
	}, {
		"shortname": "新丰社区居委会",
		"id": "310114002001001001",
		"parentid": "310114002000"
	},
	{
		"shortname": "丰一社区居委会",
		"id": "310114002001002001",
		"parentid": "310114002000"
	},
	{
		"shortname": "丰二社区居委会",
		"id": "310114002001003001",
		"parentid": "310114002000"
	},
	{
		"shortname": "祁连社区居委会",
		"id": "310114002001005001",
		"parentid": "310114002000"
	},
	{
		"shortname": "金沙社区居委会",
		"id": "310114002001006001",
		"parentid": "310114002000"
	},
	{
		"shortname": "新郁社区居委会",
		"id": "310114002001007001",
		"parentid": "310114002000"
	},
	{
		"shortname": "金汤社区居委会",
		"id": "310114002001012001",
		"parentid": "310114002000"
	},
	{
		"shortname": "铜川社区居委会",
		"id": "310114002001013001",
		"parentid": "310114002000"
	},
	{
		"shortname": "双河社区居委会",
		"id": "310114002001015001",
		"parentid": "310114002000"
	},
	{
		"shortname": "栅桥社区居委会",
		"id": "310114002001019001",
		"parentid": "310114002000"
	},
	{
		"shortname": "吉镇社区居委会",
		"id": "310114002001025001",
		"parentid": "310114002000"
	},
	{
		"shortname": "虬江社区居委会",
		"id": "310114002001026001",
		"parentid": "310114002000"
	},
	{
		"shortname": "清峪社区居委会",
		"id": "310114002001027001",
		"parentid": "310114002000"
	},
	{
		"shortname": "丰庄社区居委会（筹）",
		"id": "310114002001028001",
		"parentid": "310114002000"
	},
	{
		"shortname": "金栅桥社区居委会（筹）",
		"id": "310114002001029001",
		"parentid": "310114002000"
	},
	{
		"shortname": "鼎秀社区居委会",
		"id": "310114002001030001",
		"parentid": "310114002000"
	},
	{
		"shortname": "梅川社区居委会",
		"id": "310114002001031001",
		"parentid": "310114002000"
	},
	{
		"shortname": "万镇社区居委会",
		"id": "310114002001032001",
		"parentid": "310114002000"
	},
	{
		"shortname": "丰西社区居委会",
		"id": "310114002001033001",
		"parentid": "310114002000"
	},
	{
		"shortname": "金鼎社区居委会",
		"id": "310114002001034001",
		"parentid": "310114002000"
	},
	{
		"shortname": "嘉富社区居委会",
		"id": "310114003001001001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉邦社区居委会",
		"id": "310114003001002001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉宏社区居委会",
		"id": "310114003001004001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉馨社区居委会",
		"id": "310114003001005001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉枫社区居委会",
		"id": "310114003001006001",
		"parentid": "310114003000"
	},
	{
		"shortname": "泰宸社区居委会",
		"id": "310114003001007001",
		"parentid": "310114003000"
	},
	{
		"shortname": "宝菊社区居委会",
		"id": "310114003001008001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉保社区居委会",
		"id": "310114003001009002",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉悠社区居委会",
		"id": "310114003001010001",
		"parentid": "310114003000"
	},
	{
		"shortname": "竹筱社区居委会",
		"id": "310114003001011001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉北社区居委会",
		"id": "310114003001012001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉悦社区居委会",
		"id": "310114003001013001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉和社区居委会",
		"id": "310114003001014001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉汇社区居委会",
		"id": "310114003001015001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉盛社区居委会",
		"id": "310114003001016001",
		"parentid": "310114003000"
	},
	{
		"shortname": "永胜村村委会",
		"id": "310114003001201001",
		"parentid": "310114003000"
	},
	{
		"shortname": "青冈村村委会",
		"id": "310114003001205001",
		"parentid": "310114003000"
	},
	{
		"shortname": "六里村村委会",
		"id": "310114003001207001",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉筱社区居委会（筹建）",
		"id": "310114003001801002",
		"parentid": "310114003000"
	},
	{
		"shortname": "嘉莱社区居委会（筹建）",
		"id": "310114003001802002",
		"parentid": "310114003000"
	},
	{
		"shortname": "汇龙潭社区居委会",
		"id": "310114004001001001",
		"parentid": "310114004000"
	},
	{
		"shortname": "州桥社区居委会",
		"id": "310114004001003001",
		"parentid": "310114004000"
	},
	{
		"shortname": "叶池社区居委会",
		"id": "310114004001005001",
		"parentid": "310114004000"
	},
	{
		"shortname": "李园一村社区居委会",
		"id": "310114004001009001",
		"parentid": "310114004000"
	},
	{
		"shortname": "李园二村社区居委会",
		"id": "310114004001010001",
		"parentid": "310114004000"
	},
	{
		"shortname": "嘉中社区居委会",
		"id": "310114004001011001",
		"parentid": "310114004000"
	},
	{
		"shortname": "小囡桥社区居委会",
		"id": "310114004001012001",
		"parentid": "310114004000"
	},
	{
		"shortname": "三皇桥社区居委会",
		"id": "310114004001013001",
		"parentid": "310114004000"
	},
	{
		"shortname": "花园弄社区居委会",
		"id": "310114004001014001",
		"parentid": "310114004000"
	},
	{
		"shortname": "西大社区居委会",
		"id": "310114004001016001",
		"parentid": "310114004000"
	},
	{
		"shortname": "侯黄桥社区居委会",
		"id": "310114004001019001",
		"parentid": "310114004000"
	},
	{
		"shortname": "梅园社区居委会",
		"id": "310114004001021001",
		"parentid": "310114004000"
	},
	{
		"shortname": "丽景社区居委会",
		"id": "310114004001022001",
		"parentid": "310114004000"
	},
	{
		"shortname": "桃园社区居委会",
		"id": "310114004001023001",
		"parentid": "310114004000"
	},
	{
		"shortname": "秋霞社区居委会",
		"id": "310114004001024001",
		"parentid": "310114004000"
	},
	{
		"shortname": "塔城路社区居委会",
		"id": "310114004001027002",
		"parentid": "310114004000"
	},
	{
		"shortname": "银杏社区居委会",
		"id": "310114004001028002",
		"parentid": "310114004000"
	}, {
		"shortname": "古猗园社区居委会",
		"id": "310114102001001001",
		"parentid": "310114102000"
	},
	{
		"shortname": "德华社区居委会",
		"id": "310114102001002001",
		"parentid": "310114102000"
	},
	{
		"shortname": "德园社区居委会",
		"id": "310114102001003001",
		"parentid": "310114102000"
	},
	{
		"shortname": "云翔社区居委会",
		"id": "310114102001004001",
		"parentid": "310114102000"
	},
	{
		"shortname": "南华社区居委会",
		"id": "310114102001005001",
		"parentid": "310114102000"
	},
	{
		"shortname": "白鹤社区居委会",
		"id": "310114102001007001",
		"parentid": "310114102000"
	},
	{
		"shortname": "翔华社区居委会",
		"id": "310114102001009001",
		"parentid": "310114102000"
	},
	{
		"shortname": "虹翔社区居委会",
		"id": "310114102001012001",
		"parentid": "310114102000"
	},
	{
		"shortname": "丰翔社区居委会",
		"id": "310114102001013001",
		"parentid": "310114102000"
	},
	{
		"shortname": "银翔社区居委会",
		"id": "310114102001014001",
		"parentid": "310114102000"
	},
	{
		"shortname": "永翔社区居委会",
		"id": "310114102001015001",
		"parentid": "310114102000"
	},
	{
		"shortname": "宝翔社区居委会",
		"id": "310114102001016001",
		"parentid": "310114102000"
	},
	{
		"shortname": "新翔社区居委会",
		"id": "310114102001017001",
		"parentid": "310114102000"
	},
	{
		"shortname": "瑞林社区居委会",
		"id": "310114102001018001",
		"parentid": "310114102000"
	},
	{
		"shortname": "隽翔社区居委会",
		"id": "310114102001019001",
		"parentid": "310114102000"
	},
	{
		"shortname": "翔北社区居委会",
		"id": "310114102001020001",
		"parentid": "310114102000"
	},
	{
		"shortname": "芳林社区居委会",
		"id": "310114102001021001",
		"parentid": "310114102000"
	},
	{
		"shortname": "东园社区居委会",
		"id": "310114102001022001",
		"parentid": "310114102000"
	},
	{
		"shortname": "天恩社区居委会",
		"id": "310114102001023001",
		"parentid": "310114102000"
	},
	{
		"shortname": "留云社区居委会",
		"id": "310114102001024001",
		"parentid": "310114102000"
	},
	{
		"shortname": "清猗社区居委会",
		"id": "310114102001025001",
		"parentid": "310114102000"
	},
	{
		"shortname": "华丰社区居委会",
		"id": "310114102001026001",
		"parentid": "310114102000"
	},
	{
		"shortname": "华猗社区居委会",
		"id": "310114102001027001",
		"parentid": "310114102000"
	},
	{
		"shortname": "金通社区居委会",
		"id": "310114102001028001",
		"parentid": "310114102000"
	},
	{
		"shortname": "新裕村村委会",
		"id": "310114102001203001",
		"parentid": "310114102000"
	},
	{
		"shortname": "永丰村村委会",
		"id": "310114102001206001",
		"parentid": "310114102000"
	},
	{
		"shortname": "永乐村村委会",
		"id": "310114102001208001",
		"parentid": "310114102000"
	},
	{
		"shortname": "红翔村村委会",
		"id": "310114102001209001",
		"parentid": "310114102000"
	},
	{
		"shortname": "曙光村村委会",
		"id": "310114102001210001",
		"parentid": "310114102000"
	},
	{
		"shortname": "静华村村委会",
		"id": "310114102001212001",
		"parentid": "310114102000"
	},
	{
		"shortname": "新丰村村委会",
		"id": "310114102001214001",
		"parentid": "310114102000"
	},
	{
		"shortname": "浏翔村村委会",
		"id": "310114102001218001",
		"parentid": "310114102000"
	},
	{
		"shortname": "嘉绣社区居委会（筹建）",
		"id": "310114102001807002",
		"parentid": "310114102000"
	},
	{
		"shortname": "劳动街社区居委会（筹建）",
		"id": "310114102001813001",
		"parentid": "310114102000"
	},
	{
		"shortname": "惠平社区居委会（筹建）",
		"id": "310114102001814002",
		"parentid": "310114102000"
	}, {
		"shortname": "迎春社区居委会",
		"id": "310114103001001001",
		"parentid": "310114103000"
	},
	{
		"shortname": "红梅社区居委会",
		"id": "310114103001003001",
		"parentid": "310114103000"
	},
	{
		"shortname": "紫荆社区居委会",
		"id": "310114103001005002",
		"parentid": "310114103000"
	},
	{
		"shortname": "玉兰第一社区居委会",
		"id": "310114103001007001",
		"parentid": "310114103000"
	},
	{
		"shortname": "玉兰第二社区居委会",
		"id": "310114103001008001",
		"parentid": "310114103000"
	},
	{
		"shortname": "玉兰第三社区居委会",
		"id": "310114103001009001",
		"parentid": "310114103000"
	},
	{
		"shortname": "方泰社区居委会",
		"id": "310114103001014001",
		"parentid": "310114103000"
	},
	{
		"shortname": "博泰社区居委会",
		"id": "310114103001015001",
		"parentid": "310114103000"
	},
	{
		"shortname": "新源社区居委会",
		"id": "310114103001016001",
		"parentid": "310114103000"
	},
	{
		"shortname": "沁富社区居委会",
		"id": "310114103001017001",
		"parentid": "310114103000"
	},
	{
		"shortname": "黄渡社区居委会",
		"id": "310114103001018002",
		"parentid": "310114103000"
	},
	{
		"shortname": "绿苑社区居委会",
		"id": "310114103001019002",
		"parentid": "310114103000"
	},
	{
		"shortname": "春盛苑社区居委会",
		"id": "310114103001020002",
		"parentid": "310114103000"
	},
	{
		"shortname": "莱英社区居委会",
		"id": "310114103001021002",
		"parentid": "310114103000"
	},
	{
		"shortname": "新安社区居委会",
		"id": "310114103001022001",
		"parentid": "310114103000"
	},
	{
		"shortname": "博园社区居委会",
		"id": "310114103001023001",
		"parentid": "310114103000"
	},
	{
		"shortname": "墨玉社区居委会",
		"id": "310114103001024001",
		"parentid": "310114103000"
	},
	{
		"shortname": "讴象社区居委会",
		"id": "310114103001025001",
		"parentid": "310114103000"
	},
	{
		"shortname": "陆巷社区居委会",
		"id": "310114103001026001",
		"parentid": "310114103000"
	},
	{
		"shortname": "泰顺社区居委会",
		"id": "310114103001027001",
		"parentid": "310114103000"
	},
	{
		"shortname": "泰东社区居委会",
		"id": "310114103001028001",
		"parentid": "310114103000"
	},
	{
		"shortname": "金桂社区居委会",
		"id": "310114103001029001",
		"parentid": "310114103000"
	},
	{
		"shortname": "塔庙村村委会",
		"id": "310114103001201001",
		"parentid": "310114103000"
	},
	{
		"shortname": "南安村村委会",
		"id": "310114103001202001",
		"parentid": "310114103000"
	},
	{
		"shortname": "顾浦村村委会",
		"id": "310114103001203001",
		"parentid": "310114103000"
	},
	{
		"shortname": "兰塘村村委会",
		"id": "310114103001204001",
		"parentid": "310114103000"
	},
	{
		"shortname": "向阳村村委会",
		"id": "310114103001205001",
		"parentid": "310114103000"
	},
	{
		"shortname": "火炬村村委会",
		"id": "310114103001206001",
		"parentid": "310114103000"
	},
	{
		"shortname": "新泾村村委会",
		"id": "310114103001207001",
		"parentid": "310114103000"
	},
	{
		"shortname": "前进村村委会",
		"id": "310114103001208001",
		"parentid": "310114103000"
	},
	{
		"shortname": "塘庄村村委会",
		"id": "310114103001209001",
		"parentid": "310114103000"
	},
	{
		"shortname": "林家村村委会",
		"id": "310114103001210001",
		"parentid": "310114103000"
	},
	{
		"shortname": "双浦村村委会",
		"id": "310114103001212001",
		"parentid": "310114103000"
	},
	{
		"shortname": "吕浦村村委会",
		"id": "310114103001213001",
		"parentid": "310114103000"
	},
	{
		"shortname": "水产村村委会",
		"id": "310114103001214001",
		"parentid": "310114103000"
	},
	{
		"shortname": "先锋村村委会",
		"id": "310114103001215001",
		"parentid": "310114103000"
	},
	{
		"shortname": "赵巷村村委会",
		"id": "310114103001216001",
		"parentid": "310114103000"
	},
	{
		"shortname": "星光村村委会",
		"id": "310114103001217001",
		"parentid": "310114103000"
	},
	{
		"shortname": "星明村村委会",
		"id": "310114103001218001",
		"parentid": "310114103000"
	},
	{
		"shortname": "光明村村委会",
		"id": "310114103001219001",
		"parentid": "310114103000"
	},
	{
		"shortname": "黄墙村村委会",
		"id": "310114103001220001",
		"parentid": "310114103000"
	},
	{
		"shortname": "漳浦村村委会",
		"id": "310114103001221001",
		"parentid": "310114103000"
	},
	{
		"shortname": "顾垒村村委会",
		"id": "310114103001223001",
		"parentid": "310114103000"
	},
	{
		"shortname": "方泰村村委会",
		"id": "310114103001224001",
		"parentid": "310114103000"
	},
	{
		"shortname": "陆象村村委会",
		"id": "310114103001225001",
		"parentid": "310114103000"
	},
	{
		"shortname": "讴思村村委会",
		"id": "310114103001226001",
		"parentid": "310114103000"
	},
	{
		"shortname": "水产村（方泰）村委会",
		"id": "310114103001227001",
		"parentid": "310114103000"
	},
	{
		"shortname": "西元村村委会",
		"id": "310114103001228001",
		"parentid": "310114103000"
	},
	{
		"shortname": "龚闵村村委会",
		"id": "310114103001229001",
		"parentid": "310114103000"
	},
	{
		"shortname": "泥岗村村委会",
		"id": "310114103001230003",
		"parentid": "310114103000"
	},
	{
		"shortname": "邓家角村村委会",
		"id": "310114103001231002",
		"parentid": "310114103000"
	},
	{
		"shortname": "朱家村村委会",
		"id": "310114103001232002",
		"parentid": "310114103000"
	},
	{
		"shortname": "许家村村委会",
		"id": "310114103001234002",
		"parentid": "310114103000"
	},
	{
		"shortname": "罗家村村委会",
		"id": "310114103001235002",
		"parentid": "310114103000"
	},
	{
		"shortname": "钱家村村委会",
		"id": "310114103001236002",
		"parentid": "310114103000"
	},
	{
		"shortname": "东街村村委会",
		"id": "310114103001237002",
		"parentid": "310114103000"
	},
	{
		"shortname": "黄沈村村委会",
		"id": "310114103001238002",
		"parentid": "310114103000"
	},
	{
		"shortname": "老宅村村委会",
		"id": "310114103001239002",
		"parentid": "310114103000"
	},
	{
		"shortname": "顾家村村委会",
		"id": "310114103001240002",
		"parentid": "310114103000"
	},
	{
		"shortname": "杨木桥村村委会",
		"id": "310114103001241002",
		"parentid": "310114103000"
	},
	{
		"shortname": "横河村村委会",
		"id": "310114103001242002",
		"parentid": "310114103000"
	},
	{
		"shortname": "联西村村委会",
		"id": "310114103001243002",
		"parentid": "310114103000"
	},
	{
		"shortname": "联群村村委会",
		"id": "310114103001244002",
		"parentid": "310114103000"
	},
	{
		"shortname": "星塔村村委会",
		"id": "310114103001245002",
		"parentid": "310114103000"
	},
	{
		"shortname": "方翔社区居委会（筹建）",
		"id": "310114103001806001",
		"parentid": "310114103000"
	},
	{
		"shortname": "昌吉东路筹建组（筹建）",
		"id": "310114103001807001",
		"parentid": "310114103000"
	},
	{
		"shortname": "沁乐社区居委会（筹建）",
		"id": "310114103001808001",
		"parentid": "310114103000"
	},
	{
		"shortname": "上城名都社区居委会（筹建）",
		"id": "310114103001809001",
		"parentid": "310114103000"
	},
	{
		"shortname": "西上海社区居委会（筹建）",
		"id": "310114103001810001",
		"parentid": "310114103000"
	},
	{
		"shortname": "六泉桥社区居委会（筹建）",
		"id": "310114103001811001",
		"parentid": "310114103000"
	},
	{
		"shortname": "安驰社区居委会（筹建）",
		"id": "310114103001812001",
		"parentid": "310114103000"
	},
	{
		"shortname": "沁园社区居委会（筹建）",
		"id": "310114103001813001",
		"parentid": "310114103000"
	},
	{
		"shortname": "安研社区居委会（筹建）",
		"id": "310114103001814001",
		"parentid": "310114103000"
	}, {
		"shortname": "育兰社区居委会",
		"id": "310114106001001001",
		"parentid": "310114106000"
	},
	{
		"shortname": "天马社区居委会",
		"id": "310114106001002001",
		"parentid": "310114106000"
	},
	{
		"shortname": "马陆新村居委会",
		"id": "310114106001004002",
		"parentid": "310114106000"
	},
	{
		"shortname": "戬浜社区居委会",
		"id": "310114106001006001",
		"parentid": "310114106000"
	},
	{
		"shortname": "育苑社区居委会",
		"id": "310114106001007001",
		"parentid": "310114106000"
	},
	{
		"shortname": "樊家社区居委会",
		"id": "310114106001008001",
		"parentid": "310114106000"
	},
	{
		"shortname": "包桥社区居委会",
		"id": "310114106001009001",
		"parentid": "310114106000"
	},
	{
		"shortname": "沥苑社区居委会",
		"id": "310114106001010001",
		"parentid": "310114106000"
	},
	{
		"shortname": "彭赵社区居委会",
		"id": "310114106001011001",
		"parentid": "310114106000"
	},
	{
		"shortname": "仓新社区居委会",
		"id": "310114106001012001",
		"parentid": "310114106000"
	},
	{
		"shortname": "嘉新社区居委会",
		"id": "310114106001013001",
		"parentid": "310114106000"
	},
	{
		"shortname": "洪德一坊社区居委会",
		"id": "310114106001014001",
		"parentid": "310114106000"
	},
	{
		"shortname": "远香一坊社区居委会",
		"id": "310114106001015001",
		"parentid": "310114106000"
	},
	{
		"shortname": "德立社区居委会",
		"id": "310114106001016001",
		"parentid": "310114106000"
	},
	{
		"shortname": "封周一坊社区居委会",
		"id": "310114106001017001",
		"parentid": "310114106000"
	},
	{
		"shortname": "远香二坊社区居委会",
		"id": "310114106001018001",
		"parentid": "310114106000"
	},
	{
		"shortname": "白银一坊社区居委会",
		"id": "310114106001019001",
		"parentid": "310114106000"
	},
	{
		"shortname": "崇信社区居委会",
		"id": "310114106001020001",
		"parentid": "310114106000"
	},
	{
		"shortname": "双单一坊社区居委",
		"id": "310114106001021001",
		"parentid": "310114106000"
	},
	{
		"shortname": "云谷一坊社区居委",
		"id": "310114106001022001",
		"parentid": "310114106000"
	},
	{
		"shortname": "康丰社区居委会",
		"id": "310114106001023001",
		"parentid": "310114106000"
	},
	{
		"shortname": "白银二坊社区居委会",
		"id": "310114106001024001",
		"parentid": "310114106000"
	},
	{
		"shortname": "双丁一坊社区居委会",
		"id": "310114106001025001",
		"parentid": "310114106000"
	},
	{
		"shortname": "马陆村村委会",
		"id": "310114106001201001",
		"parentid": "310114106000"
	},
	{
		"shortname": "樊家村村委会",
		"id": "310114106001202001",
		"parentid": "310114106000"
	},
	{
		"shortname": "彭赵村村委会",
		"id": "310114106001203001",
		"parentid": "310114106000"
	},
	{
		"shortname": "石冈村村委会",
		"id": "310114106001207001",
		"parentid": "310114106000"
	},
	{
		"shortname": "包桥村村委会",
		"id": "310114106001208001",
		"parentid": "310114106000"
	},
	{
		"shortname": "李家村村委会",
		"id": "310114106001209001",
		"parentid": "310114106000"
	},
	{
		"shortname": "陈村村委会",
		"id": "310114106001210001",
		"parentid": "310114106000"
	},
	{
		"shortname": "北管村村委会",
		"id": "310114106001211001",
		"parentid": "310114106000"
	},
	{
		"shortname": "仓场村村委会",
		"id": "310114106001212001",
		"parentid": "310114106000"
	},
	{
		"shortname": "新联村村委会",
		"id": "310114106001213001",
		"parentid": "310114106000"
	},
	{
		"shortname": "立新村村委会",
		"id": "310114106001214001",
		"parentid": "310114106000"
	},
	{
		"shortname": "大裕村村委会",
		"id": "310114106001216001",
		"parentid": "310114106000"
	},
	{
		"shortname": "大宏村村委会",
		"id": "310114106001217001",
		"parentid": "310114106000"
	},
	{
		"shortname": "戬浜村村委会",
		"id": "310114106001218001",
		"parentid": "310114106000"
	},
	{
		"shortname": "希望社区居委会（筹建）",
		"id": "310114106001801003",
		"parentid": "310114106000"
	},
	{
		"shortname": "白银社区居委会（筹建）",
		"id": "310114106001802002",
		"parentid": "310114106000"
	},
	{
		"shortname": "马东园区（筹建）",
		"id": "310114106001803002",
		"parentid": "310114106000"
	},
	{
		"shortname": "金沙湾社区居委会（筹建）",
		"id": "310114106001804001",
		"parentid": "310114106000"
	},
	{
		"shortname": "陆家村村委会（筹建）",
		"id": "310114106001805001",
		"parentid": "310114106000"
	},
	{
		"shortname": "众芳村村委会（筹建）",
		"id": "310114106001806001",
		"parentid": "310114106000"
	}, {
		"shortname": "徐行社区居委会",
		"id": "310114109001001001",
		"parentid": "310114109000"
	},
	{
		"shortname": "曹王社区居委会",
		"id": "310114109001002001",
		"parentid": "310114109000"
	},
	{
		"shortname": "启悦社区居委会",
		"id": "310114109001005001",
		"parentid": "310114109000"
	},
	{
		"shortname": "启源社区居委会",
		"id": "310114109001006001",
		"parentid": "310114109000"
	},
	{
		"shortname": "小庙村村委会",
		"id": "310114109001201001",
		"parentid": "310114109000"
	},
	{
		"shortname": "钱桥村村委会",
		"id": "310114109001203001",
		"parentid": "310114109000"
	},
	{
		"shortname": "徐行村村委会",
		"id": "310114109001204001",
		"parentid": "310114109000"
	},
	{
		"shortname": "大石皮村村委会",
		"id": "310114109001206001",
		"parentid": "310114109000"
	},
	{
		"shortname": "伏虎村村委会",
		"id": "310114109001210001",
		"parentid": "310114109000"
	},
	{
		"shortname": "红星村村委会",
		"id": "310114109001211001",
		"parentid": "310114109000"
	},
	{
		"shortname": "和桥村村委会",
		"id": "310114109001212001",
		"parentid": "310114109000"
	},
	{
		"shortname": "曹王村村委会",
		"id": "310114109001214001",
		"parentid": "310114109000"
	},
	{
		"shortname": "安新村村委会",
		"id": "310114109001217001",
		"parentid": "310114109000"
	},
	{
		"shortname": "劳动村村委会",
		"id": "310114109001219001",
		"parentid": "310114109000"
	}, {
		"shortname": "袁家桥社区居委会",
		"id": "310114111001001001",
		"parentid": "310114111000"
	},
	{
		"shortname": "沁园社区居委会",
		"id": "310114111001002001",
		"parentid": "310114111000"
	},
	{
		"shortname": "华旺社区居委会",
		"id": "310114111001003001",
		"parentid": "310114111000"
	},
	{
		"shortname": "联一村村委会",
		"id": "310114111001201001",
		"parentid": "310114111000"
	},
	{
		"shortname": "联三村村委会",
		"id": "310114111001203001",
		"parentid": "310114111000"
	},
	{
		"shortname": "北新村村委会",
		"id": "310114111001209001",
		"parentid": "310114111000"
	},
	{
		"shortname": "华亭村村委会",
		"id": "310114111001210001",
		"parentid": "310114111000"
	},
	{
		"shortname": "金吕村村委会",
		"id": "310114111001211001",
		"parentid": "310114111000"
	},
	{
		"shortname": "塔桥村村委会",
		"id": "310114111001214001",
		"parentid": "310114111000"
	},
	{
		"shortname": "连俊村村委会",
		"id": "310114111001216001",
		"parentid": "310114111000"
	},
	{
		"shortname": "双塘村村委会",
		"id": "310114111001218001",
		"parentid": "310114111000"
	},
	{
		"shortname": "毛桥村村委会",
		"id": "310114111001220001",
		"parentid": "310114111000"
	},
	{
		"shortname": "唐行村村委会",
		"id": "310114111001221001",
		"parentid": "310114111000"
	},
	{
		"shortname": "杏花社区居委会",
		"id": "310114114001002001",
		"parentid": "310114114000"
	},
	{
		"shortname": "外冈新苑社区居委会",
		"id": "310114114001003001",
		"parentid": "310114114000"
	},
	{
		"shortname": "佳苑社区居委会",
		"id": "310114114001004002",
		"parentid": "310114114000"
	},
	{
		"shortname": "兰郡社区居委会",
		"id": "310114114001005001",
		"parentid": "310114114000"
	},
	{
		"shortname": "景苑第一社区居委会",
		"id": "310114114001006001",
		"parentid": "310114114000"
	},
	{
		"shortname": "冈峰村村委会",
		"id": "310114114001202001",
		"parentid": "310114114000"
	},
	{
		"shortname": "外冈村村委会",
		"id": "310114114001203001",
		"parentid": "310114114000"
	},
	{
		"shortname": "管家村村委会",
		"id": "310114114001204001",
		"parentid": "310114114000"
	},
	{
		"shortname": "施晋村村委会",
		"id": "310114114001205001",
		"parentid": "310114114000"
	},
	{
		"shortname": "陈周村村委会",
		"id": "310114114001206001",
		"parentid": "310114114000"
	},
	{
		"shortname": "徐秦村村委会",
		"id": "310114114001207001",
		"parentid": "310114114000"
	},
	{
		"shortname": "大陆村村委会",
		"id": "310114114001208001",
		"parentid": "310114114000"
	},
	{
		"shortname": "北龚村村委会",
		"id": "310114114001209001",
		"parentid": "310114114000"
	},
	{
		"shortname": "甘柏村村委会",
		"id": "310114114001211001",
		"parentid": "310114114000"
	},
	{
		"shortname": "葛隆村村委会",
		"id": "310114114001212001",
		"parentid": "310114114000"
	},
	{
		"shortname": "古塘村村委会",
		"id": "310114114001215001",
		"parentid": "310114114000"
	},
	{
		"shortname": "泉泾村村委会",
		"id": "310114114001217002",
		"parentid": "310114114000"
	},
	{
		"shortname": "中泾村村委会",
		"id": "310114114001218001",
		"parentid": "310114114000"
	},
	{
		"shortname": "望新村村委会",
		"id": "310114114001219001",
		"parentid": "310114114000"
	},
	{
		"shortname": "周泾村村委会",
		"id": "310114114001220001",
		"parentid": "310114114000"
	},
	{
		"shortname": "杨甸村村委会",
		"id": "310114114001221001",
		"parentid": "310114114000"
	},
	{
		"shortname": "长泾村村委会",
		"id": "310114114001222001",
		"parentid": "310114114000"
	},
	{
		"shortname": "马门村村委会",
		"id": "310114114001223001",
		"parentid": "310114114000"
	},
	{
		"shortname": "巨门村村委会",
		"id": "310114114001224001",
		"parentid": "310114114000"
	}, {
		"shortname": "曹安社区居委会",
		"id": "310114118001001001",
		"parentid": "310114118000"
	},
	{
		"shortname": "江宁社区居委会",
		"id": "310114118001002001",
		"parentid": "310114118000"
	},
	{
		"shortname": "江安社区居委会",
		"id": "310114118001003001",
		"parentid": "310114118000"
	},
	{
		"shortname": "杨柳社区居委会",
		"id": "310114118001005001",
		"parentid": "310114118000"
	},
	{
		"shortname": "江丰社区居委会",
		"id": "310114118001008001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金华社区居委会",
		"id": "310114118001009001",
		"parentid": "310114118000"
	},
	{
		"shortname": "恒嘉社区居委会",
		"id": "310114118001010001",
		"parentid": "310114118000"
	},
	{
		"shortname": "封杨社区居委会",
		"id": "310114118001011001",
		"parentid": "310114118000"
	},
	{
		"shortname": "富友社区居委会",
		"id": "310114118001012001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉城社区居委会",
		"id": "310114118001013001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉怡社区居委会",
		"id": "310114118001014001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金岸社区居委会",
		"id": "310114118001015001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉华社区居委会",
		"id": "310114118001016001",
		"parentid": "310114118000"
	},
	{
		"shortname": "江华社区居委会",
		"id": "310114118001017001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金桥社区居委会",
		"id": "310114118001018001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金中社区居委会",
		"id": "310114118001019001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金莱社区居委会",
		"id": "310114118001020001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金旺社区居委会",
		"id": "310114118001021001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金园社区居委会",
		"id": "310114118001022001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉川社区居委会",
		"id": "310114118001023001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉星社区居委会",
		"id": "310114118001024001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉航社区居委会",
		"id": "310114118001025001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金佳社区居委会",
		"id": "310114118001026001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金水社区居委会",
		"id": "310114118001027001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金虹社区居委会",
		"id": "310114118001028001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金城社区居委会",
		"id": "310114118001029001",
		"parentid": "310114118000"
	},
	{
		"shortname": "绿一社区居委会",
		"id": "310114118001030001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉禧社区居委会",
		"id": "310114118001031001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金德社区居委会",
		"id": "310114118001032001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉封社区居委会",
		"id": "310114118001033001",
		"parentid": "310114118000"
	},
	{
		"shortname": "绿二社区居委会",
		"id": "310114118001034001",
		"parentid": "310114118000"
	},
	{
		"shortname": "绿三社区居委会",
		"id": "310114118001035001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金达社区居委会",
		"id": "310114118001036001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉豪社区居委会",
		"id": "310114118001037001",
		"parentid": "310114118000"
	},
	{
		"shortname": "金耀社区居委会",
		"id": "310114118001038001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉涛社区居委会",
		"id": "310114118001039001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉蓝社区居委会",
		"id": "310114118001040001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉海社区居委会",
		"id": "310114118001041001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉峪社区居委会",
		"id": "310114118001042001",
		"parentid": "310114118000"
	},
	{
		"shortname": "江佳社区居委会",
		"id": "310114118001043001",
		"parentid": "310114118000"
	},
	{
		"shortname": "高潮村村委会",
		"id": "310114118001203001",
		"parentid": "310114118000"
	},
	{
		"shortname": "幸福村村委会",
		"id": "310114118001204001",
		"parentid": "310114118000"
	},
	{
		"shortname": "五四村村委会",
		"id": "310114118001205001",
		"parentid": "310114118000"
	},
	{
		"shortname": "沙河村村委会",
		"id": "310114118001207001",
		"parentid": "310114118000"
	},
	{
		"shortname": "华庄村村委会",
		"id": "310114118001208001",
		"parentid": "310114118000"
	},
	{
		"shortname": "建华村村委会",
		"id": "310114118001209001",
		"parentid": "310114118000"
	},
	{
		"shortname": "火线村村委会",
		"id": "310114118001211001",
		"parentid": "310114118000"
	},
	{
		"shortname": "太平村村委会",
		"id": "310114118001212001",
		"parentid": "310114118000"
	},
	{
		"shortname": "红光村村委会",
		"id": "310114118001214001",
		"parentid": "310114118000"
	},
	{
		"shortname": "年丰村村委会",
		"id": "310114118001216001",
		"parentid": "310114118000"
	},
	{
		"shortname": "新江村村委会",
		"id": "310114118001217001",
		"parentid": "310114118000"
	},
	{
		"shortname": "封浜村村委会",
		"id": "310114118001218001",
		"parentid": "310114118000"
	},
	{
		"shortname": "增建村村委会",
		"id": "310114118001219001",
		"parentid": "310114118000"
	},
	{
		"shortname": "新华村村委会",
		"id": "310114118001223001",
		"parentid": "310114118000"
	},
	{
		"shortname": "先农村村委会",
		"id": "310114118001225001",
		"parentid": "310114118000"
	},
	{
		"shortname": "星火村村委会",
		"id": "310114118001227001",
		"parentid": "310114118000"
	},
	{
		"shortname": "江桥中心村（筹建）",
		"id": "310114118001809001",
		"parentid": "310114118000"
	},
	{
		"shortname": "嘉远社区居委会（筹建）",
		"id": "310114118001834001",
		"parentid": "310114118000"
	}, {
		"shortname": "庆阳社区居委会",
		"id": "310114501001001002",
		"parentid": "310114501000"
	},
	{
		"shortname": "凤池社区居委会",
		"id": "310114501001003001",
		"parentid": "310114501000"
	},
	{
		"shortname": "福蕴社区居委会",
		"id": "310114501001009001",
		"parentid": "310114501000"
	},
	{
		"shortname": "民乐社区居委会",
		"id": "310114501001010001",
		"parentid": "310114501000"
	},
	{
		"shortname": "横沥社区居委会",
		"id": "310114501001012001",
		"parentid": "310114501000"
	},
	{
		"shortname": "永盛社区居委会",
		"id": "310114501001013001",
		"parentid": "310114501000"
	},
	{
		"shortname": "胜辛社区居委会",
		"id": "310114501001014001",
		"parentid": "310114501000"
	},
	{
		"shortname": "新宝社区居委会",
		"id": "310114501001015001",
		"parentid": "310114501000"
	},
	{
		"shortname": "越华社区居委会",
		"id": "310114501001016001",
		"parentid": "310114501000"
	},
	{
		"shortname": "天华社区居委会",
		"id": "310114501001017001",
		"parentid": "310114501000"
	},
	{
		"shortname": "裕民社区居委会",
		"id": "310114501001018001",
		"parentid": "310114501000"
	},
	{
		"shortname": "汇旺社区居委会",
		"id": "310114501001019001",
		"parentid": "310114501000"
	},
	{
		"shortname": "辛勤村村委会",
		"id": "310114501001201001",
		"parentid": "310114501000"
	},
	{
		"shortname": "牌楼村村委会",
		"id": "310114501001202001",
		"parentid": "310114501000"
	},
	{
		"shortname": "群裕村村委会",
		"id": "310114501001204001",
		"parentid": "310114501000"
	},
	{
		"shortname": "胜利村村委会",
		"id": "310114501001205001",
		"parentid": "310114501000"
	},
	{
		"shortname": "虬桥村村委会",
		"id": "310114501001206001",
		"parentid": "310114501000"
	},
	{
		"shortname": "现龙村村委会",
		"id": "310114501001207001",
		"parentid": "310114501000"
	},
	{
		"shortname": "娄塘社区居委会",
		"id": "310114501001808002",
		"parentid": "310114501000"
	},
	{
		"shortname": "娄塘村村委会",
		"id": "310114501001809002",
		"parentid": "310114501000"
	},
	{
		"shortname": "泾河村村委会",
		"id": "310114501001811001",
		"parentid": "310114501000"
	},
	{
		"shortname": "赵厅村村委会",
		"id": "310114501001812001",
		"parentid": "310114501000"
	},
	{
		"shortname": "娄东村村委会",
		"id": "310114501001813001",
		"parentid": "310114501000"
	},
	{
		"shortname": "草庵村村委会",
		"id": "310114501001814001",
		"parentid": "310114501000"
	},
	{
		"shortname": "陆渡村村委会",
		"id": "310114501001815001",
		"parentid": "310114501000"
	},
	{
		"shortname": "灯塔村村委会",
		"id": "310114501001816001",
		"parentid": "310114501000"
	},
	{
		"shortname": "竹桥村村委会",
		"id": "310114501001817001",
		"parentid": "310114501000"
	},
	{
		"shortname": "雨化村村委会",
		"id": "310114501001818001",
		"parentid": "310114501000"
	},
	{
		"shortname": "旺泾村村委会",
		"id": "310114501001819001",
		"parentid": "310114501000"
	},
	{
		"shortname": "朱家桥村村委会",
		"id": "310114501001820001",
		"parentid": "310114501000"
	},
	{
		"shortname": "黎明村村委会",
		"id": "310114501001821001",
		"parentid": "310114501000"
	},
	{
		"shortname": "白墙村村委会",
		"id": "310114501001823001",
		"parentid": "310114501000"
	},
	{
		"shortname": "三里村村委会",
		"id": "310114501001824001",
		"parentid": "310114501000"
	},
	{
		"shortname": "汇珠社区居委会",
		"id": "310114501001829001",
		"parentid": "310114501000"
	},
	{
		"shortname": "汇源社区居委会（筹建）",
		"id": "310114501001831001",
		"parentid": "310114501000"
	},
	{
		"shortname": "绿洲丰怡园社区居委会（筹建）",
		"id": "310114501001832001",
		"parentid": "310114501000"
	},
	{
		"shortname": "景河名苑社区居委会 （筹建）",
		"id": "310114501001833001",
		"parentid": "310114501000"
	},
	{
		"shortname": "梧桐坊社区居委会（筹建）",
		"id": "310114501001834001",
		"parentid": "310114501000"
	},
	{
		"shortname": "蔷薇苑社区居委会（筹建）",
		"id": "310114501001835001",
		"parentid": "310114501000"
	},
	{
		"shortname": "同盛园区居委会（筹建）",
		"id": "310114501001836001",
		"parentid": "310114501000"
	}, {
		"shortname": "潍坊一村居委会",
		"id": "310115004001001001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊二村居委会",
		"id": "310115004001002001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊三村居委会",
		"id": "310115004001003001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊四村居委会",
		"id": "310115004001004001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊五村居委会",
		"id": "310115004001005001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊六七村居委会",
		"id": "310115004001007001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊八村居委会",
		"id": "310115004001008001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊九村居委会",
		"id": "310115004001009001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊十村第一居委会",
		"id": "310115004001010001",
		"parentid": "310115004000"
	},
	{
		"shortname": "潍坊十村第二居委会",
		"id": "310115004001011002",
		"parentid": "310115004000"
	},
	{
		"shortname": "竹园居委会",
		"id": "310115004001012001",
		"parentid": "310115004000"
	},
	{
		"shortname": "源竹居委会",
		"id": "310115004001013001",
		"parentid": "310115004000"
	},
	{
		"shortname": "竹南居委会",
		"id": "310115004001014001",
		"parentid": "310115004000"
	},
	{
		"shortname": "福竹居委会",
		"id": "310115004001015001",
		"parentid": "310115004000"
	},
	{
		"shortname": "张杨居委会",
		"id": "310115004001016001",
		"parentid": "310115004000"
	},
	{
		"shortname": "朱家滩居委会",
		"id": "310115004001017001",
		"parentid": "310115004000"
	},
	{
		"shortname": "泉东第一居委会",
		"id": "310115004001018001",
		"parentid": "310115004000"
	},
	{
		"shortname": "王家宅居委会",
		"id": "310115004001019001",
		"parentid": "310115004000"
	},
	{
		"shortname": "崂山东路居委会",
		"id": "310115004001020001",
		"parentid": "310115004000"
	},
	{
		"shortname": "杨家渡居委会",
		"id": "310115004001021001",
		"parentid": "310115004000"
	},
	{
		"shortname": "张家浜居委会",
		"id": "310115004001022001",
		"parentid": "310115004000"
	},
	{
		"shortname": "谢家宅居委会",
		"id": "310115004001027001",
		"parentid": "310115004000"
	},
	{
		"shortname": "陈家宅居委会",
		"id": "310115004001029001",
		"parentid": "310115004000"
	},
	{
		"shortname": "东南居委会",
		"id": "310115004001030001",
		"parentid": "310115004000"
	},
	{
		"shortname": "泉东第二居委会",
		"id": "310115004001032001",
		"parentid": "310115004000"
	},
	{
		"shortname": "香榭丽居委会",
		"id": "310115004001033001",
		"parentid": "310115004000"
	},
	{
		"shortname": "世茂滨江第一居委会",
		"id": "310115004001034001",
		"parentid": "310115004000"
	}, {
		"shortname": "梅园一村居委会",
		"id": "310115005001001001",
		"parentid": "310115005000"
	},
	{
		"shortname": "梅园三村居委会",
		"id": "310115005001003001",
		"parentid": "310115005000"
	},
	{
		"shortname": "市新居委会",
		"id": "310115005001005001",
		"parentid": "310115005000"
	},
	{
		"shortname": "隧成居委会",
		"id": "310115005001009001",
		"parentid": "310115005000"
	},
	{
		"shortname": "福沈居委会",
		"id": "310115005001010001",
		"parentid": "310115005000"
	},
	{
		"shortname": "福山居委会",
		"id": "310115005001011001",
		"parentid": "310115005000"
	},
	{
		"shortname": "光辉居委会",
		"id": "310115005001012001",
		"parentid": "310115005000"
	},
	{
		"shortname": "松山居委会",
		"id": "310115005001013001",
		"parentid": "310115005000"
	},
	{
		"shortname": "陈家门居委会",
		"id": "310115005001014001",
		"parentid": "310115005000"
	},
	{
		"shortname": "林山居委会",
		"id": "310115005001016001",
		"parentid": "310115005000"
	},
	{
		"shortname": "东昌居委会",
		"id": "310115005001018001",
		"parentid": "310115005000"
	},
	{
		"shortname": "荣城居委会",
		"id": "310115005001019001",
		"parentid": "310115005000"
	},
	{
		"shortname": "昌邑路居委会",
		"id": "310115005001034001",
		"parentid": "310115005000"
	},
	{
		"shortname": "上港新村居委会",
		"id": "310115005001035001",
		"parentid": "310115005000"
	},
	{
		"shortname": "招远路居委会",
		"id": "310115005001036001",
		"parentid": "310115005000"
	},
	{
		"shortname": "三航居委会",
		"id": "310115005001037001",
		"parentid": "310115005000"
	},
	{
		"shortname": "崂山一村居委会",
		"id": "310115005001038001",
		"parentid": "310115005000"
	},
	{
		"shortname": "崂山二村居委会",
		"id": "310115005001039001",
		"parentid": "310115005000"
	},
	{
		"shortname": "崂山三村居委会",
		"id": "310115005001040001",
		"parentid": "310115005000"
	},
	{
		"shortname": "崂山五村居委会",
		"id": "310115005001042001",
		"parentid": "310115005000"
	},
	{
		"shortname": "崂山六村居委会",
		"id": "310115005001043001",
		"parentid": "310115005000"
	},
	{
		"shortname": "乳山二村居委会",
		"id": "310115005001045001",
		"parentid": "310115005000"
	},
	{
		"shortname": "乳山四村居委会",
		"id": "310115005001047001",
		"parentid": "310115005000"
	},
	{
		"shortname": "乳山五村居委会",
		"id": "310115005001048001",
		"parentid": "310115005000"
	},
	{
		"shortname": "仁恒滨江园居委会",
		"id": "310115005001049001",
		"parentid": "310115005000"
	},
	{
		"shortname": "江临天下居委会",
		"id": "310115005001050001",
		"parentid": "310115005000"
	},
	{
		"shortname": "菊园居委会",
		"id": "310115005001051001",
		"parentid": "310115005000"
	},
	{
		"shortname": "浦江茗园居委会",
		"id": "310115005001052001",
		"parentid": "310115005000"
	},
	{
		"shortname": "东园新村一居委会",
		"id": "310115005001053001",
		"parentid": "310115005000"
	},
	{
		"shortname": "东园新村二居委会",
		"id": "310115005001054001",
		"parentid": "310115005000"
	},
	{
		"shortname": "滨江居委会",
		"id": "310115005001055001",
		"parentid": "310115005000"
	}, {
		"shortname": "上南一村居委会",
		"id": "310115007001001001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南二村居委会",
		"id": "310115007001003001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南三村居委会",
		"id": "310115007001005001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南四村居委会",
		"id": "310115007001007001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南五村居委会",
		"id": "310115007001008001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南六村居委会",
		"id": "310115007001010001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南七村居委会",
		"id": "310115007001012001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南八村居委会",
		"id": "310115007001013001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南九村居委会",
		"id": "310115007001015001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南十村一居委会",
		"id": "310115007001016001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南十村二居委会",
		"id": "310115007001017001",
		"parentid": "310115007000"
	},
	{
		"shortname": "雪野二村居委会",
		"id": "310115007001020001",
		"parentid": "310115007000"
	},
	{
		"shortname": "齐河第一居委会",
		"id": "310115007001023001",
		"parentid": "310115007000"
	},
	{
		"shortname": "齐河第二居委会",
		"id": "310115007001024001",
		"parentid": "310115007000"
	},
	{
		"shortname": "齐河第三居委会",
		"id": "310115007001025001",
		"parentid": "310115007000"
	},
	{
		"shortname": "齐河第八居委会",
		"id": "310115007001026001",
		"parentid": "310115007000"
	},
	{
		"shortname": "云台路一居委会",
		"id": "310115007001027001",
		"parentid": "310115007000"
	},
	{
		"shortname": "云台路二居委会",
		"id": "310115007001028001",
		"parentid": "310115007000"
	},
	{
		"shortname": "昌里路四居委会",
		"id": "310115007001029001",
		"parentid": "310115007000"
	},
	{
		"shortname": "昌里路五居委会",
		"id": "310115007001030001",
		"parentid": "310115007000"
	},
	{
		"shortname": "昌里路七居委会",
		"id": "310115007001031001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南十一村居委会",
		"id": "310115007001034001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南十二村居委会",
		"id": "310115007001035001",
		"parentid": "310115007000"
	},
	{
		"shortname": "云莲路一居委会",
		"id": "310115007001036001",
		"parentid": "310115007000"
	},
	{
		"shortname": "齐河路第七居委会",
		"id": "310115007001037001",
		"parentid": "310115007000"
	},
	{
		"shortname": "昌里花园居委会",
		"id": "310115007001038001",
		"parentid": "310115007000"
	},
	{
		"shortname": "齐河第四居委会",
		"id": "310115007001039001",
		"parentid": "310115007000"
	},
	{
		"shortname": "都市庭院居委会",
		"id": "310115007001040001",
		"parentid": "310115007000"
	},
	{
		"shortname": "川新居委会",
		"id": "310115007001041001",
		"parentid": "310115007000"
	},
	{
		"shortname": "上南花苑居委会",
		"id": "310115007001042001",
		"parentid": "310115007000"
	},
	{
		"shortname": "恒大居委会",
		"id": "310115007001043001",
		"parentid": "310115007000"
	},
	{
		"shortname": "齐河路第五居委会",
		"id": "310115007001044001",
		"parentid": "310115007000"
	},
	{
		"shortname": "微山新村居委会",
		"id": "310115008001001001",
		"parentid": "310115008000"
	},
	{
		"shortname": "微南居委会",
		"id": "310115008001002001",
		"parentid": "310115008000"
	},
	{
		"shortname": "宁阳路居委会",
		"id": "310115008001003001",
		"parentid": "310115008000"
	},
	{
		"shortname": "茂兴路居委会",
		"id": "310115008001004001",
		"parentid": "310115008000"
	},
	{
		"shortname": "香花桥街居委会",
		"id": "310115008001005001",
		"parentid": "310115008000"
	},
	{
		"shortname": "浦建路居委会",
		"id": "310115008001006001",
		"parentid": "310115008000"
	},
	{
		"shortname": "塘桥居委会",
		"id": "310115008001007001",
		"parentid": "310115008000"
	},
	{
		"shortname": "文兰居委会",
		"id": "310115008001008001",
		"parentid": "310115008000"
	},
	{
		"shortname": "胡家木桥居委会",
		"id": "310115008001009001",
		"parentid": "310115008000"
	},
	{
		"shortname": "南泉路居委会",
		"id": "310115008001011001",
		"parentid": "310115008000"
	},
	{
		"shortname": "蓝村居委会",
		"id": "310115008001013001",
		"parentid": "310115008000"
	},
	{
		"shortname": "兰高居委会",
		"id": "310115008001014001",
		"parentid": "310115008000"
	},
	{
		"shortname": "塘东居委会",
		"id": "310115008001015001",
		"parentid": "310115008000"
	},
	{
		"shortname": "南浦居委会",
		"id": "310115008001016001",
		"parentid": "310115008000"
	},
	{
		"shortname": "兰东居委会",
		"id": "310115008001017001",
		"parentid": "310115008000"
	},
	{
		"shortname": "金浦居委会",
		"id": "310115008001019001",
		"parentid": "310115008000"
	},
	{
		"shortname": "龙阳路居委会",
		"id": "310115008001020001",
		"parentid": "310115008000"
	},
	{
		"shortname": "南城居委会",
		"id": "310115008001021001",
		"parentid": "310115008000"
	},
	{
		"shortname": "东方居委会",
		"id": "310115008001022001",
		"parentid": "310115008000"
	},
	{
		"shortname": "怡东居委会",
		"id": "310115008001023001",
		"parentid": "310115008000"
	},
	{
		"shortname": "贵龙居委会",
		"id": "310115008001024001",
		"parentid": "310115008000"
	},
	{
		"shortname": "龙园居委会",
		"id": "310115008001025001",
		"parentid": "310115008000"
	},
	{
		"shortname": "富都居委会",
		"id": "310115008001026001",
		"parentid": "310115008000"
	},
	{
		"shortname": "上钢一村居委会",
		"id": "310115009001001001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢二村居委会",
		"id": "310115009001002001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢三村居委会",
		"id": "310115009001003001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢四村居委会",
		"id": "310115009001004001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢五村居委会",
		"id": "310115009001005001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢六村居委会",
		"id": "310115009001006001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢七村居委会",
		"id": "310115009001007001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢九村居委会",
		"id": "310115009001008001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上钢十村居委会",
		"id": "310115009001009001",
		"parentid": "310115009000"
	},
	{
		"shortname": "德州一村居委会",
		"id": "310115009001010001",
		"parentid": "310115009000"
	},
	{
		"shortname": "德州二村居委会",
		"id": "310115009001011001",
		"parentid": "310115009000"
	},
	{
		"shortname": "德州三村居委会",
		"id": "310115009001012001",
		"parentid": "310115009000"
	},
	{
		"shortname": "德州四村居委会",
		"id": "310115009001013001",
		"parentid": "310115009000"
	},
	{
		"shortname": "德州五村居委会",
		"id": "310115009001014001",
		"parentid": "310115009000"
	},
	{
		"shortname": "德州六村居委会",
		"id": "310115009001015001",
		"parentid": "310115009000"
	},
	{
		"shortname": "德州七村居委会",
		"id": "310115009001016001",
		"parentid": "310115009000"
	},
	{
		"shortname": "济阳一村居委会",
		"id": "310115009001018001",
		"parentid": "310115009000"
	},
	{
		"shortname": "济阳二村居委会",
		"id": "310115009001020001",
		"parentid": "310115009000"
	},
	{
		"shortname": "济阳三村居委会",
		"id": "310115009001021001",
		"parentid": "310115009000"
	},
	{
		"shortname": "耀华路第一村居委会",
		"id": "310115009001026001",
		"parentid": "310115009000"
	},
	{
		"shortname": "济中村居委会",
		"id": "310115009001028001",
		"parentid": "310115009000"
	},
	{
		"shortname": "耀华路第三村居委会",
		"id": "310115009001031001",
		"parentid": "310115009000"
	},
	{
		"shortname": "上南花城居委会",
		"id": "310115009001033001",
		"parentid": "310115009000"
	}, {
		"shortname": "西三里桥居委会",
		"id": "310115010001001001",
		"parentid": "310115010000"
	},
	{
		"shortname": "塘南居委会",
		"id": "310115010001002001",
		"parentid": "310115010000"
	},
	{
		"shortname": "银河居委会",
		"id": "310115010001003001",
		"parentid": "310115010000"
	},
	{
		"shortname": "沂南路居委会",
		"id": "310115010001004001",
		"parentid": "310115010000"
	},
	{
		"shortname": "东三里桥居委会",
		"id": "310115010001005001",
		"parentid": "310115010000"
	},
	{
		"shortname": "胶南路居委会",
		"id": "310115010001006001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂一村居委会",
		"id": "310115010001007001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂二村居委会",
		"id": "310115010001008001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂三村居委会",
		"id": "310115010001009001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂五村居委会",
		"id": "310115010001011001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂八村第一居委会",
		"id": "310115010001014001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂八村第二居委会",
		"id": "310115010001015001",
		"parentid": "310115010000"
	},
	{
		"shortname": "新桥居委会",
		"id": "310115010001016001",
		"parentid": "310115010000"
	},
	{
		"shortname": "港机新村居委会",
		"id": "310115010001017001",
		"parentid": "310115010000"
	},
	{
		"shortname": "鹏欣居委会",
		"id": "310115010001021001",
		"parentid": "310115010000"
	},
	{
		"shortname": "金星居委会",
		"id": "310115010001022001",
		"parentid": "310115010000"
	},
	{
		"shortname": "建业居委会",
		"id": "310115010001024001",
		"parentid": "310115010000"
	},
	{
		"shortname": "东盛居委会",
		"id": "310115010001025001",
		"parentid": "310115010000"
	},
	{
		"shortname": "六里第一居委会",
		"id": "310115010001026001",
		"parentid": "310115010000"
	},
	{
		"shortname": "六里第二居委会",
		"id": "310115010001027001",
		"parentid": "310115010000"
	},
	{
		"shortname": "六里第三居委会",
		"id": "310115010001028001",
		"parentid": "310115010000"
	},
	{
		"shortname": "六里第四居委会",
		"id": "310115010001029001",
		"parentid": "310115010000"
	},
	{
		"shortname": "龙馥居委会",
		"id": "310115010001030001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂六村居委会",
		"id": "310115010001031001",
		"parentid": "310115010000"
	},
	{
		"shortname": "临沂七村居委会",
		"id": "310115010001032001",
		"parentid": "310115010000"
	},
	{
		"shortname": "东方城市花园居委会",
		"id": "310115010001033001",
		"parentid": "310115010000"
	},
	{
		"shortname": "六里第五居委会",
		"id": "310115010001034001",
		"parentid": "310115010000"
	}, {
		"shortname": "沪东新村一居委会",
		"id": "310115011001001001",
		"parentid": "310115011000"
	},
	{
		"shortname": "沪东新村二居委会",
		"id": "310115011001002001",
		"parentid": "310115011000"
	},
	{
		"shortname": "沪新居委会",
		"id": "310115011001004001",
		"parentid": "310115011000"
	},
	{
		"shortname": "沪南居委会",
		"id": "310115011001006001",
		"parentid": "310115011000"
	},
	{
		"shortname": "船舶新村居委会",
		"id": "310115011001007001",
		"parentid": "310115011000"
	},
	{
		"shortname": "向东新村居委会",
		"id": "310115011001008001",
		"parentid": "310115011000"
	},
	{
		"shortname": "北小区居委会",
		"id": "310115011001009001",
		"parentid": "310115011000"
	},
	{
		"shortname": "朱家门居委会",
		"id": "310115011001010001",
		"parentid": "310115011000"
	},
	{
		"shortname": "陈家宅居委会",
		"id": "310115011001012001",
		"parentid": "310115011000"
	},
	{
		"shortname": "寿光路一居委会",
		"id": "310115011001013001",
		"parentid": "310115011000"
	},
	{
		"shortname": "寿光路二居委会",
		"id": "310115011001014001",
		"parentid": "310115011000"
	},
	{
		"shortname": "博兴路一居委会",
		"id": "310115011001016001",
		"parentid": "310115011000"
	},
	{
		"shortname": "博兴路三居委会",
		"id": "310115011001022001",
		"parentid": "310115011000"
	},
	{
		"shortname": "柳博居委会",
		"id": "310115011001023001",
		"parentid": "310115011000"
	},
	{
		"shortname": "金桥花苑居委会",
		"id": "310115011001024001",
		"parentid": "310115011000"
	},
	{
		"shortname": "东波苑第二居委会",
		"id": "310115011001025001",
		"parentid": "310115011000"
	},
	{
		"shortname": "东波苑第三居委会",
		"id": "310115011001026001",
		"parentid": "310115011000"
	},
	{
		"shortname": "东波苑第四居委会",
		"id": "310115011001027001",
		"parentid": "310115011000"
	},
	{
		"shortname": "东波苑第六居委会",
		"id": "310115011001029001",
		"parentid": "310115011000"
	},
	{
		"shortname": "江南山水居委会",
		"id": "310115011001030001",
		"parentid": "310115011000"
	},
	{
		"shortname": "莱阳新家园居委会",
		"id": "310115011001031001",
		"parentid": "310115011000"
	},
	{
		"shortname": "伟莱家园居委会",
		"id": "310115011001032001",
		"parentid": "310115011000"
	},
	{
		"shortname": "金浦居委会",
		"id": "310115011001033001",
		"parentid": "310115011000"
	},
	{
		"shortname": "汇佳苑居委会",
		"id": "310115011001034001",
		"parentid": "310115011000"
	},
	{
		"shortname": "伟业居委会",
		"id": "310115011001035001",
		"parentid": "310115011000"
	},
	{
		"shortname": "伟锦居委会",
		"id": "310115011001036001",
		"parentid": "310115011000"
	},
	{
		"shortname": "璞爱居委会",
		"id": "310115011001037001",
		"parentid": "310115011000"
	},
	{
		"shortname": "同方锦城居委会",
		"id": "310115011001038001",
		"parentid": "310115011000"
	},
	{
		"shortname": "长岛苑居委会",
		"id": "310115011001039001",
		"parentid": "310115011000"
	},
	{
		"shortname": "锦河苑居委会",
		"id": "310115011001040001",
		"parentid": "310115011000"
	},
	{
		"shortname": "东方丽景居委会",
		"id": "310115011001041001",
		"parentid": "310115011000"
	},
	{
		"shortname": "兰城居委会",
		"id": "310115011001042001",
		"parentid": "310115011000"
	}, {
		"shortname": "金杨路二居委会",
		"id": "310115012001001001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金杨路六居委会",
		"id": "310115012001004001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金杨路七居委会",
		"id": "310115012001005001",
		"parentid": "310115012000"
	},
	{
		"shortname": "银山路三居委会",
		"id": "310115012001007001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金口路一居委会",
		"id": "310115012001008001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金口路二居委会",
		"id": "310115012001009001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金台路一居委会",
		"id": "310115012001010001",
		"parentid": "310115012000"
	},
	{
		"shortname": "枣庄路一居委会",
		"id": "310115012001011001",
		"parentid": "310115012000"
	},
	{
		"shortname": "灵山路三居委会",
		"id": "310115012001013001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金杨路一居委会",
		"id": "310115012001014001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金杨路八居委会",
		"id": "310115012001016001",
		"parentid": "310115012000"
	},
	{
		"shortname": "银山路四居委会",
		"id": "310115012001017001",
		"parentid": "310115012000"
	},
	{
		"shortname": "灵山路一居委会",
		"id": "310115012001018001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山一村居委会",
		"id": "310115012001019001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山二村居委会",
		"id": "310115012001020001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山三村一居委会",
		"id": "310115012001021001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山三村二居委会",
		"id": "310115012001022001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山四村居委会",
		"id": "310115012001024001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山五村居委会",
		"id": "310115012001025001",
		"parentid": "310115012000"
	},
	{
		"shortname": "香山新村一居委会",
		"id": "310115012001027001",
		"parentid": "310115012000"
	},
	{
		"shortname": "香山新村七居委会",
		"id": "310115012001028001",
		"parentid": "310115012000"
	},
	{
		"shortname": "庆宁寺居委会",
		"id": "310115012001029001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金台路第二居委会",
		"id": "310115012001030001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金台路第三居委会",
		"id": "310115012001031001",
		"parentid": "310115012000"
	},
	{
		"shortname": "香山新村第三居委会",
		"id": "310115012001032001",
		"parentid": "310115012000"
	},
	{
		"shortname": "香山新村第四居委会",
		"id": "310115012001033001",
		"parentid": "310115012000"
	},
	{
		"shortname": "黄山新村二居委会",
		"id": "310115012001034001",
		"parentid": "310115012000"
	},
	{
		"shortname": "仁和居委会",
		"id": "310115012001036001",
		"parentid": "310115012000"
	},
	{
		"shortname": "银山路第五居委会",
		"id": "310115012001037001",
		"parentid": "310115012000"
	},
	{
		"shortname": "始信苑居委会",
		"id": "310115012001038001",
		"parentid": "310115012000"
	},
	{
		"shortname": "香山五村居委会",
		"id": "310115012001039001",
		"parentid": "310115012000"
	},
	{
		"shortname": "住友名人花园居委会",
		"id": "310115012001040001",
		"parentid": "310115012000"
	},
	{
		"shortname": "蝶恋园居委会",
		"id": "310115012001041001",
		"parentid": "310115012000"
	},
	{
		"shortname": "居家桥居委会",
		"id": "310115012001042001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金樟居委会",
		"id": "310115012001043001",
		"parentid": "310115012000"
	},
	{
		"shortname": "高庙居委会",
		"id": "310115012001044001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山六村居委会",
		"id": "310115012001045001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山七村居委会",
		"id": "310115012001046001",
		"parentid": "310115012000"
	},
	{
		"shortname": "黄山新村一居委会",
		"id": "310115012001047001",
		"parentid": "310115012000"
	},
	{
		"shortname": "黄山新村三居委会",
		"id": "310115012001048001",
		"parentid": "310115012000"
	},
	{
		"shortname": "东方之音居委会",
		"id": "310115012001049001",
		"parentid": "310115012000"
	},
	{
		"shortname": "黄山新城居委会",
		"id": "310115012001050001",
		"parentid": "310115012000"
	},
	{
		"shortname": "银山路第一居委会",
		"id": "310115012001051001",
		"parentid": "310115012000"
	},
	{
		"shortname": "罗山八村居委会",
		"id": "310115012001052001",
		"parentid": "310115012000"
	},
	{
		"shortname": "广洋苑居委会",
		"id": "310115012001053001",
		"parentid": "310115012000"
	},
	{
		"shortname": "博山东路居委会",
		"id": "310115012001054001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金杨路四居委会",
		"id": "310115012001055001",
		"parentid": "310115012000"
	},
	{
		"shortname": "金桥瑞仕花园居委会",
		"id": "310115012001056001",
		"parentid": "310115012000"
	},
	{
		"shortname": "名门世家居委会",
		"id": "310115013001002001",
		"parentid": "310115013000"
	},
	{
		"shortname": "西镇居委会",
		"id": "310115013001005001",
		"parentid": "310115013000"
	},
	{
		"shortname": "阳光二村居委会",
		"id": "310115013001007001",
		"parentid": "310115013000"
	},
	{
		"shortname": "阳光三村居委会",
		"id": "310115013001008001",
		"parentid": "310115013000"
	},
	{
		"shortname": "海院新村居委会",
		"id": "310115013001010001",
		"parentid": "310115013000"
	},
	{
		"shortname": "泾西新村居委会",
		"id": "310115013001012001",
		"parentid": "310115013000"
	},
	{
		"shortname": "泾东新村居委会",
		"id": "310115013001013001",
		"parentid": "310115013000"
	},
	{
		"shortname": "巨野路居委会",
		"id": "310115013001014001",
		"parentid": "310115013000"
	},
	{
		"shortname": "博山路居委会",
		"id": "310115013001015001",
		"parentid": "310115013000"
	},
	{
		"shortname": "栖山路居委会",
		"id": "310115013001017001",
		"parentid": "310115013000"
	},
	{
		"shortname": "巨西居委会",
		"id": "310115013001020001",
		"parentid": "310115013000"
	},
	{
		"shortname": "桃林一居委会",
		"id": "310115013001021001",
		"parentid": "310115013000"
	},
	{
		"shortname": "巨东居委会",
		"id": "310115013001022001",
		"parentid": "310115013000"
	},
	{
		"shortname": "羽北居委会",
		"id": "310115013001023001",
		"parentid": "310115013000"
	},
	{
		"shortname": "凌高居委会",
		"id": "310115013001024001",
		"parentid": "310115013000"
	},
	{
		"shortname": "凌联一村居委会",
		"id": "310115013001025001",
		"parentid": "310115013000"
	},
	{
		"shortname": "凌联三村居委会",
		"id": "310115013001027001",
		"parentid": "310115013000"
	},
	{
		"shortname": "凌联四村居委会",
		"id": "310115013001028001",
		"parentid": "310115013000"
	},
	{
		"shortname": "桃林二居委会",
		"id": "310115013001034001",
		"parentid": "310115013000"
	},
	{
		"shortname": "星海居委会",
		"id": "310115013001035001",
		"parentid": "310115013000"
	},
	{
		"shortname": "崮山第二居委会",
		"id": "310115013001036001",
		"parentid": "310115013000"
	},
	{
		"shortname": "陆家嘴花园居委会",
		"id": "310115013001037001",
		"parentid": "310115013000"
	},
	{
		"shortname": "崮山路第一居委会",
		"id": "310115013001038001",
		"parentid": "310115013000"
	},
	{
		"shortname": "崮洋居委会",
		"id": "310115013001040001",
		"parentid": "310115013000"
	},
	{
		"shortname": "羽洋居委会",
		"id": "310115013001042001",
		"parentid": "310115013000"
	},
	{
		"shortname": "森洋居委会",
		"id": "310115013001043001",
		"parentid": "310115013000"
	},
	{
		"shortname": "民杨居委会",
		"id": "310115013001044001",
		"parentid": "310115013000"
	},
	{
		"shortname": "巨杨居委会",
		"id": "310115013001045001",
		"parentid": "310115013000"
	},
	{
		"shortname": "永安居委会",
		"id": "310115013001046001",
		"parentid": "310115013000"
	},
	{
		"shortname": "海防居委会",
		"id": "310115013001047001",
		"parentid": "310115013000"
	},
	{
		"shortname": "盛世年华居委会",
		"id": "310115013001048001",
		"parentid": "310115013000"
	},
	{
		"shortname": "第五大道居委会",
		"id": "310115013001049001",
		"parentid": "310115013000"
	},
	{
		"shortname": "国际华城居委会",
		"id": "310115013001050001",
		"parentid": "310115013000"
	},
	{
		"shortname": "维多利居委会",
		"id": "310115013001051001",
		"parentid": "310115013000"
	},
	{
		"shortname": "玫瑰园居委会",
		"id": "310115013001052001",
		"parentid": "310115013000"
	},
	{
		"shortname": "海弘居委会",
		"id": "310115013001053001",
		"parentid": "310115013000"
	},
	{
		"shortname": "山水国际居委会",
		"id": "310115013001054001",
		"parentid": "310115013000"
	},
	{
		"shortname": "上海滩花园居委会",
		"id": "310115013001055001",
		"parentid": "310115013000"
	},
	{
		"shortname": "凌河路二居委会",
		"id": "310115014001002001",
		"parentid": "310115014000"
	},
	{
		"shortname": "凌河路三居委会",
		"id": "310115014001003001",
		"parentid": "310115014000"
	},
	{
		"shortname": "凌河路四居委会",
		"id": "310115014001004001",
		"parentid": "310115014000"
	},
	{
		"shortname": "凌河路五居委会",
		"id": "310115014001005001",
		"parentid": "310115014000"
	},
	{
		"shortname": "凌河路七居委会",
		"id": "310115014001006001",
		"parentid": "310115014000"
	},
	{
		"shortname": "凌河路八居委会",
		"id": "310115014001007001",
		"parentid": "310115014000"
	},
	{
		"shortname": "东陆路一居委会",
		"id": "310115014001011001",
		"parentid": "310115014000"
	},
	{
		"shortname": "东陆路二居委会",
		"id": "310115014001012001",
		"parentid": "310115014000"
	},
	{
		"shortname": "东陆路五居委会",
		"id": "310115014001015001",
		"parentid": "310115014000"
	},
	{
		"shortname": "荷泽路一居委会",
		"id": "310115014001018001",
		"parentid": "310115014000"
	},
	{
		"shortname": "荷泽路三居委会",
		"id": "310115014001020001",
		"parentid": "310115014000"
	},
	{
		"shortname": "荷泽路五居委会",
		"id": "310115014001022001",
		"parentid": "310115014000"
	},
	{
		"shortname": "浦兴路一居委会",
		"id": "310115014001023001",
		"parentid": "310115014000"
	},
	{
		"shortname": "胶东路一居委会",
		"id": "310115014001025001",
		"parentid": "310115014000"
	},
	{
		"shortname": "龙臣居委会",
		"id": "310115014001027001",
		"parentid": "310115014000"
	},
	{
		"shortname": "浦兴路三居委会",
		"id": "310115014001028001",
		"parentid": "310115014000"
	},
	{
		"shortname": "银桥居委会",
		"id": "310115014001030001",
		"parentid": "310115014000"
	},
	{
		"shortname": "胶东路第二居委会",
		"id": "310115014001031001",
		"parentid": "310115014000"
	},
	{
		"shortname": "双桥居委会",
		"id": "310115014001032001",
		"parentid": "310115014000"
	},
	{
		"shortname": "金鑫居委会",
		"id": "310115014001033001",
		"parentid": "310115014000"
	},
	{
		"shortname": "金泽苑居委会",
		"id": "310115014001034001",
		"parentid": "310115014000"
	},
	{
		"shortname": "东荷居委会",
		"id": "310115014001035001",
		"parentid": "310115014000"
	},
	{
		"shortname": "金鹏居委会",
		"id": "310115014001036001",
		"parentid": "310115014000"
	},
	{
		"shortname": "中大居委会",
		"id": "310115014001037001",
		"parentid": "310115014000"
	},
	{
		"shortname": "证大第一居委会",
		"id": "310115014001038001",
		"parentid": "310115014000"
	},
	{
		"shortname": "长岛路居委会",
		"id": "310115014001039001",
		"parentid": "310115014000"
	},
	{
		"shortname": "浦兴路第二居委会",
		"id": "310115014001040001",
		"parentid": "310115014000"
	},
	{
		"shortname": "平度居委会",
		"id": "310115014001042001",
		"parentid": "310115014000"
	},
	{
		"shortname": "牟平居委会",
		"id": "310115014001043001",
		"parentid": "310115014000"
	},
	{
		"shortname": "胶东路第三居委会",
		"id": "310115014001044001",
		"parentid": "310115014000"
	},
	{
		"shortname": "凌河路第六居委会",
		"id": "310115014001045001",
		"parentid": "310115014000"
	},
	{
		"shortname": "凌河路第一居委会",
		"id": "310115014001046001",
		"parentid": "310115014000"
	},
	{
		"shortname": "证大第二居委会",
		"id": "310115014001047001",
		"parentid": "310115014000"
	},
	{
		"shortname": "东陆路三居委会",
		"id": "310115014001048001",
		"parentid": "310115014000"
	},
	{
		"shortname": "东陆路四居委会",
		"id": "310115014001049001",
		"parentid": "310115014000"
	},
	{
		"shortname": "金桥湾居委会",
		"id": "310115014001050001",
		"parentid": "310115014000"
	},
	{
		"shortname": "台儿庄居委会",
		"id": "310115014001051001",
		"parentid": "310115014000"
	},
	{
		"shortname": "金桥居委会",
		"id": "310115014001052001",
		"parentid": "310115014000"
	},
	{
		"shortname": "巨峰居委会",
		"id": "310115014001053001",
		"parentid": "310115014000"
	},
	{
		"shortname": "金东居委会",
		"id": "310115014001054001",
		"parentid": "310115014000"
	}, {
		"shortname": "三林苑居委会",
		"id": "310115015001001001",
		"parentid": "310115015000"
	},
	{
		"shortname": "翠竹苑居委会",
		"id": "310115015001002001",
		"parentid": "310115015000"
	},
	{
		"shortname": "金光新村一居委会",
		"id": "310115015001003001",
		"parentid": "310115015000"
	},
	{
		"shortname": "金光居委会",
		"id": "310115015001005001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第一居委会",
		"id": "310115015001007001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第二居委会",
		"id": "310115015001008001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第三居委会",
		"id": "310115015001009001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第四居委会",
		"id": "310115015001010001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第五居委会",
		"id": "310115015001011001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第六居委会",
		"id": "310115015001012001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第七居委会",
		"id": "310115015001013001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第八居委会",
		"id": "310115015001014001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第九居委会",
		"id": "310115015001015001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第十居委会",
		"id": "310115015001016001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第十一居委会",
		"id": "310115015001017001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第十二居委会",
		"id": "310115015001018001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第十三居委会",
		"id": "310115015001019001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第十四居委会",
		"id": "310115015001020001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第十五居委会",
		"id": "310115015001021001",
		"parentid": "310115015000"
	},
	{
		"shortname": "品华苑居委会",
		"id": "310115015001022001",
		"parentid": "310115015000"
	},
	{
		"shortname": "红枫苑居委会",
		"id": "310115015001023001",
		"parentid": "310115015000"
	},
	{
		"shortname": "安居苑居委会",
		"id": "310115015001024001",
		"parentid": "310115015000"
	},
	{
		"shortname": "品翠苑居委会",
		"id": "310115015001025001",
		"parentid": "310115015000"
	},
	{
		"shortname": "品新苑居委会",
		"id": "310115015001026001",
		"parentid": "310115015000"
	},
	{
		"shortname": "棕榈苑居委会",
		"id": "310115015001027001",
		"parentid": "310115015000"
	},
	{
		"shortname": "金桂苑居委会",
		"id": "310115015001028001",
		"parentid": "310115015000"
	},
	{
		"shortname": "凌兆新村第十六居委会",
		"id": "310115015001029001",
		"parentid": "310115015000"
	},
	{
		"shortname": "盛源居委会",
		"id": "310115015001030001",
		"parentid": "310115015000"
	},
	{
		"shortname": "新月第一居委会",
		"id": "310115015001031001",
		"parentid": "310115015000"
	},
	{
		"shortname": "新月第二居委会",
		"id": "310115015001032001",
		"parentid": "310115015000"
	},
	{
		"shortname": "永泰花苑居委会",
		"id": "310115015001034001",
		"parentid": "310115015000"
	},
	{
		"shortname": "金禾苑居委会",
		"id": "310115015001035001",
		"parentid": "310115015000"
	},
	{
		"shortname": "金橘苑居委会",
		"id": "310115015001036001",
		"parentid": "310115015000"
	},
	{
		"shortname": "樱桃苑居委会",
		"id": "310115015001037001",
		"parentid": "310115015000"
	},
	{
		"shortname": "金谊河畔居委会",
		"id": "310115015001038001",
		"parentid": "310115015000"
	},
	{
		"shortname": "金色雅筑居委会",
		"id": "310115015001039001",
		"parentid": "310115015000"
	},
	{
		"shortname": "湾流域居委会",
		"id": "310115015001040001",
		"parentid": "310115015000"
	},
	{
		"shortname": "牡丹第二居委会",
		"id": "310115016001001001",
		"parentid": "310115016000"
	},
	{
		"shortname": "牡丹第四居委会",
		"id": "310115016001002001",
		"parentid": "310115016000"
	},
	{
		"shortname": "牡丹第七居委会",
		"id": "310115016001003001",
		"parentid": "310115016000"
	},
	{
		"shortname": "培花新村四居委会",
		"id": "310115016001004001",
		"parentid": "310115016000"
	},
	{
		"shortname": "培花新村六居委会",
		"id": "310115016001005001",
		"parentid": "310115016000"
	},
	{
		"shortname": "培花新村七居委会",
		"id": "310115016001006001",
		"parentid": "310115016000"
	},
	{
		"shortname": "由由一居委会",
		"id": "310115016001007001",
		"parentid": "310115016000"
	},
	{
		"shortname": "由由二居委会",
		"id": "310115016001008001",
		"parentid": "310115016000"
	},
	{
		"shortname": "由由四居委会",
		"id": "310115016001009001",
		"parentid": "310115016000"
	},
	{
		"shortname": "由由五居委会",
		"id": "310115016001010001",
		"parentid": "310115016000"
	},
	{
		"shortname": "由由六居委会",
		"id": "310115016001011001",
		"parentid": "310115016000"
	},
	{
		"shortname": "由由七居委会",
		"id": "310115016001012001",
		"parentid": "310115016000"
	},
	{
		"shortname": "牡丹第八居委会",
		"id": "310115016001013001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城新村第一居委会",
		"id": "310115016001014001",
		"parentid": "310115016000"
	},
	{
		"shortname": "锦绣居委会",
		"id": "310115016001015001",
		"parentid": "310115016000"
	},
	{
		"shortname": "牡丹第一居委会",
		"id": "310115016001016001",
		"parentid": "310115016000"
	},
	{
		"shortname": "牡丹第六居委会",
		"id": "310115016001017001",
		"parentid": "310115016000"
	},
	{
		"shortname": "万邦居委会",
		"id": "310115016001018001",
		"parentid": "310115016000"
	},
	{
		"shortname": "牡丹第五居委会",
		"id": "310115016001019001",
		"parentid": "310115016000"
	},
	{
		"shortname": "培花新村一居委会",
		"id": "310115016001020001",
		"parentid": "310115016000"
	},
	{
		"shortname": "培花新村二居委会",
		"id": "310115016001021001",
		"parentid": "310115016000"
	},
	{
		"shortname": "培花新村三居委会",
		"id": "310115016001022001",
		"parentid": "310115016000"
	},
	{
		"shortname": "明月居委会",
		"id": "310115016001023001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城新村第三居委会",
		"id": "310115016001025001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城新村第四居委会",
		"id": "310115016001026001",
		"parentid": "310115016000"
	},
	{
		"shortname": "培花新村第九居委会",
		"id": "310115016001027001",
		"parentid": "310115016000"
	},
	{
		"shortname": "牡丹第三居委会",
		"id": "310115016001028001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城新村第六居委会",
		"id": "310115016001029001",
		"parentid": "310115016000"
	},
	{
		"shortname": "蓝天居委会",
		"id": "310115016001030001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城新村第二居委会",
		"id": "310115016001031001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城新村第五居委会",
		"id": "310115016001032001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城第七居委会",
		"id": "310115016001033001",
		"parentid": "310115016000"
	},
	{
		"shortname": "东城新村第八居委会",
		"id": "310115016001034001",
		"parentid": "310115016000"
	},
	{
		"shortname": "由由八居委会",
		"id": "310115016001035001",
		"parentid": "310115016000"
	},
	{
		"shortname": "世茂湖滨花园居委会",
		"id": "310115016001036001",
		"parentid": "310115016000"
	},
	{
		"shortname": "联洋第一居委会",
		"id": "310115016001037001",
		"parentid": "310115016000"
	},
	{
		"shortname": "联洋第二居委会",
		"id": "310115016001038001",
		"parentid": "310115016000"
	},
	{
		"shortname": "联洋第三居委会",
		"id": "310115016001039001",
		"parentid": "310115016000"
	},
	{
		"shortname": "联洋第四居委会",
		"id": "310115016001040001",
		"parentid": "310115016000"
	},
	{
		"shortname": "联洋第五居委会",
		"id": "310115016001041001",
		"parentid": "310115016000"
	},
	{
		"shortname": "联洋第六居委会",
		"id": "310115016001042001",
		"parentid": "310115016000"
	},
	{
		"shortname": "前程居委会",
		"id": "310115016001043001",
		"parentid": "310115016000"
	},
	{
		"shortname": "御庭居委会",
		"id": "310115016001044001",
		"parentid": "310115016000"
	},
	{
		"shortname": "湖庭居委会",
		"id": "310115016001045001",
		"parentid": "310115016000"
	}, {
		"shortname": "城西居委会",
		"id": "310115103001001001",
		"parentid": "310115103000"
	},
	{
		"shortname": "侨光居委会",
		"id": "310115103001002001",
		"parentid": "310115103000"
	},
	{
		"shortname": "南市居委会",
		"id": "310115103001003001",
		"parentid": "310115103000"
	},
	{
		"shortname": "临园居委会",
		"id": "310115103001004001",
		"parentid": "310115103000"
	},
	{
		"shortname": "园西居委会",
		"id": "310115103001005001",
		"parentid": "310115103000"
	},
	{
		"shortname": "西市居委会",
		"id": "310115103001007001",
		"parentid": "310115103000"
	},
	{
		"shortname": "川北居委会",
		"id": "310115103001009001",
		"parentid": "310115103000"
	},
	{
		"shortname": "新川居委会",
		"id": "310115103001010001",
		"parentid": "310115103000"
	},
	{
		"shortname": "南桥居委会",
		"id": "310115103001011001",
		"parentid": "310115103000"
	},
	{
		"shortname": "东市居委会",
		"id": "310115103001013001",
		"parentid": "310115103000"
	},
	{
		"shortname": "城南居委会",
		"id": "310115103001014001",
		"parentid": "310115103000"
	},
	{
		"shortname": "曙光居委会",
		"id": "310115103001015001",
		"parentid": "310115103000"
	},
	{
		"shortname": "桃园二居委会",
		"id": "310115103001016001",
		"parentid": "310115103000"
	},
	{
		"shortname": "新德居委会",
		"id": "310115103001017001",
		"parentid": "310115103000"
	},
	{
		"shortname": "普新居委会",
		"id": "310115103001018001",
		"parentid": "310115103000"
	},
	{
		"shortname": "黄楼居委会",
		"id": "310115103001019001",
		"parentid": "310115103000"
	},
	{
		"shortname": "妙华居委会",
		"id": "310115103001020001",
		"parentid": "310115103000"
	},
	{
		"shortname": "妙境居委会",
		"id": "310115103001021001",
		"parentid": "310115103000"
	},
	{
		"shortname": "天乐居委会",
		"id": "310115103001022001",
		"parentid": "310115103000"
	},
	{
		"shortname": "明珠居委会",
		"id": "310115103001023001",
		"parentid": "310115103000"
	},
	{
		"shortname": "新苑居委会",
		"id": "310115103001024001",
		"parentid": "310115103000"
	},
	{
		"shortname": "华盛居委会",
		"id": "310115103001025001",
		"parentid": "310115103000"
	},
	{
		"shortname": "妙兰居委会",
		"id": "310115103001026001",
		"parentid": "310115103000"
	},
	{
		"shortname": "沙田居委会",
		"id": "310115103001028001",
		"parentid": "310115103000"
	},
	{
		"shortname": "申华居委会",
		"id": "310115103001029001",
		"parentid": "310115103000"
	},
	{
		"shortname": "玉宇居委会",
		"id": "310115103001030001",
		"parentid": "310115103000"
	},
	{
		"shortname": "妙龙居委会",
		"id": "310115103001031001",
		"parentid": "310115103000"
	},
	{
		"shortname": "玉兰居委会",
		"id": "310115103001032001",
		"parentid": "310115103000"
	},
	{
		"shortname": "妙城居委会",
		"id": "310115103001033001",
		"parentid": "310115103000"
	},
	{
		"shortname": "妙港居委会",
		"id": "310115103001034001",
		"parentid": "310115103000"
	},
	{
		"shortname": "万馨居委会",
		"id": "310115103001042001",
		"parentid": "310115103000"
	},
	{
		"shortname": "翔云居委会",
		"id": "310115103001050001",
		"parentid": "310115103000"
	},
	{
		"shortname": "舒馨居委会",
		"id": "310115103001055001",
		"parentid": "310115103000"
	},
	{
		"shortname": "华宇居委会",
		"id": "310115103001056001",
		"parentid": "310115103000"
	},
	{
		"shortname": "鹿城居委会",
		"id": "310115103001057001",
		"parentid": "310115103000"
	},
	{
		"shortname": "鹿新居委会",
		"id": "310115103001058001",
		"parentid": "310115103000"
	},
	{
		"shortname": "川迪第一居委会",
		"id": "310115103001059001",
		"parentid": "310115103000"
	},
	{
		"shortname": "川迪第二居委会",
		"id": "310115103001060001",
		"parentid": "310115103000"
	},
	{
		"shortname": "川迪第三居委会",
		"id": "310115103001061001",
		"parentid": "310115103000"
	},
	{
		"shortname": "馨宇居委会",
		"id": "310115103001062001",
		"parentid": "310115103000"
	},
	{
		"shortname": "德馨居委会",
		"id": "310115103001076001",
		"parentid": "310115103000"
	},
	{
		"shortname": "佳华居委会",
		"id": "310115103001077001",
		"parentid": "310115103000"
	},
	{
		"shortname": "新虹居委会",
		"id": "310115103001078001",
		"parentid": "310115103000"
	},
	{
		"shortname": "虹馨居委会",
		"id": "310115103001079001",
		"parentid": "310115103000"
	},
	{
		"shortname": "虹宇居委会",
		"id": "310115103001080001",
		"parentid": "310115103000"
	},
	{
		"shortname": "南佳居委会",
		"id": "310115103001081001",
		"parentid": "310115103000"
	},
	{
		"shortname": "太平村村委会",
		"id": "310115103001201001",
		"parentid": "310115103000"
	},
	{
		"shortname": "柴场村村委会",
		"id": "310115103001202001",
		"parentid": "310115103000"
	},
	{
		"shortname": "陈行村村委会",
		"id": "310115103001203001",
		"parentid": "310115103000"
	},
	{
		"shortname": "虹桥村村委会",
		"id": "310115103001204001",
		"parentid": "310115103000"
	},
	{
		"shortname": "南高桥村村委会",
		"id": "310115103001205001",
		"parentid": "310115103000"
	},
	{
		"shortname": "城南村村委会",
		"id": "310115103001206001",
		"parentid": "310115103000"
	},
	{
		"shortname": "妙境村村委会",
		"id": "310115103001207001",
		"parentid": "310115103000"
	},
	{
		"shortname": "长丰村村委会",
		"id": "310115103001210001",
		"parentid": "310115103000"
	},
	{
		"shortname": "对面街村村委会",
		"id": "310115103001213001",
		"parentid": "310115103000"
	},
	{
		"shortname": "湾镇村村委会",
		"id": "310115103001214001",
		"parentid": "310115103000"
	},
	{
		"shortname": "杜尹村村委会",
		"id": "310115103001215001",
		"parentid": "310115103000"
	},
	{
		"shortname": "高桥村村委会",
		"id": "310115103001216001",
		"parentid": "310115103000"
	},
	{
		"shortname": "长桥村村委会",
		"id": "310115103001217001",
		"parentid": "310115103000"
	},
	{
		"shortname": "储店村村委会",
		"id": "310115103001218001",
		"parentid": "310115103000"
	},
	{
		"shortname": "新浜村村委会",
		"id": "310115103001219001",
		"parentid": "310115103000"
	},
	{
		"shortname": "吴店村村委会",
		"id": "310115103001220001",
		"parentid": "310115103000"
	},
	{
		"shortname": "八灶村村委会",
		"id": "310115103001221001",
		"parentid": "310115103000"
	},
	{
		"shortname": "牌楼村村委会",
		"id": "310115103001222001",
		"parentid": "310115103000"
	},
	{
		"shortname": "七灶村村委会",
		"id": "310115103001223001",
		"parentid": "310115103000"
	},
	{
		"shortname": "纯新村村委会",
		"id": "310115103001224001",
		"parentid": "310115103000"
	},
	{
		"shortname": "新春村村委会",
		"id": "310115103001225001",
		"parentid": "310115103000"
	},
	{
		"shortname": "杜坊村村委会",
		"id": "310115103001226001",
		"parentid": "310115103000"
	},
	{
		"shortname": "界龙村村委会",
		"id": "310115103001227001",
		"parentid": "310115103000"
	},
	{
		"shortname": "栏杆村村委会",
		"id": "310115103001228001",
		"parentid": "310115103000"
	},
	{
		"shortname": "黄楼村村委会",
		"id": "310115103001229001",
		"parentid": "310115103000"
	},
	{
		"shortname": "金家村村委会",
		"id": "310115103001230001",
		"parentid": "310115103000"
	},
	{
		"shortname": "棋杆村村委会",
		"id": "310115103001231001",
		"parentid": "310115103000"
	},
	{
		"shortname": "赵行村村委会",
		"id": "310115103001233001",
		"parentid": "310115103000"
	},
	{
		"shortname": "和平村村委会",
		"id": "310115103001244001",
		"parentid": "310115103000"
	},
	{
		"shortname": "华路村村委会",
		"id": "310115103001245001",
		"parentid": "310115103000"
	},
	{
		"shortname": "大洪村村委会",
		"id": "310115103001246001",
		"parentid": "310115103000"
	},
	{
		"shortname": "民利村村委会",
		"id": "310115103001247001",
		"parentid": "310115103000"
	},
	{
		"shortname": "会龙村村委会",
		"id": "310115103001266001",
		"parentid": "310115103000"
	},
	{
		"shortname": "新吉村村委会",
		"id": "310115103001267001",
		"parentid": "310115103000"
	},
	{
		"shortname": "其成村村委会",
		"id": "310115103001268001",
		"parentid": "310115103000"
	},
	{
		"shortname": "七星村村委会",
		"id": "310115103001269001",
		"parentid": "310115103000"
	},
	{
		"shortname": "民义村村委会",
		"id": "310115103001270001",
		"parentid": "310115103000"
	},
	{
		"shortname": "汤店村村委会",
		"id": "310115103001271001",
		"parentid": "310115103000"
	},
	{
		"shortname": "鹿溪村村委会",
		"id": "310115103001272001",
		"parentid": "310115103000"
	},
	{
		"shortname": "连民村村委会",
		"id": "310115103001273001",
		"parentid": "310115103000"
	},
	{
		"shortname": "陈桥村村委会",
		"id": "310115103001274001",
		"parentid": "310115103000"
	},
	{
		"shortname": "果园村村委会",
		"id": "310115103001275001",
		"parentid": "310115103000"
	}, {
		"shortname": "上炼新村一居委会",
		"id": "310115104001002001",
		"parentid": "310115104000"
	},
	{
		"shortname": "上炼新村二居委会",
		"id": "310115104001003001",
		"parentid": "310115104000"
	},
	{
		"shortname": "高桥二村居委会",
		"id": "310115104001006001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港一村居委会",
		"id": "310115104001009001",
		"parentid": "310115104000"
	},
	{
		"shortname": "东街居委会",
		"id": "310115104001010001",
		"parentid": "310115104000"
	},
	{
		"shortname": "南街居委会",
		"id": "310115104001011001",
		"parentid": "310115104000"
	},
	{
		"shortname": "西街居委会",
		"id": "310115104001012001",
		"parentid": "310115104000"
	},
	{
		"shortname": "富特三居委会",
		"id": "310115104001015001",
		"parentid": "310115104000"
	},
	{
		"shortname": "富特四居委会",
		"id": "310115104001016001",
		"parentid": "310115104000"
	},
	{
		"shortname": "富特五居委会",
		"id": "310115104001017001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港二村居委会",
		"id": "310115104001018001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港三村居委会",
		"id": "310115104001019001",
		"parentid": "310115104000"
	},
	{
		"shortname": "金高居委会",
		"id": "310115104001020001",
		"parentid": "310115104000"
	},
	{
		"shortname": "凌桥居委会",
		"id": "310115104001021002",
		"parentid": "310115104000"
	},
	{
		"shortname": "海高新村居委会",
		"id": "310115104001022001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港五村居委会",
		"id": "310115104001023001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港六村居委会",
		"id": "310115104001024001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港八村居委会",
		"id": "310115104001025001",
		"parentid": "310115104000"
	},
	{
		"shortname": "凌桥第二居委会",
		"id": "310115104001026001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港四村居委会",
		"id": "310115104001027001",
		"parentid": "310115104000"
	},
	{
		"shortname": "潼港西八村居委会",
		"id": "310115104001028001",
		"parentid": "310115104000"
	},
	{
		"shortname": "陆凌居委会",
		"id": "310115104001029001",
		"parentid": "310115104000"
	},
	{
		"shortname": "永久新村居委会",
		"id": "310115104001030001",
		"parentid": "310115104000"
	},
	{
		"shortname": "学前街居委会",
		"id": "310115104001031001",
		"parentid": "310115104000"
	},
	{
		"shortname": "高桥新城第一居委会",
		"id": "310115104001032001",
		"parentid": "310115104000"
	},
	{
		"shortname": "港城新苑居委会",
		"id": "310115104001033001",
		"parentid": "310115104000"
	},
	{
		"shortname": "凌桥第三居委会",
		"id": "310115104001034001",
		"parentid": "310115104000"
	},
	{
		"shortname": "和祥佳园居委会",
		"id": "310115104001035001",
		"parentid": "310115104000"
	},
	{
		"shortname": "凌桥第四居委会",
		"id": "310115104001036001",
		"parentid": "310115104000"
	},
	{
		"shortname": "凌桥第六居委会",
		"id": "310115104001037001",
		"parentid": "310115104000"
	},
	{
		"shortname": "凌桥第五居委会",
		"id": "310115104001038001",
		"parentid": "310115104000"
	},
	{
		"shortname": "高桥新城第二居委会",
		"id": "310115104001039001",
		"parentid": "310115104000"
	},
	{
		"shortname": "南塘村村委会",
		"id": "310115104001201001",
		"parentid": "310115104000"
	},
	{
		"shortname": "陆凌村村委会",
		"id": "310115104001203001",
		"parentid": "310115104000"
	},
	{
		"shortname": "屯粮巷村村委会",
		"id": "310115104001204001",
		"parentid": "310115104000"
	},
	{
		"shortname": "新农村村委会",
		"id": "310115104001205001",
		"parentid": "310115104000"
	},
	{
		"shortname": "镇北村村委会",
		"id": "310115104001210001",
		"parentid": "310115104000"
	},
	{
		"shortname": "北新村村委会",
		"id": "310115104001214001",
		"parentid": "310115104000"
	},
	{
		"shortname": "西新村村委会",
		"id": "310115104001215001",
		"parentid": "310115104000"
	},
	{
		"shortname": "新益村村委会",
		"id": "310115104001216001",
		"parentid": "310115104000"
	},
	{
		"shortname": "仓房村村委会",
		"id": "310115104001217001",
		"parentid": "310115104000"
	},
	{
		"shortname": "三岔港村村委会",
		"id": "310115104001218001",
		"parentid": "310115104000"
	},
	{
		"shortname": "龙叶村村委会",
		"id": "310115104001219001",
		"parentid": "310115104000"
	},
	{
		"shortname": "凌桥村村委会",
		"id": "310115104001220001",
		"parentid": "310115104000"
	},
	{
		"shortname": "炮台浜村村委会",
		"id": "310115104001221001",
		"parentid": "310115104000"
	},
	{
		"shortname": "顾家圩村村委会",
		"id": "310115104001222001",
		"parentid": "310115104000"
	},
	{
		"shortname": "浦凌佳苑居委会（筹）",
		"id": "310115104001811001",
		"parentid": "310115104000"
	}, {
		"shortname": "虹南居委会",
		"id": "310115105001002001",
		"parentid": "310115105000"
	},
	{
		"shortname": "香花居委会",
		"id": "310115105001003001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲溪一居委会",
		"id": "310115105001004001",
		"parentid": "310115105000"
	},
	{
		"shortname": "天池居委会",
		"id": "310115105001006001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲溪三居委会",
		"id": "310115105001007001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲溪四居委会",
		"id": "310115105001008001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲溪六居委会",
		"id": "310115105001010001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲溪七居委会",
		"id": "310115105001011001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲溪八居委会",
		"id": "310115105001012001",
		"parentid": "310115105000"
	},
	{
		"shortname": "紫叶一居委会",
		"id": "310115105001013001",
		"parentid": "310115105000"
	},
	{
		"shortname": "紫叶二居委会",
		"id": "310115105001014001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲安第一居委会",
		"id": "310115105001016001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲安第二居委会",
		"id": "310115105001017001",
		"parentid": "310115105000"
	},
	{
		"shortname": "鹏海第一居委会",
		"id": "310115105001018001",
		"parentid": "310115105000"
	},
	{
		"shortname": "鹏海第二居委会",
		"id": "310115105001019001",
		"parentid": "310115105000"
	},
	{
		"shortname": "和平居委会",
		"id": "310115105001020001",
		"parentid": "310115105000"
	},
	{
		"shortname": "海东居委会",
		"id": "310115105001021001",
		"parentid": "310115105000"
	},
	{
		"shortname": "莲溪九居委会",
		"id": "310115105001022001",
		"parentid": "310115105000"
	},
	{
		"shortname": "艾东居委会",
		"id": "310115105001026001",
		"parentid": "310115105000"
	},
	{
		"shortname": "艾南居委会",
		"id": "310115105001027001",
		"parentid": "310115105000"
	},
	{
		"shortname": "下西浜居委会",
		"id": "310115105001028001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南新一村居委会",
		"id": "310115105001029001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南新四村居委会",
		"id": "310115105001030001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南新六村居委会",
		"id": "310115105001031001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南新二村居委会",
		"id": "310115105001033001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南新七村居委会",
		"id": "310115105001034001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南江苑居委会",
		"id": "310115105001035001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南杨居委会",
		"id": "310115105001036001",
		"parentid": "310115105000"
	},
	{
		"shortname": "金旋居委会",
		"id": "310115105001037001",
		"parentid": "310115105000"
	},
	{
		"shortname": "绿川新村一居委会",
		"id": "310115105001040001",
		"parentid": "310115105000"
	},
	{
		"shortname": "绿川新村二居委会",
		"id": "310115105001041001",
		"parentid": "310115105000"
	},
	{
		"shortname": "绿川新村三居委会",
		"id": "310115105001042001",
		"parentid": "310115105000"
	},
	{
		"shortname": "绿川新村四居委会",
		"id": "310115105001043001",
		"parentid": "310115105000"
	},
	{
		"shortname": "安建居委会",
		"id": "310115105001044001",
		"parentid": "310115105000"
	},
	{
		"shortname": "龙港居委会",
		"id": "310115105001045001",
		"parentid": "310115105000"
	},
	{
		"shortname": "民乐苑居委会",
		"id": "310115105001046001",
		"parentid": "310115105000"
	},
	{
		"shortname": "锦华居委会",
		"id": "310115105001047001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南新第三居委会",
		"id": "310115105001048001",
		"parentid": "310115105000"
	},
	{
		"shortname": "河东居委会",
		"id": "310115105001049001",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华居委会",
		"id": "310115105001050001",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华第一居委会",
		"id": "310115105001051001",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华第二居委会",
		"id": "310115105001052001",
		"parentid": "310115105000"
	},
	{
		"shortname": "鹏海第七居委会",
		"id": "310115105001055001",
		"parentid": "310115105000"
	},
	{
		"shortname": "御桥第一居委会",
		"id": "310115105001056001",
		"parentid": "310115105000"
	},
	{
		"shortname": "御桥第二居委会",
		"id": "310115105001057002",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华三居委会",
		"id": "310115105001058001",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华六居委会",
		"id": "310115105001059001",
		"parentid": "310115105000"
	},
	{
		"shortname": "香溢居委会",
		"id": "310115105001060001",
		"parentid": "310115105000"
	},
	{
		"shortname": "春夏居委会",
		"id": "310115105001061001",
		"parentid": "310115105000"
	},
	{
		"shortname": "御桥第四居委会",
		"id": "310115105001064001",
		"parentid": "310115105000"
	},
	{
		"shortname": "艾南花苑居委会",
		"id": "310115105001065001",
		"parentid": "310115105000"
	},
	{
		"shortname": "御桥第三居委会",
		"id": "310115105001066001",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华第四居委会",
		"id": "310115105001067001",
		"parentid": "310115105000"
	},
	{
		"shortname": "振东第一居委会",
		"id": "310115105001068001",
		"parentid": "310115105000"
	},
	{
		"shortname": "鹏海第八居委会",
		"id": "310115105001069001",
		"parentid": "310115105000"
	},
	{
		"shortname": "龙博公寓居委会",
		"id": "310115105001070001",
		"parentid": "310115105000"
	},
	{
		"shortname": "鹏海第三居委会",
		"id": "310115105001071001",
		"parentid": "310115105000"
	},
	{
		"shortname": "杨桥村村委会",
		"id": "310115105001202001",
		"parentid": "310115105000"
	},
	{
		"shortname": "中界村村委会",
		"id": "310115105001203001",
		"parentid": "310115105000"
	},
	{
		"shortname": "联勤村村委会",
		"id": "310115105001207001",
		"parentid": "310115105000"
	},
	{
		"shortname": "五星村村委会",
		"id": "310115105001208001",
		"parentid": "310115105000"
	},
	{
		"shortname": "御桥村村委会",
		"id": "310115105001209001",
		"parentid": "310115105000"
	},
	{
		"shortname": "卫行村村委会",
		"id": "310115105001210001",
		"parentid": "310115105000"
	},
	{
		"shortname": "一六村村委会",
		"id": "310115105001211001",
		"parentid": "310115105000"
	},
	{
		"shortname": "南新村村委会",
		"id": "310115105001212001",
		"parentid": "310115105000"
	},
	{
		"shortname": "同福村村委会",
		"id": "310115105001216001",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华八居委会（筹）",
		"id": "310115105001816001",
		"parentid": "310115105000"
	},
	{
		"shortname": "鹏海四居委会（筹）",
		"id": "310115105001819001",
		"parentid": "310115105000"
	},
	{
		"shortname": "潘姚陈桥工作站（筹）",
		"id": "310115105001820001",
		"parentid": "310115105000"
	},
	{
		"shortname": "大华七居委会（筹）",
		"id": "310115105001821001",
		"parentid": "310115105000"
	},
	{
		"shortname": "海尚郡领居委会（筹）",
		"id": "310115105001822001",
		"parentid": "310115105000"
	},
	{
		"shortname": "陈桥居委会（筹）",
		"id": "310115105001823001",
		"parentid": "310115105000"
	},
	{
		"shortname": "艾南工作站（筹）",
		"id": "310115105001824001",
		"parentid": "310115105000"
	},
	{
		"shortname": "御桥第六居委会（筹）",
		"id": "310115105001825001",
		"parentid": "310115105000"
	}, {
		"shortname": "合庆镇居委会",
		"id": "310115110001001001",
		"parentid": "310115110000"
	},
	{
		"shortname": "蔡路镇居委会",
		"id": "310115110001002001",
		"parentid": "310115110000"
	},
	{
		"shortname": "胜利居委会",
		"id": "310115110001003001",
		"parentid": "310115110000"
	},
	{
		"shortname": "庆南居委会",
		"id": "310115110001004001",
		"parentid": "310115110000"
	},
	{
		"shortname": "益华居委会",
		"id": "310115110001005001",
		"parentid": "310115110000"
	},
	{
		"shortname": "庆东居委会",
		"id": "310115110001006001",
		"parentid": "310115110000"
	},
	{
		"shortname": "庆华居委会",
		"id": "310115110001007001",
		"parentid": "310115110000"
	},
	{
		"shortname": "向东村村委会",
		"id": "310115110001201001",
		"parentid": "310115110000"
	},
	{
		"shortname": "前哨村村委会",
		"id": "310115110001202001",
		"parentid": "310115110000"
	},
	{
		"shortname": "朝阳村村委会",
		"id": "310115110001203001",
		"parentid": "310115110000"
	},
	{
		"shortname": "勤奋村村委会",
		"id": "310115110001204001",
		"parentid": "310115110000"
	},
	{
		"shortname": "向阳村村委会",
		"id": "310115110001205001",
		"parentid": "310115110000"
	},
	{
		"shortname": "共一村村委会",
		"id": "310115110001206001",
		"parentid": "310115110000"
	},
	{
		"shortname": "奚家村村委会",
		"id": "310115110001207001",
		"parentid": "310115110000"
	},
	{
		"shortname": "庆丰村村委会",
		"id": "310115110001208001",
		"parentid": "310115110000"
	},
	{
		"shortname": "庆星村村委会",
		"id": "310115110001209001",
		"parentid": "310115110000"
	},
	{
		"shortname": "红星村村委会",
		"id": "310115110001210001",
		"parentid": "310115110000"
	},
	{
		"shortname": "跃丰村村委会",
		"id": "310115110001212001",
		"parentid": "310115110000"
	},
	{
		"shortname": "永红村村委会",
		"id": "310115110001213001",
		"parentid": "310115110000"
	},
	{
		"shortname": "东风村村委会",
		"id": "310115110001214001",
		"parentid": "310115110000"
	},
	{
		"shortname": "直属村村委会",
		"id": "310115110001215001",
		"parentid": "310115110000"
	},
	{
		"shortname": "海塘村村委会",
		"id": "310115110001216001",
		"parentid": "310115110000"
	},
	{
		"shortname": "建光村村委会",
		"id": "310115110001217001",
		"parentid": "310115110000"
	},
	{
		"shortname": "勤昌村村委会",
		"id": "310115110001218001",
		"parentid": "310115110000"
	},
	{
		"shortname": "春雷村村委会",
		"id": "310115110001219001",
		"parentid": "310115110000"
	},
	{
		"shortname": "友谊村村委会",
		"id": "310115110001220001",
		"parentid": "310115110000"
	},
	{
		"shortname": "青四村村委会",
		"id": "310115110001221001",
		"parentid": "310115110000"
	},
	{
		"shortname": "青三村村委会",
		"id": "310115110001222001",
		"parentid": "310115110000"
	},
	{
		"shortname": "大星村村委会",
		"id": "310115110001223001",
		"parentid": "310115110000"
	},
	{
		"shortname": "蔡路村村委会",
		"id": "310115110001224001",
		"parentid": "310115110000"
	},
	{
		"shortname": "勤益村村委会",
		"id": "310115110001225001",
		"parentid": "310115110000"
	},
	{
		"shortname": "益民村村委会",
		"id": "310115110001226001",
		"parentid": "310115110000"
	},
	{
		"shortname": "跃进村村委会",
		"id": "310115110001227001",
		"parentid": "310115110000"
	},
	{
		"shortname": "华星村村委会",
		"id": "310115110001228001",
		"parentid": "310115110000"
	},
	{
		"shortname": "勤俭村村委会",
		"id": "310115110001229001",
		"parentid": "310115110000"
	},
	{
		"shortname": "营房村村委会",
		"id": "310115110001230001",
		"parentid": "310115110000"
	}, {
		"shortname": "东唐苑居委会",
		"id": "310115114001001001",
		"parentid": "310115114000"
	},
	{
		"shortname": "王港镇居委会",
		"id": "310115114001002001",
		"parentid": "310115114000"
	},
	{
		"shortname": "唐人苑居委会",
		"id": "310115114001003001",
		"parentid": "310115114000"
	},
	{
		"shortname": "金枫居委会",
		"id": "310115114001004001",
		"parentid": "310115114000"
	},
	{
		"shortname": "暮紫桥居委会",
		"id": "310115114001005001",
		"parentid": "310115114000"
	},
	{
		"shortname": "绿波苑居委会",
		"id": "310115114001006001",
		"parentid": "310115114000"
	},
	{
		"shortname": "同馨苑居委会",
		"id": "310115114001007001",
		"parentid": "310115114000"
	},
	{
		"shortname": "金唐居委会",
		"id": "310115114001008001",
		"parentid": "310115114000"
	},
	{
		"shortname": "齐爱居委会",
		"id": "310115114001009001",
		"parentid": "310115114000"
	},
	{
		"shortname": "瀚盛居委会",
		"id": "310115114001010001",
		"parentid": "310115114000"
	},
	{
		"shortname": "金盛居委会",
		"id": "310115114001011001",
		"parentid": "310115114000"
	},
	{
		"shortname": "唐丰苑居委会",
		"id": "310115114001012001",
		"parentid": "310115114000"
	},
	{
		"shortname": "齐友佳苑居委会",
		"id": "310115114001013001",
		"parentid": "310115114000"
	},
	{
		"shortname": "新镇村村委会",
		"id": "310115114001201001",
		"parentid": "310115114000"
	},
	{
		"shortname": "大众村村委会",
		"id": "310115114001202001",
		"parentid": "310115114000"
	},
	{
		"shortname": "吕三村村委会",
		"id": "310115114001203001",
		"parentid": "310115114000"
	},
	{
		"shortname": "唐四村村委会",
		"id": "310115114001204001",
		"parentid": "310115114000"
	},
	{
		"shortname": "民丰村村委会",
		"id": "310115114001205001",
		"parentid": "310115114000"
	},
	{
		"shortname": "前进村村委会",
		"id": "310115114001206001",
		"parentid": "310115114000"
	},
	{
		"shortname": "唐镇村村委会",
		"id": "310115114001207001",
		"parentid": "310115114000"
	},
	{
		"shortname": "机口村村委会",
		"id": "310115114001208001",
		"parentid": "310115114000"
	},
	{
		"shortname": "一心村村委会",
		"id": "310115114001209001",
		"parentid": "310115114000"
	},
	{
		"shortname": "虹二村村委会",
		"id": "310115114001212001",
		"parentid": "310115114000"
	},
	{
		"shortname": "虹三村村委会",
		"id": "310115114001213001",
		"parentid": "310115114000"
	},
	{
		"shortname": "虹四村村委会",
		"id": "310115114001214001",
		"parentid": "310115114000"
	},
	{
		"shortname": "大丰村村委会",
		"id": "310115114001215001",
		"parentid": "310115114000"
	},
	{
		"shortname": "暮二村村委会",
		"id": "310115114001216001",
		"parentid": "310115114000"
	},
	{
		"shortname": "虹一村村委会",
		"id": "310115114001217001",
		"parentid": "310115114000"
	},
	{
		"shortname": "新虹村村委会",
		"id": "310115114001218001",
		"parentid": "310115114000"
	},
	{
		"shortname": "小湾村村委会",
		"id": "310115114001219001",
		"parentid": "310115114000"
	},
	{
		"shortname": "金爵居委会（筹）",
		"id": "310115114001806001",
		"parentid": "310115114000"
	},
	{
		"shortname": "天歌居委会（筹）",
		"id": "310115114001807001",
		"parentid": "310115114000"
	},
	{
		"shortname": "保利居委会（筹）",
		"id": "310115114001809001",
		"parentid": "310115114000"
	},
	{
		"shortname": "绿墅居委会（筹）",
		"id": "310115114001811001",
		"parentid": "310115114000"
	},
	{
		"shortname": "诚礼居委会（筹）",
		"id": "310115114001812001",
		"parentid": "310115114000"
	},
	{
		"shortname": "上丰居委会（筹）",
		"id": "310115114001813001",
		"parentid": "310115114000"
	},
	{
		"shortname": "同福居委会（筹）",
		"id": "310115114001814001",
		"parentid": "310115114000"
	},
	{
		"shortname": "培元新苑居委会（筹）",
		"id": "310115114001815001",
		"parentid": "310115114000"
	}, {
		"shortname": "顾路镇居委会",
		"id": "310115117001001001",
		"parentid": "310115117000"
	},
	{
		"shortname": "龚路镇居委会",
		"id": "310115117001002001",
		"parentid": "310115117000"
	},
	{
		"shortname": "阳光苑居委会",
		"id": "310115117001003001",
		"parentid": "310115117000"
	},
	{
		"shortname": "阳光苑第二居委会",
		"id": "310115117001004001",
		"parentid": "310115117000"
	},
	{
		"shortname": "阳光苑第三居委会",
		"id": "310115117001005001",
		"parentid": "310115117000"
	},
	{
		"shortname": "曹路居委会",
		"id": "310115117001006001",
		"parentid": "310115117000"
	},
	{
		"shortname": "龚新居委会",
		"id": "310115117001007001",
		"parentid": "310115117000"
	},
	{
		"shortname": "丰舍苑居委会",
		"id": "310115117001008001",
		"parentid": "310115117000"
	},
	{
		"shortname": "丰怡苑居委会",
		"id": "310115117001009001",
		"parentid": "310115117000"
	},
	{
		"shortname": "银丰苑居委会",
		"id": "310115117001010001",
		"parentid": "310115117000"
	},
	{
		"shortname": "美地芳邻居委会",
		"id": "310115117001011001",
		"parentid": "310115117000"
	},
	{
		"shortname": "金钻苑居委会",
		"id": "310115117001012001",
		"parentid": "310115117000"
	},
	{
		"shortname": "舜峰家苑居委会",
		"id": "310115117001013001",
		"parentid": "310115117000"
	},
	{
		"shortname": "海尚东苑居委会",
		"id": "310115117001014001",
		"parentid": "310115117000"
	},
	{
		"shortname": "中虹家苑居委会",
		"id": "310115117001015001",
		"parentid": "310115117000"
	},
	{
		"shortname": "星颂家园居委会",
		"id": "310115117001016001",
		"parentid": "310115117000"
	},
	{
		"shortname": "佳伟景苑居委会",
		"id": "310115117001017001",
		"parentid": "310115117000"
	},
	{
		"shortname": "星晓家园居委会",
		"id": "310115117001018001",
		"parentid": "310115117000"
	},
	{
		"shortname": "星海家园居委会",
		"id": "310115117001019001",
		"parentid": "310115117000"
	},
	{
		"shortname": "星纳家园居委会",
		"id": "310115117001020001",
		"parentid": "310115117000"
	},
	{
		"shortname": "星金家园居委会",
		"id": "310115117001021001",
		"parentid": "310115117000"
	},
	{
		"shortname": "金群苑居委会",
		"id": "310115117001022001",
		"parentid": "310115117000"
	},
	{
		"shortname": "永华苑居委会",
		"id": "310115117001023001",
		"parentid": "310115117000"
	},
	{
		"shortname": "永乐村村委会",
		"id": "310115117001201001",
		"parentid": "310115117000"
	},
	{
		"shortname": "民建村村委会",
		"id": "310115117001202001",
		"parentid": "310115117000"
	},
	{
		"shortname": "光耀村村委会",
		"id": "310115117001203001",
		"parentid": "310115117000"
	},
	{
		"shortname": "兴东村村委会",
		"id": "310115117001205001",
		"parentid": "310115117000"
	},
	{
		"shortname": "群乐村村委会",
		"id": "310115117001206001",
		"parentid": "310115117000"
	},
	{
		"shortname": "众三村村委会",
		"id": "310115117001207001",
		"parentid": "310115117000"
	},
	{
		"shortname": "建新村村委会",
		"id": "310115117001208001",
		"parentid": "310115117000"
	},
	{
		"shortname": "顾三村村委会",
		"id": "310115117001209001",
		"parentid": "310115117000"
	},
	{
		"shortname": "联合村村委会",
		"id": "310115117001210001",
		"parentid": "310115117000"
	},
	{
		"shortname": "东海村村委会",
		"id": "310115117001211001",
		"parentid": "310115117000"
	},
	{
		"shortname": "顾东村村委会",
		"id": "310115117001212001",
		"parentid": "310115117000"
	},
	{
		"shortname": "光明村村委会",
		"id": "310115117001213001",
		"parentid": "310115117000"
	},
	{
		"shortname": "赵桥村村委会",
		"id": "310115117001214001",
		"parentid": "310115117000"
	},
	{
		"shortname": "努力村村委会",
		"id": "310115117001215001",
		"parentid": "310115117000"
	},
	{
		"shortname": "安基村村委会",
		"id": "310115117001216001",
		"parentid": "310115117000"
	},
	{
		"shortname": "直一村村委会",
		"id": "310115117001217001",
		"parentid": "310115117000"
	},
	{
		"shortname": "直二村村委会",
		"id": "310115117001218001",
		"parentid": "310115117000"
	},
	{
		"shortname": "黎明村村委会",
		"id": "310115117001219001",
		"parentid": "310115117000"
	},
	{
		"shortname": "永和村村委会",
		"id": "310115117001220001",
		"parentid": "310115117000"
	},
	{
		"shortname": "永利村村委会",
		"id": "310115117001221001",
		"parentid": "310115117000"
	},
	{
		"shortname": "前锋村村委会",
		"id": "310115117001222001",
		"parentid": "310115117000"
	},
	{
		"shortname": "启明村村委会",
		"id": "310115117001223001",
		"parentid": "310115117000"
	},
	{
		"shortname": "迅建村村委会",
		"id": "310115117001224001",
		"parentid": "310115117000"
	},
	{
		"shortname": "曙光村村委会",
		"id": "310115117001226001",
		"parentid": "310115117000"
	},
	{
		"shortname": "新华村村委会",
		"id": "310115117001227001",
		"parentid": "310115117000"
	},
	{
		"shortname": "日新村村委会",
		"id": "310115117001228001",
		"parentid": "310115117000"
	},
	{
		"shortname": "共新村村委会",
		"id": "310115117001229001",
		"parentid": "310115117000"
	},
	{
		"shortname": "新光村村委会",
		"id": "310115117001230001",
		"parentid": "310115117000"
	},
	{
		"shortname": "五四村村委会",
		"id": "310115117001231001",
		"parentid": "310115117000"
	},
	{
		"shortname": "星火村村委会",
		"id": "310115117001232001",
		"parentid": "310115117000"
	},
	{
		"shortname": "新星村村委会",
		"id": "310115117001233001",
		"parentid": "310115117000"
	},
	{
		"shortname": "永丰村村委会",
		"id": "310115117001234001",
		"parentid": "310115117000"
	},
	{
		"shortname": "民众工作站（筹）",
		"id": "310115117001812001",
		"parentid": "310115117000"
	}, {
		"shortname": "张桥居委会",
		"id": "310115120001002001",
		"parentid": "310115120000"
	},
	{
		"shortname": "佳虹居委会",
		"id": "310115120001004001",
		"parentid": "310115120000"
	},
	{
		"shortname": "金浦居委会",
		"id": "310115120001005001",
		"parentid": "310115120000"
	},
	{
		"shortname": "阳光第一居委会",
		"id": "310115120001006001",
		"parentid": "310115120000"
	},
	{
		"shortname": "金桥新城居委会",
		"id": "310115120001008001",
		"parentid": "310115120000"
	},
	{
		"shortname": "城市家园居委会",
		"id": "310115120001009001",
		"parentid": "310115120000"
	},
	{
		"shortname": "阳光第二居委会",
		"id": "310115120001010001",
		"parentid": "310115120000"
	},
	{
		"shortname": "金葵路第一居委会",
		"id": "310115120001011001",
		"parentid": "310115120000"
	},
	{
		"shortname": "金葵路第二居委会",
		"id": "310115120001012001",
		"parentid": "310115120000"
	},
	{
		"shortname": "金葵路第三居委会",
		"id": "310115120001013001",
		"parentid": "310115120000"
	},
	{
		"shortname": "永业第一居委会",
		"id": "310115120001014001",
		"parentid": "310115120000"
	},
	{
		"shortname": "永业第二居委会",
		"id": "310115120001015001",
		"parentid": "310115120000"
	},
	{
		"shortname": "碧云第一居委会",
		"id": "310115120001016001",
		"parentid": "310115120000"
	},
	{
		"shortname": "碧云第二居委会",
		"id": "310115120001017001",
		"parentid": "310115120000"
	},
	{
		"shortname": "三桥村村委会",
		"id": "310115120001204001",
		"parentid": "310115120000"
	},
	{
		"shortname": "王家桥村村委会",
		"id": "310115120001208001",
		"parentid": "310115120000"
	},
	{
		"shortname": "陆行村村委会",
		"id": "310115120001209001",
		"parentid": "310115120000"
	}, {
		"shortname": "东沟一居委会",
		"id": "310115121001001001",
		"parentid": "310115121000"
	},
	{
		"shortname": "东沟二居委会",
		"id": "310115121001002001",
		"parentid": "310115121000"
	},
	{
		"shortname": "东沟四居委会",
		"id": "310115121001003001",
		"parentid": "310115121000"
	},
	{
		"shortname": "高行居委会",
		"id": "310115121001004001",
		"parentid": "310115121000"
	},
	{
		"shortname": "东沟居委会",
		"id": "310115121001005001",
		"parentid": "310115121000"
	},
	{
		"shortname": "华高居委会",
		"id": "310115121001006001",
		"parentid": "310115121000"
	},
	{
		"shortname": "华高新村第三居委会",
		"id": "310115121001007001",
		"parentid": "310115121000"
	},
	{
		"shortname": "华高新村第二居委会",
		"id": "310115121001008001",
		"parentid": "310115121000"
	},
	{
		"shortname": "高行新村第二居委会",
		"id": "310115121001009001",
		"parentid": "310115121000"
	},
	{
		"shortname": "东沟新村第三居委会",
		"id": "310115121001010001",
		"parentid": "310115121000"
	},
	{
		"shortname": "华高新村第四居委会",
		"id": "310115121001011001",
		"parentid": "310115121000"
	},
	{
		"shortname": "南行居委会",
		"id": "310115121001012001",
		"parentid": "310115121000"
	},
	{
		"shortname": "东力新村居委会",
		"id": "310115121001013001",
		"parentid": "310115121000"
	},
	{
		"shortname": "紫翠居委会",
		"id": "310115121001014001",
		"parentid": "310115121000"
	},
	{
		"shortname": "银杏居委会",
		"id": "310115121001015001",
		"parentid": "310115121000"
	},
	{
		"shortname": "浦江居委会",
		"id": "310115121001016001",
		"parentid": "310115121000"
	},
	{
		"shortname": "绿地居委会",
		"id": "310115121001017001",
		"parentid": "310115121000"
	},
	{
		"shortname": "幸福小镇居委会",
		"id": "310115121001018001",
		"parentid": "310115121000"
	},
	{
		"shortname": "华庭居委会",
		"id": "310115121001019001",
		"parentid": "310115121000"
	},
	{
		"shortname": "南新居委会",
		"id": "310115121001020001",
		"parentid": "310115121000"
	},
	{
		"shortname": "绿洲第一居委会",
		"id": "310115121001021001",
		"parentid": "310115121000"
	},
	{
		"shortname": "森兰金地居委会",
		"id": "310115121001022001",
		"parentid": "310115121000"
	},
	{
		"shortname": "绿洲第二居委会",
		"id": "310115121001023001",
		"parentid": "310115121000"
	},
	{
		"shortname": "绿洲第三居委会",
		"id": "310115121001024001",
		"parentid": "310115121000"
	},
	{
		"shortname": "绿洲第四居委会",
		"id": "310115121001025001",
		"parentid": "310115121000"
	},
	{
		"shortname": "东旭居委会",
		"id": "310115121001026001",
		"parentid": "310115121000"
	},
	{
		"shortname": "森兰海弘居委会",
		"id": "310115121001027001",
		"parentid": "310115121000"
	},
	{
		"shortname": "森兰尚城居委会",
		"id": "310115121001028001",
		"parentid": "310115121000"
	},
	{
		"shortname": "海韵居委会",
		"id": "310115121001029001",
		"parentid": "310115121000"
	},
	{
		"shortname": "森兰绿城居委会",
		"id": "310115121001030001",
		"parentid": "310115121000"
	},
	{
		"shortname": "周桥村村委会",
		"id": "310115121001206001",
		"parentid": "310115121000"
	},
	{
		"shortname": "高西村村委会",
		"id": "310115121001211001",
		"parentid": "310115121000"
	},
	{
		"shortname": "森兰新城居委会（筹）",
		"id": "310115121001812001",
		"parentid": "310115121000"
	},
	{
		"shortname": "森兰仁恒居委会（筹）",
		"id": "310115121001813001",
		"parentid": "310115121000"
	},
	{
		"shortname": "汇郡居委会（筹）",
		"id": "310115121001816001",
		"parentid": "310115121000"
	},
	{
		"shortname": "杨园新村第一居委会",
		"id": "310115123001001001",
		"parentid": "310115123000"
	},
	{
		"shortname": "杨园新村第二居委会",
		"id": "310115123001002001",
		"parentid": "310115123000"
	},
	{
		"shortname": "高东新村居委会",
		"id": "310115123001003001",
		"parentid": "310115123000"
	},
	{
		"shortname": "千秋嘉苑居委会",
		"id": "310115123001004001",
		"parentid": "310115123000"
	},
	{
		"shortname": "欣连苑居委会",
		"id": "310115123001005001",
		"parentid": "310115123000"
	},
	{
		"shortname": "先锋居委会",
		"id": "310115123001006001",
		"parentid": "310115123000"
	},
	{
		"shortname": "高东新村第二居委会",
		"id": "310115123001007001",
		"parentid": "310115123000"
	},
	{
		"shortname": "高东新村第三居委会",
		"id": "310115123001008001",
		"parentid": "310115123000"
	},
	{
		"shortname": "新高苑居委会",
		"id": "310115123001009001",
		"parentid": "310115123000"
	},
	{
		"shortname": "新高苑第二居委会",
		"id": "310115123001010001",
		"parentid": "310115123000"
	},
	{
		"shortname": "杨园新村第三居委会",
		"id": "310115123001011001",
		"parentid": "310115123000"
	},
	{
		"shortname": "杨园新村第四居委会",
		"id": "310115123001012001",
		"parentid": "310115123000"
	},
	{
		"shortname": "新高苑第三居委会",
		"id": "310115123001013001",
		"parentid": "310115123000"
	},
	{
		"shortname": "楼夏景园居委会",
		"id": "310115123001014001",
		"parentid": "310115123000"
	},
	{
		"shortname": "品欣雅苑居委会",
		"id": "310115123001015001",
		"parentid": "310115123000"
	},
	{
		"shortname": "珊璜村村委会",
		"id": "310115123001201001",
		"parentid": "310115123000"
	},
	{
		"shortname": "张家宅村村委会",
		"id": "310115123001202001",
		"parentid": "310115123000"
	},
	{
		"shortname": "楼下村村委会",
		"id": "310115123001203001",
		"parentid": "310115123000"
	},
	{
		"shortname": "沙港村村委会",
		"id": "310115123001204001",
		"parentid": "310115123000"
	},
	{
		"shortname": "金光村村委会",
		"id": "310115123001212001",
		"parentid": "310115123000"
	},
	{
		"shortname": "竞赛村村委会",
		"id": "310115123001214001",
		"parentid": "310115123000"
	},
	{
		"shortname": "先锋村村委会",
		"id": "310115123001215002",
		"parentid": "310115123000"
	},
	{
		"shortname": "踊跃村村委会",
		"id": "310115123001216001",
		"parentid": "310115123000"
	},
	{
		"shortname": "永新村村委会",
		"id": "310115123001217001",
		"parentid": "310115123000"
	},
	{
		"shortname": "革新村村委会",
		"id": "310115123001220001",
		"parentid": "310115123000"
	},
	{
		"shortname": "徐路村村委会",
		"id": "310115123001221001",
		"parentid": "310115123000"
	},
	{
		"shortname": "上游村村委会",
		"id": "310115123001222001",
		"parentid": "310115123000"
	}, {
		"shortname": "田园居委会",
		"id": "310115125001004001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江欣路居委会",
		"id": "310115125001005001",
		"parentid": "310115125000"
	},
	{
		"shortname": "杨镇居委会",
		"id": "310115125001006001",
		"parentid": "310115125000"
	},
	{
		"shortname": "孙桥居委会",
		"id": "310115125001008001",
		"parentid": "310115125000"
	},
	{
		"shortname": "棕桐居委会",
		"id": "310115125001009001",
		"parentid": "310115125000"
	},
	{
		"shortname": "金桐居委会",
		"id": "310115125001010001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江春居委会",
		"id": "310115125001011001",
		"parentid": "310115125000"
	},
	{
		"shortname": "丹桂路居委会",
		"id": "310115125001012001",
		"parentid": "310115125000"
	},
	{
		"shortname": "古桐居委会",
		"id": "310115125001013001",
		"parentid": "310115125000"
	},
	{
		"shortname": "香楠路居委会",
		"id": "310115125001014001",
		"parentid": "310115125000"
	},
	{
		"shortname": "孙建路居委会",
		"id": "310115125001015001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江兰居委会",
		"id": "310115125001016001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江丰居委会",
		"id": "310115125001017001",
		"parentid": "310115125000"
	},
	{
		"shortname": "碧波路居委会",
		"id": "310115125001025001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江夏居委会",
		"id": "310115125001026001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江衡居委会",
		"id": "310115125001027001",
		"parentid": "310115125000"
	},
	{
		"shortname": "华晶居委会",
		"id": "310115125001028001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江苑居委会",
		"id": "310115125001029001",
		"parentid": "310115125000"
	},
	{
		"shortname": "华顺居委会",
		"id": "310115125001030001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江益居委会",
		"id": "310115125001031001",
		"parentid": "310115125000"
	},
	{
		"shortname": "晨晖居委会",
		"id": "310115125001032001",
		"parentid": "310115125000"
	},
	{
		"shortname": "华科居委会",
		"id": "310115125001033001",
		"parentid": "310115125000"
	},
	{
		"shortname": "汤臣豪庭居委会",
		"id": "310115125001034001",
		"parentid": "310115125000"
	},
	{
		"shortname": "城市经典居委会",
		"id": "310115125001035001",
		"parentid": "310115125000"
	},
	{
		"shortname": "藿香路居委会",
		"id": "310115125001036001",
		"parentid": "310115125000"
	},
	{
		"shortname": "江薇居委会",
		"id": "310115125001037001",
		"parentid": "310115125000"
	},
	{
		"shortname": "华扬居委会",
		"id": "310115125001038001",
		"parentid": "310115125000"
	},
	{
		"shortname": "高木桥路居委会",
		"id": "310115125001039001",
		"parentid": "310115125000"
	},
	{
		"shortname": "孙环路居委会",
		"id": "310115125001040001",
		"parentid": "310115125000"
	},
	{
		"shortname": "科苑路居委会",
		"id": "310115125001041001",
		"parentid": "310115125000"
	},
	{
		"shortname": "亮秀路居委会",
		"id": "310115125001042001",
		"parentid": "310115125000"
	},
	{
		"shortname": "樟盛苑居委会",
		"id": "310115125001043001",
		"parentid": "310115125000"
	},
	{
		"shortname": "韩荡村村委会",
		"id": "310115125001211002",
		"parentid": "310115125000"
	},
	{
		"shortname": "钱堂村村委会",
		"id": "310115125001212002",
		"parentid": "310115125000"
	},
	{
		"shortname": "劳动村村委会",
		"id": "310115125001215002",
		"parentid": "310115125000"
	},
	{
		"shortname": "新丰村村委会",
		"id": "310115125001217002",
		"parentid": "310115125000"
	},
	{
		"shortname": "长元村村委会",
		"id": "310115125001218002",
		"parentid": "310115125000"
	},
	{
		"shortname": "中心村村委会",
		"id": "310115125001219002",
		"parentid": "310115125000"
	},
	{
		"shortname": "环东村村委会",
		"id": "310115125001220001",
		"parentid": "310115125000"
	},
	{
		"shortname": "沔北村村委会",
		"id": "310115125001222001",
		"parentid": "310115125000"
	},
	{
		"shortname": "汤臣社区（筹）",
		"id": "310115125001810001",
		"parentid": "310115125000"
	},
	{
		"shortname": "中芯花园居委会（筹）",
		"id": "310115125001837001",
		"parentid": "310115125000"
	},
	{
		"shortname": "荣科路居委会（筹）",
		"id": "310115125001838001",
		"parentid": "310115125000"
	},
	{
		"shortname": "孙耀路居委会（筹）",
		"id": "310115125001839001",
		"parentid": "310115125000"
	},
	{
		"shortname": "军民路居委会（筹）",
		"id": "310115125001840001",
		"parentid": "310115125000"
	},
	{
		"shortname": "高科技园区",
		"id": "310115125001841001",
		"parentid": "310115125000"
	}, {
		"shortname": "三林老街居委会",
		"id": "310115130001001001",
		"parentid": "310115130000"
	},
	{
		"shortname": "南街居委会",
		"id": "310115130001003001",
		"parentid": "310115130000"
	},
	{
		"shortname": "北街居委会",
		"id": "310115130001004001",
		"parentid": "310115130000"
	},
	{
		"shortname": "杨新居委会",
		"id": "310115130001005001",
		"parentid": "310115130000"
	},
	{
		"shortname": "思浦居委会",
		"id": "310115130001006001",
		"parentid": "310115130000"
	},
	{
		"shortname": "杨东居委会",
		"id": "310115130001007001",
		"parentid": "310115130000"
	},
	{
		"shortname": "长清路一居委会",
		"id": "310115130001009001",
		"parentid": "310115130000"
	},
	{
		"shortname": "海阳路居委会",
		"id": "310115130001010001",
		"parentid": "310115130000"
	},
	{
		"shortname": "香樟园居委会",
		"id": "310115130001013001",
		"parentid": "310115130000"
	},
	{
		"shortname": "杨南居委会",
		"id": "310115130001014001",
		"parentid": "310115130000"
	},
	{
		"shortname": "新华居委会",
		"id": "310115130001015001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林新村第五居委会",
		"id": "310115130001016002",
		"parentid": "310115130000"
	},
	{
		"shortname": "仁文居委会",
		"id": "310115130001017002",
		"parentid": "310115130000"
	},
	{
		"shortname": "华城居委会",
		"id": "310115130001020001",
		"parentid": "310115130000"
	},
	{
		"shortname": "玲珑苑居委会",
		"id": "310115130001021001",
		"parentid": "310115130000"
	},
	{
		"shortname": "山水苑居委会",
		"id": "310115130001022001",
		"parentid": "310115130000"
	},
	{
		"shortname": "申江豪城居委会",
		"id": "310115130001023001",
		"parentid": "310115130000"
	},
	{
		"shortname": "岭南花苑居委会",
		"id": "310115130001024001",
		"parentid": "310115130000"
	},
	{
		"shortname": "明丰花苑居委会",
		"id": "310115130001025001",
		"parentid": "310115130000"
	},
	{
		"shortname": "金苹果花苑居委会",
		"id": "310115130001026001",
		"parentid": "310115130000"
	},
	{
		"shortname": "永泰路第一居委会",
		"id": "310115130001027001",
		"parentid": "310115130000"
	},
	{
		"shortname": "永泰路第二居委会",
		"id": "310115130001028001",
		"parentid": "310115130000"
	},
	{
		"shortname": "翰城居委会",
		"id": "310115130001029001",
		"parentid": "310115130000"
	},
	{
		"shortname": "永泰路第三居委会",
		"id": "310115130001030001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林世博家园第一居委会",
		"id": "310115130001031001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林世博家园第三居委会",
		"id": "310115130001033001",
		"parentid": "310115130000"
	},
	{
		"shortname": "永泰路第四居委会",
		"id": "310115130001034001",
		"parentid": "310115130000"
	},
	{
		"shortname": "永泰路第五居委会",
		"id": "310115130001035001",
		"parentid": "310115130000"
	},
	{
		"shortname": "世博家园第四居委会",
		"id": "310115130001036001",
		"parentid": "310115130000"
	},
	{
		"shortname": "杨思路第二居委会",
		"id": "310115130001037001",
		"parentid": "310115130000"
	},
	{
		"shortname": "杨南第二居委会",
		"id": "310115130001038001",
		"parentid": "310115130000"
	},
	{
		"shortname": "杨思路第三居委会",
		"id": "310115130001039001",
		"parentid": "310115130000"
	},
	{
		"shortname": "尚东国际居委会",
		"id": "310115130001040001",
		"parentid": "310115130000"
	},
	{
		"shortname": "长清路第二居委会",
		"id": "310115130001041001",
		"parentid": "310115130000"
	},
	{
		"shortname": "杨思路第一居委会",
		"id": "310115130001042001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林新村第二居委会",
		"id": "310115130001043001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林世博家园第五居委会",
		"id": "310115130001044001",
		"parentid": "310115130000"
	},
	{
		"shortname": "世博家园南二居委会",
		"id": "310115130001045001",
		"parentid": "310115130000"
	},
	{
		"shortname": "世博家园北二居委会",
		"id": "310115130001046001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林博学家园居委会",
		"id": "310115130001047001",
		"parentid": "310115130000"
	},
	{
		"shortname": "懿德新村第一居委会",
		"id": "310115130001048001",
		"parentid": "310115130000"
	},
	{
		"shortname": "永泰路第六居委会",
		"id": "310115130001049001",
		"parentid": "310115130000"
	},
	{
		"shortname": "懿德第二居委会",
		"id": "310115130001050001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林新村第三居委会",
		"id": "310115130001051001",
		"parentid": "310115130000"
	},
	{
		"shortname": "城林美苑居委会",
		"id": "310115130001052001",
		"parentid": "310115130000"
	},
	{
		"shortname": "绿波家园居委会",
		"id": "310115130001053001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三杨新村居委会",
		"id": "310115130001054001",
		"parentid": "310115130000"
	},
	{
		"shortname": "盛世南苑居委会",
		"id": "310115130001055001",
		"parentid": "310115130000"
	},
	{
		"shortname": "士韵家园居委会",
		"id": "310115130001056001",
		"parentid": "310115130000"
	},
	{
		"shortname": "同康苑居委会",
		"id": "310115130001057001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林新村第四居委会",
		"id": "310115130001058001",
		"parentid": "310115130000"
	},
	{
		"shortname": "依水园居委会",
		"id": "310115130001059001",
		"parentid": "310115130000"
	},
	{
		"shortname": "德康苑居委会",
		"id": "310115130001060001",
		"parentid": "310115130000"
	},
	{
		"shortname": "士韵家园第二居委会",
		"id": "310115130001061001",
		"parentid": "310115130000"
	},
	{
		"shortname": "依水园第二居委会",
		"id": "310115130001062001",
		"parentid": "310115130000"
	},
	{
		"shortname": "东明村村委会",
		"id": "310115130001201001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三民村村委会",
		"id": "310115130001203001",
		"parentid": "310115130000"
	},
	{
		"shortname": "联丰村村委会",
		"id": "310115130001204001",
		"parentid": "310115130000"
	},
	{
		"shortname": "中林村村委会",
		"id": "310115130001205001",
		"parentid": "310115130000"
	},
	{
		"shortname": "三林村村委会",
		"id": "310115130001206001",
		"parentid": "310115130000"
	},
	{
		"shortname": "归泾村村委会",
		"id": "310115130001208001",
		"parentid": "310115130000"
	},
	{
		"shortname": "久丰村村委会",
		"id": "310115130001209001",
		"parentid": "310115130000"
	},
	{
		"shortname": "临江村村委会",
		"id": "310115130001211001",
		"parentid": "310115130000"
	},
	{
		"shortname": "新春村村委会",
		"id": "310115130001212001",
		"parentid": "310115130000"
	},
	{
		"shortname": "西林村村委会",
		"id": "310115130001213001",
		"parentid": "310115130000"
	},
	{
		"shortname": "红旗村村委会",
		"id": "310115130001214001",
		"parentid": "310115130000"
	},
	{
		"shortname": "懿德村村委会",
		"id": "310115130001215001",
		"parentid": "310115130000"
	},
	{
		"shortname": "天花庵村村委会",
		"id": "310115130001216001",
		"parentid": "310115130000"
	},
	{
		"shortname": "金光村村委会",
		"id": "310115130001217001",
		"parentid": "310115130000"
	},
	{
		"shortname": "南阜村村委会",
		"id": "310115130001220001",
		"parentid": "310115130000"
	},
	{
		"shortname": "胡巷村村委会",
		"id": "310115130001221001",
		"parentid": "310115130000"
	},
	{
		"shortname": "城林雅苑居委会（筹）",
		"id": "310115130001827001",
		"parentid": "310115130000"
	},
	{
		"shortname": "东门居委会",
		"id": "310115131001001001",
		"parentid": "310115131000"
	},
	{
		"shortname": "南门居委会",
		"id": "310115131001002001",
		"parentid": "310115131000"
	},
	{
		"shortname": "北门居委会",
		"id": "310115131001003001",
		"parentid": "310115131000"
	},
	{
		"shortname": "荡湾居委会",
		"id": "310115131001004001",
		"parentid": "310115131000"
	},
	{
		"shortname": "西门居委会",
		"id": "310115131001005001",
		"parentid": "310115131000"
	},
	{
		"shortname": "听北居委会",
		"id": "310115131001006001",
		"parentid": "310115131000"
	},
	{
		"shortname": "听南居委会",
		"id": "310115131001007001",
		"parentid": "310115131000"
	},
	{
		"shortname": "梅花居委会",
		"id": "310115131001008001",
		"parentid": "310115131000"
	},
	{
		"shortname": "东城居委会",
		"id": "310115131001009001",
		"parentid": "310115131000"
	},
	{
		"shortname": "黄路居委会",
		"id": "310115131001010001",
		"parentid": "310115131000"
	},
	{
		"shortname": "卫星居委会",
		"id": "310115131001011001",
		"parentid": "310115131000"
	},
	{
		"shortname": "红光居委会",
		"id": "310115131001012001",
		"parentid": "310115131000"
	},
	{
		"shortname": "靖海居委会",
		"id": "310115131001013001",
		"parentid": "310115131000"
	},
	{
		"shortname": "海燕居委会",
		"id": "310115131001014001",
		"parentid": "310115131000"
	},
	{
		"shortname": "泰燕社区居委会",
		"id": "310115131001015001",
		"parentid": "310115131000"
	},
	{
		"shortname": "迎薰社区居委会",
		"id": "310115131001016001",
		"parentid": "310115131000"
	},
	{
		"shortname": "西城社区居委会",
		"id": "310115131001017001",
		"parentid": "310115131000"
	},
	{
		"shortname": "明光居委会",
		"id": "310115131001018001",
		"parentid": "310115131000"
	},
	{
		"shortname": "观海居委会",
		"id": "310115131001019001",
		"parentid": "310115131000"
	},
	{
		"shortname": "学海居委会",
		"id": "310115131001020001",
		"parentid": "310115131000"
	},
	{
		"shortname": "惠城居委会",
		"id": "310115131001021001",
		"parentid": "310115131000"
	},
	{
		"shortname": "惠园居委会",
		"id": "310115131001022001",
		"parentid": "310115131000"
	},
	{
		"shortname": "南园居委会",
		"id": "310115131001023001",
		"parentid": "310115131000"
	},
	{
		"shortname": "绿城居委会",
		"id": "310115131001024001",
		"parentid": "310115131000"
	},
	{
		"shortname": "南城居委会",
		"id": "310115131001025001",
		"parentid": "310115131000"
	},
	{
		"shortname": "惠民居委会",
		"id": "310115131001026001",
		"parentid": "310115131000"
	},
	{
		"shortname": "丰海居委会",
		"id": "310115131001027001",
		"parentid": "310115131000"
	},
	{
		"shortname": "德盈居委会",
		"id": "310115131001028001",
		"parentid": "310115131000"
	},
	{
		"shortname": "西门村村委会",
		"id": "310115131001201001",
		"parentid": "310115131000"
	},
	{
		"shortname": "城北村村委会",
		"id": "310115131001202001",
		"parentid": "310115131000"
	},
	{
		"shortname": "明光村村委会",
		"id": "310115131001203001",
		"parentid": "310115131000"
	},
	{
		"shortname": "民乐村村委会",
		"id": "310115131001204001",
		"parentid": "310115131000"
	},
	{
		"shortname": "红光村村委会",
		"id": "310115131001205001",
		"parentid": "310115131000"
	},
	{
		"shortname": "长江村村委会",
		"id": "310115131001206001",
		"parentid": "310115131000"
	},
	{
		"shortname": "陆路村村委会",
		"id": "310115131001207001",
		"parentid": "310115131000"
	},
	{
		"shortname": "勤丰村村委会",
		"id": "310115131001208001",
		"parentid": "310115131000"
	},
	{
		"shortname": "惠东村村委会",
		"id": "310115131001209001",
		"parentid": "310115131000"
	},
	{
		"shortname": "塘路村村委会",
		"id": "310115131001210001",
		"parentid": "310115131000"
	},
	{
		"shortname": "灶路村村委会",
		"id": "310115131001211001",
		"parentid": "310115131000"
	},
	{
		"shortname": "英雄村村委会",
		"id": "310115131001212001",
		"parentid": "310115131000"
	},
	{
		"shortname": "同治村村委会",
		"id": "310115131001213001",
		"parentid": "310115131000"
	},
	{
		"shortname": "双店村村委会",
		"id": "310115131001214001",
		"parentid": "310115131000"
	},
	{
		"shortname": "六灶湾村村委会",
		"id": "310115131001215001",
		"parentid": "310115131000"
	},
	{
		"shortname": "桥北村村委会",
		"id": "310115131001216001",
		"parentid": "310115131000"
	},
	{
		"shortname": "四墩村村委会",
		"id": "310115131001217001",
		"parentid": "310115131000"
	},
	{
		"shortname": "团结村村委会",
		"id": "310115131001218001",
		"parentid": "310115131000"
	},
	{
		"shortname": "幸福村村委会",
		"id": "310115131001219001",
		"parentid": "310115131000"
	},
	{
		"shortname": "黄路村村委会",
		"id": "310115131001220001",
		"parentid": "310115131000"
	},
	{
		"shortname": "远东村村委会",
		"id": "310115131001221001",
		"parentid": "310115131000"
	},
	{
		"shortname": "海沈村村委会",
		"id": "310115131001222001",
		"parentid": "310115131000"
	},
	{
		"shortname": "东征村村委会",
		"id": "310115131001223001",
		"parentid": "310115131000"
	},
	{
		"shortname": "永乐村村委会",
		"id": "310115131001224001",
		"parentid": "310115131000"
	},
	{
		"shortname": "陆楼村村委会",
		"id": "310115131001225001",
		"parentid": "310115131000"
	},
	{
		"shortname": "城南村村委会",
		"id": "310115131001226001",
		"parentid": "310115131000"
	},
	{
		"shortname": "陶桥村村委会",
		"id": "310115131001227001",
		"parentid": "310115131000"
	},
	{
		"shortname": "徐庙村村委会",
		"id": "310115131001228001",
		"parentid": "310115131000"
	},
	{
		"shortname": "汇南村村委会",
		"id": "310115131001229001",
		"parentid": "310115131000"
	},
	{
		"shortname": "惠益居委会（筹）",
		"id": "310115131001805001",
		"parentid": "310115131000"
	},
	{
		"shortname": "惠康居委会（筹）",
		"id": "310115131001806001",
		"parentid": "310115131000"
	},
	{
		"shortname": "朗馨苑居委会（筹）",
		"id": "310115131001809001",
		"parentid": "310115131000"
	},
	{
		"shortname": "汇雅苑居委会（筹）",
		"id": "310115131001810001",
		"parentid": "310115131000"
	},
	{
		"shortname": "颐景园居委会（筹）",
		"id": "310115131001811001",
		"parentid": "310115131000"
	},
	{
		"shortname": "宝业居委会（筹）",
		"id": "310115131001812001",
		"parentid": "310115131000"
	},
	{
		"shortname": "海曲雅苑居委会（筹）",
		"id": "310115131001813001",
		"parentid": "310115131000"
	},
	{
		"shortname": "丽水雅苑居委会（筹）",
		"id": "310115131001814001",
		"parentid": "310115131000"
	},
	{
		"shortname": "兰丽苑居委会（筹）",
		"id": "310115131001815001",
		"parentid": "310115131000"
	},
	{
		"shortname": "荣春苑居委会（筹）",
		"id": "310115131001816001",
		"parentid": "310115131000"
	},
	{
		"shortname": "秀园居委会（筹）",
		"id": "310115131001817001",
		"parentid": "310115131000"
	}, {
		"shortname": "向阳居委会",
		"id": "310115132001001001",
		"parentid": "310115132000"
	},
	{
		"shortname": "东南居委会",
		"id": "310115132001002001",
		"parentid": "310115132000"
	},
	{
		"shortname": "公元居委会",
		"id": "310115132001003001",
		"parentid": "310115132000"
	},
	{
		"shortname": "中市居委会",
		"id": "310115132001004001",
		"parentid": "310115132000"
	},
	{
		"shortname": "周东居委会",
		"id": "310115132001005001",
		"parentid": "310115132000"
	},
	{
		"shortname": "澧溪居委会",
		"id": "310115132001006001",
		"parentid": "310115132000"
	},
	{
		"shortname": "瓦屑居委会",
		"id": "310115132001007001",
		"parentid": "310115132000"
	},
	{
		"shortname": "果园居委会",
		"id": "310115132001008001",
		"parentid": "310115132000"
	},
	{
		"shortname": "汇丽社区居委会",
		"id": "310115132001009001",
		"parentid": "310115132000"
	},
	{
		"shortname": "幸福社区居委会",
		"id": "310115132001010001",
		"parentid": "310115132000"
	},
	{
		"shortname": "安居社区居委会",
		"id": "310115132001011001",
		"parentid": "310115132000"
	},
	{
		"shortname": "欧风社区居委会",
		"id": "310115132001012001",
		"parentid": "310115132000"
	},
	{
		"shortname": "汇腾社区居委会",
		"id": "310115132001013001",
		"parentid": "310115132000"
	},
	{
		"shortname": "海达社区居委会",
		"id": "310115132001014001",
		"parentid": "310115132000"
	},
	{
		"shortname": "横桥社区居委会",
		"id": "310115132001015001",
		"parentid": "310115132000"
	},
	{
		"shortname": "丽都苑居委会",
		"id": "310115132001016001",
		"parentid": "310115132000"
	},
	{
		"shortname": "中虹佳园居委会",
		"id": "310115132001017001",
		"parentid": "310115132000"
	},
	{
		"shortname": "瑞阳苑居委会",
		"id": "310115132001018001",
		"parentid": "310115132000"
	},
	{
		"shortname": "中城苑居委会",
		"id": "310115132001019001",
		"parentid": "310115132000"
	},
	{
		"shortname": "安阁苑居委会",
		"id": "310115132001020001",
		"parentid": "310115132000"
	},
	{
		"shortname": "小上海新城居委会",
		"id": "310115132001021001",
		"parentid": "310115132000"
	},
	{
		"shortname": "康泰居委会",
		"id": "310115132001022001",
		"parentid": "310115132000"
	},
	{
		"shortname": "欣逸居委会",
		"id": "310115132001023001",
		"parentid": "310115132000"
	},
	{
		"shortname": "印象春城居委会",
		"id": "310115132001024001",
		"parentid": "310115132000"
	},
	{
		"shortname": "南八灶居委会",
		"id": "310115132001025001",
		"parentid": "310115132000"
	},
	{
		"shortname": "华庭居委会",
		"id": "310115132001026001",
		"parentid": "310115132000"
	},
	{
		"shortname": "御沁园居委会",
		"id": "310115132001027001",
		"parentid": "310115132000"
	},
	{
		"shortname": "华城居委会",
		"id": "310115132001028001",
		"parentid": "310115132000"
	},
	{
		"shortname": "汇康居委会",
		"id": "310115132001029001",
		"parentid": "310115132000"
	},
	{
		"shortname": "吉祥里居委会",
		"id": "310115132001030001",
		"parentid": "310115132000"
	},
	{
		"shortname": "兴盛里居委会",
		"id": "310115132001031001",
		"parentid": "310115132000"
	},
	{
		"shortname": "颐谷苑居委会",
		"id": "310115132001032001",
		"parentid": "310115132000"
	},
	{
		"shortname": "昌盛里居委会",
		"id": "310115132001033001",
		"parentid": "310115132000"
	},
	{
		"shortname": "平安里居委会",
		"id": "310115132001034001",
		"parentid": "310115132000"
	},
	{
		"shortname": "姚桥村村委会",
		"id": "310115132001201001",
		"parentid": "310115132000"
	},
	{
		"shortname": "牛桥村村委会",
		"id": "310115132001202001",
		"parentid": "310115132000"
	},
	{
		"shortname": "塘东村村委会",
		"id": "310115132001203001",
		"parentid": "310115132000"
	},
	{
		"shortname": "周东村村委会",
		"id": "310115132001204001",
		"parentid": "310115132000"
	},
	{
		"shortname": "周南村村委会",
		"id": "310115132001205001",
		"parentid": "310115132000"
	},
	{
		"shortname": "沈西村村委会",
		"id": "310115132001206001",
		"parentid": "310115132000"
	},
	{
		"shortname": "里仁村村委会",
		"id": "310115132001208001",
		"parentid": "310115132000"
	},
	{
		"shortname": "棋杆村村委会",
		"id": "310115132001209001",
		"parentid": "310115132000"
	},
	{
		"shortname": "瓦南村村委会",
		"id": "310115132001210001",
		"parentid": "310115132000"
	},
	{
		"shortname": "红桥村村委会",
		"id": "310115132001211001",
		"parentid": "310115132000"
	},
	{
		"shortname": "界浜村村委会",
		"id": "310115132001212001",
		"parentid": "310115132000"
	},
	{
		"shortname": "北庄村村委会",
		"id": "310115132001213001",
		"parentid": "310115132000"
	},
	{
		"shortname": "中金海棠湾居委会（筹）",
		"id": "310115132001819001",
		"parentid": "310115132000"
	},
	{
		"shortname": "健康里居委会（筹）",
		"id": "310115132001820001",
		"parentid": "310115132000"
	},
	{
		"shortname": "九龙仓居委会（筹）",
		"id": "310115132001821001",
		"parentid": "310115132000"
	},
	{
		"shortname": "安康里居委会（筹）",
		"id": "310115132001822001",
		"parentid": "310115132000"
	},
	{
		"shortname": "祥和里居委会（筹）",
		"id": "310115132001823001",
		"parentid": "310115132000"
	},
	{
		"shortname": "保利艾庐居委会（筹）",
		"id": "310115132001824001",
		"parentid": "310115132000"
	},
	{
		"shortname": "华盛里居委会（筹）",
		"id": "310115132001825001",
		"parentid": "310115132000"
	},
	{
		"shortname": "泰顺里居委会（筹）",
		"id": "310115132001826001",
		"parentid": "310115132000"
	}, {
		"shortname": "南大居委会",
		"id": "310115133001001001",
		"parentid": "310115133000"
	},
	{
		"shortname": "工农居委会",
		"id": "310115133001002001",
		"parentid": "310115133000"
	},
	{
		"shortname": "北大居委会",
		"id": "310115133001003001",
		"parentid": "310115133000"
	},
	{
		"shortname": "石笋居委会",
		"id": "310115133001004001",
		"parentid": "310115133000"
	},
	{
		"shortname": "坦直居委会",
		"id": "310115133001005001",
		"parentid": "310115133000"
	},
	{
		"shortname": "东城居委会",
		"id": "310115133001006001",
		"parentid": "310115133000"
	},
	{
		"shortname": "笋南居委会",
		"id": "310115133001007001",
		"parentid": "310115133000"
	},
	{
		"shortname": "汇锦城居委会",
		"id": "310115133001008001",
		"parentid": "310115133000"
	},
	{
		"shortname": "东城第二居委会",
		"id": "310115133001009001",
		"parentid": "310115133000"
	},
	{
		"shortname": "王桥村村委会",
		"id": "310115133001201001",
		"parentid": "310115133000"
	},
	{
		"shortname": "金建村村委会",
		"id": "310115133001202001",
		"parentid": "310115133000"
	},
	{
		"shortname": "新卫村村委会",
		"id": "310115133001203001",
		"parentid": "310115133000"
	},
	{
		"shortname": "果园村村委会",
		"id": "310115133001204001",
		"parentid": "310115133000"
	},
	{
		"shortname": "新南村村委会",
		"id": "310115133001205001",
		"parentid": "310115133000"
	},
	{
		"shortname": "众安村村委会",
		"id": "310115133001206001",
		"parentid": "310115133000"
	},
	{
		"shortname": "新场村村委会",
		"id": "310115133001207001",
		"parentid": "310115133000"
	},
	{
		"shortname": "坦西村村委会",
		"id": "310115133001208001",
		"parentid": "310115133000"
	},
	{
		"shortname": "仁义村村委会",
		"id": "310115133001209001",
		"parentid": "310115133000"
	},
	{
		"shortname": "坦东村村委会",
		"id": "310115133001210001",
		"parentid": "310115133000"
	},
	{
		"shortname": "蒋桥村村委会",
		"id": "310115133001211001",
		"parentid": "310115133000"
	},
	{
		"shortname": "祝桥村村委会",
		"id": "310115133001212001",
		"parentid": "310115133000"
	},
	{
		"shortname": "坦南村村委会",
		"id": "310115133001213001",
		"parentid": "310115133000"
	}, {
		"shortname": "南大居委会",
		"id": "310115134001001001",
		"parentid": "310115134000"
	},
	{
		"shortname": "北大居委会",
		"id": "310115134001002001",
		"parentid": "310115134000"
	},
	{
		"shortname": "三墩居委会",
		"id": "310115134001003001",
		"parentid": "310115134000"
	},
	{
		"shortname": "东大社区居委会",
		"id": "310115134001004001",
		"parentid": "310115134000"
	},
	{
		"shortname": "东南居委会",
		"id": "310115134001005001",
		"parentid": "310115134000"
	},
	{
		"shortname": "镇南村村委会",
		"id": "310115134001201001",
		"parentid": "310115134000"
	},
	{
		"shortname": "车站村村委会",
		"id": "310115134001202001",
		"parentid": "310115134000"
	},
	{
		"shortname": "果园村村委会",
		"id": "310115134001203001",
		"parentid": "310115134000"
	},
	{
		"shortname": "金石村村委会",
		"id": "310115134001204001",
		"parentid": "310115134000"
	},
	{
		"shortname": "赵桥村村委会",
		"id": "310115134001205001",
		"parentid": "310115134000"
	},
	{
		"shortname": "海潮村村委会",
		"id": "310115134001206001",
		"parentid": "310115134000"
	},
	{
		"shortname": "邵宅村村委会",
		"id": "310115134001207001",
		"parentid": "310115134000"
	},
	{
		"shortname": "团西村村委会",
		"id": "310115134001208001",
		"parentid": "310115134000"
	},
	{
		"shortname": "金园村村委会",
		"id": "310115134001209001",
		"parentid": "310115134000"
	},
	{
		"shortname": "金桥村村委会",
		"id": "310115134001210001",
		"parentid": "310115134000"
	},
	{
		"shortname": "园艺村村委会",
		"id": "310115134001211001",
		"parentid": "310115134000"
	},
	{
		"shortname": "龙树村村委会",
		"id": "310115134001212001",
		"parentid": "310115134000"
	},
	{
		"shortname": "周埠村村委会",
		"id": "310115134001213001",
		"parentid": "310115134000"
	},
	{
		"shortname": "扶栏村村委会",
		"id": "310115134001214001",
		"parentid": "310115134000"
	},
	{
		"shortname": "团新村村委会",
		"id": "310115134001215001",
		"parentid": "310115134000"
	},
	{
		"shortname": "邵村村委会",
		"id": "310115134001216001",
		"parentid": "310115134000"
	},
	{
		"shortname": "周康居委会",
		"id": "310115136001001001",
		"parentid": "310115136000"
	},
	{
		"shortname": "梓潼居委会",
		"id": "310115136001002001",
		"parentid": "310115136000"
	},
	{
		"shortname": "百曲居委会",
		"id": "310115136001003001",
		"parentid": "310115136000"
	},
	{
		"shortname": "营房居委会",
		"id": "310115136001004001",
		"parentid": "310115136000"
	},
	{
		"shortname": "花墙居委会",
		"id": "310115136001005001",
		"parentid": "310115136000"
	},
	{
		"shortname": "和合居委会",
		"id": "310115136001006001",
		"parentid": "310115136000"
	},
	{
		"shortname": "横沔居委会",
		"id": "310115136001007001",
		"parentid": "310115136000"
	},
	{
		"shortname": "汤巷中心居委会",
		"id": "310115136001008001",
		"parentid": "310115136000"
	},
	{
		"shortname": "康桥半岛居委会",
		"id": "310115136001009001",
		"parentid": "310115136000"
	},
	{
		"shortname": "秀龙居委会",
		"id": "310115136001010001",
		"parentid": "310115136000"
	},
	{
		"shortname": "康桥老街居委会",
		"id": "310115136001011001",
		"parentid": "310115136000"
	},
	{
		"shortname": "康桥花园居委会",
		"id": "310115136001012001",
		"parentid": "310115136000"
	},
	{
		"shortname": "双秀家园居委会",
		"id": "310115136001013001",
		"parentid": "310115136000"
	},
	{
		"shortname": "公元三村居委会",
		"id": "310115136001014001",
		"parentid": "310115136000"
	},
	{
		"shortname": "南华城居委会",
		"id": "310115136001015001",
		"parentid": "310115136000"
	},
	{
		"shortname": "昱龙社区居委会",
		"id": "310115136001016001",
		"parentid": "310115136000"
	},
	{
		"shortname": "美林社区居委会",
		"id": "310115136001017001",
		"parentid": "310115136000"
	},
	{
		"shortname": "中邦社区居委会",
		"id": "310115136001018001",
		"parentid": "310115136000"
	},
	{
		"shortname": "海尚康庭居委会",
		"id": "310115136001019001",
		"parentid": "310115136000"
	},
	{
		"shortname": "康桥宝邸居委会",
		"id": "310115136001020001",
		"parentid": "310115136000"
	},
	{
		"shortname": "康桥月苑居委会",
		"id": "310115136001021001",
		"parentid": "310115136000"
	},
	{
		"shortname": "城中花园居委会",
		"id": "310115136001022001",
		"parentid": "310115136000"
	},
	{
		"shortname": "汤巷馨村居委会",
		"id": "310115136001023001",
		"parentid": "310115136000"
	},
	{
		"shortname": "文怡苑居委会",
		"id": "310115136001024001",
		"parentid": "310115136000"
	},
	{
		"shortname": "富康居委会",
		"id": "310115136001025001",
		"parentid": "310115136000"
	},
	{
		"shortname": "锦绣居委会",
		"id": "310115136001026001",
		"parentid": "310115136000"
	},
	{
		"shortname": "宁怡居委会",
		"id": "310115136001027001",
		"parentid": "310115136000"
	},
	{
		"shortname": "天台居委会",
		"id": "310115136001028001",
		"parentid": "310115136000"
	},
	{
		"shortname": "林语溪居委会",
		"id": "310115136001029001",
		"parentid": "310115136000"
	},
	{
		"shortname": "香颂居委会",
		"id": "310115136001030001",
		"parentid": "310115136000"
	},
	{
		"shortname": "御景居委会",
		"id": "310115136001031001",
		"parentid": "310115136000"
	},
	{
		"shortname": "双秀西园居委会",
		"id": "310115136001032001",
		"parentid": "310115136000"
	},
	{
		"shortname": "海富居委会",
		"id": "310115136001033001",
		"parentid": "310115136000"
	},
	{
		"shortname": "康湾苑居委会",
		"id": "310115136001034001",
		"parentid": "310115136000"
	},
	{
		"shortname": "汤巷雅苑居委会",
		"id": "310115136001035001",
		"parentid": "310115136000"
	},
	{
		"shortname": "秀怡苑居委会",
		"id": "310115136001036001",
		"parentid": "310115136000"
	},
	{
		"shortname": "太平村村委会",
		"id": "310115136001201001",
		"parentid": "310115136000"
	},
	{
		"shortname": "沔青村村委会",
		"id": "310115136001202001",
		"parentid": "310115136000"
	},
	{
		"shortname": "石门村村委会",
		"id": "310115136001203001",
		"parentid": "310115136000"
	},
	{
		"shortname": "火箭村村委会",
		"id": "310115136001204001",
		"parentid": "310115136000"
	},
	{
		"shortname": "怡园村村委会",
		"id": "310115136001205001",
		"parentid": "310115136000"
	},
	{
		"shortname": "沿南村村委会",
		"id": "310115136001206001",
		"parentid": "310115136000"
	},
	{
		"shortname": "人南村村委会",
		"id": "310115136001207001",
		"parentid": "310115136000"
	},
	{
		"shortname": "汤巷村村委会",
		"id": "310115136001209001",
		"parentid": "310115136000"
	},
	{
		"shortname": "叠桥村村委会",
		"id": "310115136001210001",
		"parentid": "310115136000"
	},
	{
		"shortname": "沿北村村委会",
		"id": "310115136001211001",
		"parentid": "310115136000"
	},
	{
		"shortname": "新苗村村委会",
		"id": "310115136001212001",
		"parentid": "310115136000"
	},
	{
		"shortname": "航头居委会",
		"id": "310115137001001001",
		"parentid": "310115137000"
	},
	{
		"shortname": "下沙居委会",
		"id": "310115137001002001",
		"parentid": "310115137000"
	},
	{
		"shortname": "瑞和苑社区居委会",
		"id": "310115137001003001",
		"parentid": "310115137000"
	},
	{
		"shortname": "鹤鸣社区居委会",
		"id": "310115137001004001",
		"parentid": "310115137000"
	},
	{
		"shortname": "长达社区居委会",
		"id": "310115137001005001",
		"parentid": "310115137000"
	},
	{
		"shortname": "金色航城居委会",
		"id": "310115137001006001",
		"parentid": "310115137000"
	},
	{
		"shortname": "东升家园居委会",
		"id": "310115137001007001",
		"parentid": "310115137000"
	},
	{
		"shortname": "海洲桃花园居委会",
		"id": "310115137001008001",
		"parentid": "310115137000"
	},
	{
		"shortname": "沉香居委会",
		"id": "310115137001009001",
		"parentid": "310115137000"
	},
	{
		"shortname": "南馨佳苑居委会",
		"id": "310115137001010001",
		"parentid": "310115137000"
	},
	{
		"shortname": "恒福家园居委会",
		"id": "310115137001011001",
		"parentid": "310115137000"
	},
	{
		"shortname": "昱丽家园居委会",
		"id": "310115137001012001",
		"parentid": "310115137000"
	},
	{
		"shortname": "瑞浦嘉苑居委会",
		"id": "310115137001013001",
		"parentid": "310115137000"
	},
	{
		"shortname": "航武嘉园居委会",
		"id": "310115137001014001",
		"parentid": "310115137000"
	},
	{
		"shortname": "海桥村村委会",
		"id": "310115137001201001",
		"parentid": "310115137000"
	},
	{
		"shortname": "鹤鸣村村委会",
		"id": "310115137001202001",
		"parentid": "310115137000"
	},
	{
		"shortname": "长达村村委会",
		"id": "310115137001203001",
		"parentid": "310115137000"
	},
	{
		"shortname": "果园村村委会",
		"id": "310115137001204001",
		"parentid": "310115137000"
	},
	{
		"shortname": "福善村村委会",
		"id": "310115137001205001",
		"parentid": "310115137000"
	},
	{
		"shortname": "沉香村村委会",
		"id": "310115137001206001",
		"parentid": "310115137000"
	},
	{
		"shortname": "鹤东村村委会",
		"id": "310115137001207001",
		"parentid": "310115137000"
	},
	{
		"shortname": "沈庄村村委会",
		"id": "310115137001208001",
		"parentid": "310115137000"
	},
	{
		"shortname": "王楼村村委会",
		"id": "310115137001209001",
		"parentid": "310115137000"
	},
	{
		"shortname": "梅园村村委会",
		"id": "310115137001210001",
		"parentid": "310115137000"
	},
	{
		"shortname": "牌楼村村委会",
		"id": "310115137001211001",
		"parentid": "310115137000"
	},
	{
		"shortname": "航东村村委会",
		"id": "310115137001212001",
		"parentid": "310115137000"
	},
	{
		"shortname": "丰桥村村委会",
		"id": "310115137001213001",
		"parentid": "310115137000"
	},
	{
		"shortname": "昱星家园社区居委会（筹）",
		"id": "310115137001801001",
		"parentid": "310115137000"
	},
	{
		"shortname": "金沁苑社区居委会（筹）",
		"id": "310115137001804001",
		"parentid": "310115137000"
	},
	{
		"shortname": "东茗苑社区居委会（筹）",
		"id": "310115137001807001",
		"parentid": "310115137000"
	},
	{
		"shortname": "汇诚佳苑居委会（筹）",
		"id": "310115137001808001",
		"parentid": "310115137000"
	},
	{
		"shortname": "汇善佳苑居委会（筹）",
		"id": "310115137001809001",
		"parentid": "310115137000"
	},
	{
		"shortname": "瑞馨居委会（筹）",
		"id": "310115137001810001",
		"parentid": "310115137000"
	},
	{
		"shortname": "和美苑居委会（筹）",
		"id": "310115137001811001",
		"parentid": "310115137000"
	}, {
		"shortname": "第一居委会",
		"id": "310115139001001001",
		"parentid": "310115139000"
	},
	{
		"shortname": "第二居委会",
		"id": "310115139001002001",
		"parentid": "310115139000"
	},
	{
		"shortname": "东港花苑居委会",
		"id": "310115139001003001",
		"parentid": "310115139000"
	},
	{
		"shortname": "东海居委会",
		"id": "310115139001004001",
		"parentid": "310115139000"
	},
	{
		"shortname": "盐仓居委会",
		"id": "310115139001005001",
		"parentid": "310115139000"
	},
	{
		"shortname": "朝阳社区居委会",
		"id": "310115139001006001",
		"parentid": "310115139000"
	},
	{
		"shortname": "千汇一村社区居委会",
		"id": "310115139001007001",
		"parentid": "310115139000"
	},
	{
		"shortname": "千汇二村社区居委会",
		"id": "310115139001008001",
		"parentid": "310115139000"
	},
	{
		"shortname": "千汇三村社区居委会",
		"id": "310115139001009001",
		"parentid": "310115139000"
	},
	{
		"shortname": "千汇四村社区居委会",
		"id": "310115139001010001",
		"parentid": "310115139000"
	},
	{
		"shortname": "祝和苑社区居委会",
		"id": "310115139001011001",
		"parentid": "310115139000"
	},
	{
		"shortname": "江镇居委会",
		"id": "310115139001012001",
		"parentid": "310115139000"
	},
	{
		"shortname": "思凡一居委会",
		"id": "310115139001013001",
		"parentid": "310115139000"
	},
	{
		"shortname": "思凡二居委会",
		"id": "310115139001014001",
		"parentid": "310115139000"
	},
	{
		"shortname": "思凡三居委会",
		"id": "310115139001015001",
		"parentid": "310115139000"
	},
	{
		"shortname": "施镇居委会",
		"id": "310115139001016001",
		"parentid": "310115139000"
	},
	{
		"shortname": "晨阳居委会",
		"id": "310115139001017001",
		"parentid": "310115139000"
	},
	{
		"shortname": "百欣苑居委会",
		"id": "310115139001018001",
		"parentid": "310115139000"
	},
	{
		"shortname": "江家宅居委会",
		"id": "310115139001021001",
		"parentid": "310115139000"
	},
	{
		"shortname": "祝安苑居委会",
		"id": "310115139001023001",
		"parentid": "310115139000"
	},
	{
		"shortname": "东都居委会",
		"id": "310115139001024001",
		"parentid": "310115139000"
	},
	{
		"shortname": "海霞第一居委会",
		"id": "310115139001025001",
		"parentid": "310115139000"
	},
	{
		"shortname": "航城第一居委会",
		"id": "310115139001026001",
		"parentid": "310115139000"
	},
	{
		"shortname": "航城第二居委会",
		"id": "310115139001027001",
		"parentid": "310115139000"
	},
	{
		"shortname": "东港第一居委会",
		"id": "310115139001028001",
		"parentid": "310115139000"
	},
	{
		"shortname": "东港第二居委会",
		"id": "310115139001029001",
		"parentid": "310115139000"
	},
	{
		"shortname": "邓镇第一居委会",
		"id": "310115139001030001",
		"parentid": "310115139000"
	},
	{
		"shortname": "邓镇第二居委会",
		"id": "310115139001031001",
		"parentid": "310115139000"
	},
	{
		"shortname": "海霞第二居委会",
		"id": "310115139001032001",
		"parentid": "310115139000"
	},
	{
		"shortname": "亭中村村委会",
		"id": "310115139001202001",
		"parentid": "310115139000"
	},
	{
		"shortname": "三八村村委会",
		"id": "310115139001203001",
		"parentid": "310115139000"
	},
	{
		"shortname": "金星村村委会",
		"id": "310115139001204001",
		"parentid": "310115139000"
	},
	{
		"shortname": "祝东村村委会",
		"id": "310115139001205001",
		"parentid": "310115139000"
	},
	{
		"shortname": "卫民村村委会",
		"id": "310115139001206001",
		"parentid": "310115139000"
	},
	{
		"shortname": "星光村村委会",
		"id": "310115139001207001",
		"parentid": "310115139000"
	},
	{
		"shortname": "明星村村委会",
		"id": "310115139001208001",
		"parentid": "310115139000"
	},
	{
		"shortname": "祝西村村委会",
		"id": "310115139001209001",
		"parentid": "310115139000"
	},
	{
		"shortname": "红三村村委会",
		"id": "310115139001210001",
		"parentid": "310115139000"
	},
	{
		"shortname": "新东村村委会",
		"id": "310115139001211001",
		"parentid": "310115139000"
	},
	{
		"shortname": "新如村村委会",
		"id": "310115139001212001",
		"parentid": "310115139000"
	},
	{
		"shortname": "薛洪村村委会",
		"id": "310115139001213001",
		"parentid": "310115139000"
	},
	{
		"shortname": "义泓村村委会",
		"id": "310115139001214001",
		"parentid": "310115139000"
	},
	{
		"shortname": "先进村村委会",
		"id": "310115139001215001",
		"parentid": "310115139000"
	},
	{
		"shortname": "星火村村委会",
		"id": "310115139001216001",
		"parentid": "310115139000"
	},
	{
		"shortname": "红星村村委会",
		"id": "310115139001217001",
		"parentid": "310115139000"
	},
	{
		"shortname": "高永村村委会",
		"id": "310115139001218001",
		"parentid": "310115139000"
	},
	{
		"shortname": "果园村村委会",
		"id": "310115139001219001",
		"parentid": "310115139000"
	},
	{
		"shortname": "立新村村委会",
		"id": "310115139001220001",
		"parentid": "310115139000"
	},
	{
		"shortname": "东滨村村委会",
		"id": "310115139001221001",
		"parentid": "310115139000"
	},
	{
		"shortname": "营前村村委会",
		"id": "310115139001222001",
		"parentid": "310115139000"
	},
	{
		"shortname": "新营村村委会",
		"id": "310115139001223001",
		"parentid": "310115139000"
	},
	{
		"shortname": "森林村村委会",
		"id": "310115139001224001",
		"parentid": "310115139000"
	},
	{
		"shortname": "陈胡村村委会",
		"id": "310115139001225001",
		"parentid": "310115139000"
	},
	{
		"shortname": "小圩村村委会",
		"id": "310115139001226001",
		"parentid": "310115139000"
	},
	{
		"shortname": "新和村村委会",
		"id": "310115139001227001",
		"parentid": "310115139000"
	},
	{
		"shortname": "大沟村村委会",
		"id": "310115139001228001",
		"parentid": "310115139000"
	},
	{
		"shortname": "卫东村村委会",
		"id": "310115139001229001",
		"parentid": "310115139000"
	},
	{
		"shortname": "亭东村村委会",
		"id": "310115139001230001",
		"parentid": "310115139000"
	},
	{
		"shortname": "新生村村委会",
		"id": "310115139001231001",
		"parentid": "310115139000"
	},
	{
		"shortname": "共和村村委会",
		"id": "310115139001232001",
		"parentid": "310115139000"
	},
	{
		"shortname": "军民村村委会",
		"id": "310115139001233001",
		"parentid": "310115139000"
	},
	{
		"shortname": "红旗村村委会",
		"id": "310115139001234001",
		"parentid": "310115139000"
	},
	{
		"shortname": "东立新村村委会",
		"id": "310115139001235001",
		"parentid": "310115139000"
	},
	{
		"shortname": "道新村村委会",
		"id": "310115139001236001",
		"parentid": "310115139000"
	},
	{
		"shortname": "中圩村村委会",
		"id": "310115139001237001",
		"parentid": "310115139000"
	},
	{
		"shortname": "邓镇一村村委会",
		"id": "310115139001238001",
		"parentid": "310115139000"
	},
	{
		"shortname": "邓镇二村村委会",
		"id": "310115139001239001",
		"parentid": "310115139000"
	},
	{
		"shortname": "邓镇三村村委会",
		"id": "310115139001240001",
		"parentid": "310115139000"
	},
	{
		"shortname": "望楼三村村委会",
		"id": "310115139001241001",
		"parentid": "310115139000"
	},
	{
		"shortname": "秋亭路居委会（筹）",
		"id": "310115139001838001",
		"parentid": "310115139000"
	}, {
		"shortname": "泥城居委会",
		"id": "310115140001001001",
		"parentid": "310115140000"
	},
	{
		"shortname": "彭镇居委会",
		"id": "310115140001002001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云锦苑居委会",
		"id": "310115140001003001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云帆苑社区居委会",
		"id": "310115140001004001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云松苑居委会",
		"id": "310115140001005001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云绣苑居委会",
		"id": "310115140001006001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云翔苑居委会",
		"id": "310115140001007001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云荷苑居委会",
		"id": "310115140001008001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云欣苑居委会",
		"id": "310115140001009001",
		"parentid": "310115140000"
	},
	{
		"shortname": "云霞苑居委会",
		"id": "310115140001010001",
		"parentid": "310115140000"
	},
	{
		"shortname": "人民村村委会",
		"id": "310115140001201001",
		"parentid": "310115140000"
	},
	{
		"shortname": "横港村村委会",
		"id": "310115140001204001",
		"parentid": "310115140000"
	},
	{
		"shortname": "公平村村委会",
		"id": "310115140001205001",
		"parentid": "310115140000"
	},
	{
		"shortname": "龙港村村委会",
		"id": "310115140001206001",
		"parentid": "310115140000"
	},
	{
		"shortname": "海关村村委会",
		"id": "310115140001207001",
		"parentid": "310115140000"
	},
	{
		"shortname": "中泐村村委会",
		"id": "310115140001208001",
		"parentid": "310115140000"
	},
	{
		"shortname": "彭庙村村委会",
		"id": "310115140001209001",
		"parentid": "310115140000"
	},
	{
		"shortname": "永盛村村委会",
		"id": "310115140001210001",
		"parentid": "310115140000"
	},
	{
		"shortname": "新泐村村委会",
		"id": "310115140001211001",
		"parentid": "310115140000"
	},
	{
		"shortname": "马厂村村委会",
		"id": "310115140001212001",
		"parentid": "310115140000"
	},
	{
		"shortname": "杭园村村委会",
		"id": "310115140001213001",
		"parentid": "310115140000"
	}, {
		"shortname": "南区居委会",
		"id": "310115141001001001",
		"parentid": "310115141000"
	},
	{
		"shortname": "三灶居委会",
		"id": "310115141001002001",
		"parentid": "310115141000"
	},
	{
		"shortname": "欣松苑居委会",
		"id": "310115141001003001",
		"parentid": "310115141000"
	},
	{
		"shortname": "欣兰苑居委会",
		"id": "310115141001004001",
		"parentid": "310115141000"
	},
	{
		"shortname": "艺泰安邦居委会",
		"id": "310115141001005001",
		"parentid": "310115141000"
	},
	{
		"shortname": "明祥苑居委会",
		"id": "310115141001006001",
		"parentid": "310115141000"
	},
	{
		"shortname": "枫丹白露居委会",
		"id": "310115141001007001",
		"parentid": "310115141000"
	},
	{
		"shortname": "枫庭居委会",
		"id": "310115141001008001",
		"parentid": "310115141000"
	},
	{
		"shortname": "张家桥村村委会",
		"id": "310115141001201001",
		"parentid": "310115141000"
	},
	{
		"shortname": "新安村村委会",
		"id": "310115141001202001",
		"parentid": "310115141000"
	},
	{
		"shortname": "中心村村委会",
		"id": "310115141001203001",
		"parentid": "310115141000"
	},
	{
		"shortname": "陆桥村村委会",
		"id": "310115141001204001",
		"parentid": "310115141000"
	},
	{
		"shortname": "宣桥村村委会",
		"id": "310115141001205001",
		"parentid": "310115141000"
	},
	{
		"shortname": "长春村村委会",
		"id": "310115141001206001",
		"parentid": "310115141000"
	},
	{
		"shortname": "季桥村村委会",
		"id": "310115141001207001",
		"parentid": "310115141000"
	},
	{
		"shortname": "项埭村村委会",
		"id": "310115141001208001",
		"parentid": "310115141000"
	},
	{
		"shortname": "光辉村村委会",
		"id": "310115141001209001",
		"parentid": "310115141000"
	},
	{
		"shortname": "光明村村委会",
		"id": "310115141001210001",
		"parentid": "310115141000"
	},
	{
		"shortname": "腰路村村委会",
		"id": "310115141001211001",
		"parentid": "310115141000"
	},
	{
		"shortname": "三灶村村委会",
		"id": "310115141001212001",
		"parentid": "310115141000"
	}, {
		"shortname": "书院第一居委会",
		"id": "310115142001001001",
		"parentid": "310115142000"
	},
	{
		"shortname": "新欣居委会",
		"id": "310115142001002001",
		"parentid": "310115142000"
	},
	{
		"shortname": "东场居委会",
		"id": "310115142001003001",
		"parentid": "310115142000"
	},
	{
		"shortname": "新舒苑社区居委会",
		"id": "310115142001004001",
		"parentid": "310115142000"
	},
	{
		"shortname": "丽泽社区居委会",
		"id": "310115142001005001",
		"parentid": "310115142000"
	},
	{
		"shortname": "舒馨居委会",
		"id": "310115142001006001",
		"parentid": "310115142000"
	},
	{
		"shortname": "塘北村村委会",
		"id": "310115142001201001",
		"parentid": "310115142000"
	},
	{
		"shortname": "洋溢村村委会",
		"id": "310115142001202001",
		"parentid": "310115142000"
	},
	{
		"shortname": "路南村村委会",
		"id": "310115142001203001",
		"parentid": "310115142000"
	},
	{
		"shortname": "新北村村委会",
		"id": "310115142001204001",
		"parentid": "310115142000"
	},
	{
		"shortname": "李雪村村委会",
		"id": "310115142001205001",
		"parentid": "310115142000"
	},
	{
		"shortname": "中久村村委会",
		"id": "310115142001206001",
		"parentid": "310115142000"
	},
	{
		"shortname": "外灶村村委会",
		"id": "310115142001207001",
		"parentid": "310115142000"
	},
	{
		"shortname": "黄华村村委会",
		"id": "310115142001208001",
		"parentid": "310115142000"
	},
	{
		"shortname": "桃园村村委会",
		"id": "310115142001209001",
		"parentid": "310115142000"
	},
	{
		"shortname": "余姚村村委会",
		"id": "310115142001210001",
		"parentid": "310115142000"
	},
	{
		"shortname": "棉场村村委会",
		"id": "310115142001211001",
		"parentid": "310115142000"
	},
	{
		"shortname": "四灶村村委会",
		"id": "310115142001212001",
		"parentid": "310115142000"
	},
	{
		"shortname": "洼港村村委会",
		"id": "310115142001213001",
		"parentid": "310115142000"
	}, {
		"shortname": "万祥居委会",
		"id": "310115143001001001",
		"parentid": "310115143000"
	},
	{
		"shortname": "馨苑居委会",
		"id": "310115143001002001",
		"parentid": "310115143000"
	},
	{
		"shortname": "祥苑居委会",
		"id": "310115143001003001",
		"parentid": "310115143000"
	},
	{
		"shortname": "万兴村村委会",
		"id": "310115143001201001",
		"parentid": "310115143000"
	},
	{
		"shortname": "万隆村村委会",
		"id": "310115143001202001",
		"parentid": "310115143000"
	},
	{
		"shortname": "万宏村村委会",
		"id": "310115143001203001",
		"parentid": "310115143000"
	},
	{
		"shortname": "新振村村委会",
		"id": "310115143001204001",
		"parentid": "310115143000"
	},
	{
		"shortname": "新建村村委会",
		"id": "310115143001205001",
		"parentid": "310115143000"
	},
	{
		"shortname": "新路村村委会",
		"id": "310115143001206001",
		"parentid": "310115143000"
	},
	{
		"shortname": "金路村村委会",
		"id": "310115143001207001",
		"parentid": "310115143000"
	}, {
		"shortname": "老港居委会",
		"id": "310115144001001001",
		"parentid": "310115144000"
	},
	{
		"shortname": "滨海居委会",
		"id": "310115144001002001",
		"parentid": "310115144000"
	},
	{
		"shortname": "宏港苑居委会",
		"id": "310115144001003001",
		"parentid": "310115144000"
	},
	{
		"shortname": "牛肚村村委会",
		"id": "310115144001201001",
		"parentid": "310115144000"
	},
	{
		"shortname": "中港村村委会",
		"id": "310115144001202001",
		"parentid": "310115144000"
	},
	{
		"shortname": "成日村村委会",
		"id": "310115144001203001",
		"parentid": "310115144000"
	},
	{
		"shortname": "建港村村委会",
		"id": "310115144001204001",
		"parentid": "310115144000"
	},
	{
		"shortname": "东河村村委会",
		"id": "310115144001205001",
		"parentid": "310115144000"
	},
	{
		"shortname": "大河村村委会",
		"id": "310115144001206001",
		"parentid": "310115144000"
	},
	{
		"shortname": "欣河村村委会",
		"id": "310115144001207001",
		"parentid": "310115144000"
	}, {
		"shortname": "临港家园居委会",
		"id": "310115145001001001",
		"parentid": "310115145000"
	},
	{
		"shortname": "宜浩佳园一居委会",
		"id": "310115145001002001",
		"parentid": "310115145000"
	},
	{
		"shortname": "宜浩佳园二居委会",
		"id": "310115145001003001",
		"parentid": "310115145000"
	},
	{
		"shortname": "东岸涟城居委会",
		"id": "310115145001004001",
		"parentid": "310115145000"
	},
	{
		"shortname": "港口居委会",
		"id": "310115145001005001",
		"parentid": "310115145000"
	},
	{
		"shortname": "果园居委会",
		"id": "310115145001006001",
		"parentid": "310115145000"
	},
	{
		"shortname": "新芦居委会",
		"id": "310115145001007001",
		"parentid": "310115145000"
	},
	{
		"shortname": "农场居委会",
		"id": "310115145001008001",
		"parentid": "310115145000"
	},
	{
		"shortname": "海尚居委会",
		"id": "310115145001009001",
		"parentid": "310115145000"
	},
	{
		"shortname": "海芦居委会",
		"id": "310115145001010001",
		"parentid": "310115145000"
	},
	{
		"shortname": "海汇居委会",
		"id": "310115145001011001",
		"parentid": "310115145000"
	},
	{
		"shortname": "滴水湖馨苑一居委会",
		"id": "310115145001012001",
		"parentid": "310115145000"
	},
	{
		"shortname": "海滨居委会",
		"id": "310115145001013001",
		"parentid": "310115145000"
	},
	{
		"shortname": "汇角村村委会",
		"id": "310115145001201001",
		"parentid": "310115145000"
	},
	{
		"shortname": "宜浩欧景居委会（筹）",
		"id": "310115145001801001",
		"parentid": "310115145000"
	},
	{
		"shortname": "蔚蓝林语居委会（筹）",
		"id": "310115145001802001",
		"parentid": "310115145000"
	}, {
		"shortname": "石化三村居委会",
		"id": "310116001001002001",
		"parentid": "310116001000"
	},
	{
		"shortname": "石化四村居委会",
		"id": "310116001001003001",
		"parentid": "310116001000"
	},
	{
		"shortname": "石化七村居委会",
		"id": "310116001001005001",
		"parentid": "310116001000"
	},
	{
		"shortname": "柳城新村居委会",
		"id": "310116001001006001",
		"parentid": "310116001000"
	},
	{
		"shortname": "石化九村居委会",
		"id": "310116001001007001",
		"parentid": "310116001000"
	},
	{
		"shortname": "石化十村居委会",
		"id": "310116001001008001",
		"parentid": "310116001000"
	},
	{
		"shortname": "合浦新村居委会",
		"id": "310116001001009001",
		"parentid": "310116001000"
	},
	{
		"shortname": "石化十二村居委会",
		"id": "310116001001010001",
		"parentid": "310116001000"
	},
	{
		"shortname": "石化十三村居委会",
		"id": "310116001001011001",
		"parentid": "310116001000"
	},
	{
		"shortname": "海棠新村居委会",
		"id": "310116001001013001",
		"parentid": "310116001000"
	},
	{
		"shortname": "梅州新村居委会",
		"id": "310116001001015001",
		"parentid": "310116001000"
	},
	{
		"shortname": "临蒙居委会",
		"id": "310116001001017001",
		"parentid": "310116001000"
	},
	{
		"shortname": "临潮三村居委会",
		"id": "310116001001019001",
		"parentid": "310116001000"
	},
	{
		"shortname": "滨海一居委会",
		"id": "310116001001020001",
		"parentid": "310116001000"
	},
	{
		"shortname": "滨海二居委会",
		"id": "310116001001021001",
		"parentid": "310116001000"
	},
	{
		"shortname": "东村居委会",
		"id": "310116001001022001",
		"parentid": "310116001000"
	},
	{
		"shortname": "东礁一、三居委会",
		"id": "310116001001024001",
		"parentid": "310116001000"
	},
	{
		"shortname": "东礁二、四居委会",
		"id": "310116001001025001",
		"parentid": "310116001000"
	},
	{
		"shortname": "东泉居委会",
		"id": "310116001001026001",
		"parentid": "310116001000"
	},
	{
		"shortname": "辰凯居委会",
		"id": "310116001001027001",
		"parentid": "310116001000"
	},
	{
		"shortname": "山鑫阳光城居委会",
		"id": "310116001001029001",
		"parentid": "310116001000"
	},
	{
		"shortname": "山龙新村居委会",
		"id": "310116001001030001",
		"parentid": "310116001000"
	},
	{
		"shortname": "桥园居委会",
		"id": "310116001001031001",
		"parentid": "310116001000"
	},
	{
		"shortname": "卫清居委会",
		"id": "310116001001032001",
		"parentid": "310116001000"
	},
	{
		"shortname": "紫卫居委会",
		"id": "310116001001033001",
		"parentid": "310116001000"
	},
	{
		"shortname": "合生财富居委会（筹）",
		"id": "310116001001811001",
		"parentid": "310116001000"
	}, {
		"shortname": "东林居委会",
		"id": "310116101001001001",
		"parentid": "310116101000"
	},
	{
		"shortname": "罗星居委会",
		"id": "310116101001002001",
		"parentid": "310116101000"
	},
	{
		"shortname": "新汇居委会",
		"id": "310116101001006001",
		"parentid": "310116101000"
	},
	{
		"shortname": "广福居委会",
		"id": "310116101001008001",
		"parentid": "310116101000"
	},
	{
		"shortname": "西林居委会",
		"id": "310116101001009001",
		"parentid": "310116101000"
	},
	{
		"shortname": "南圩居委会",
		"id": "310116101001010001",
		"parentid": "310116101000"
	},
	{
		"shortname": "临源居委会",
		"id": "310116101001011001",
		"parentid": "310116101000"
	},
	{
		"shortname": "临东居委会",
		"id": "310116101001013001",
		"parentid": "310116101000"
	},
	{
		"shortname": "北圩居委会",
		"id": "310116101001015001",
		"parentid": "310116101000"
	},
	{
		"shortname": "钟楼居委会",
		"id": "310116101001016001",
		"parentid": "310116101000"
	},
	{
		"shortname": "凤翔居委会",
		"id": "310116101001017001",
		"parentid": "310116101000"
	},
	{
		"shortname": "金龙居委会",
		"id": "310116101001018001",
		"parentid": "310116101000"
	},
	{
		"shortname": "浦银居委会",
		"id": "310116101001021001",
		"parentid": "310116101000"
	},
	{
		"shortname": "塘园居委会",
		"id": "310116101001022001",
		"parentid": "310116101000"
	},
	{
		"shortname": "金汇居委会",
		"id": "310116101001023001",
		"parentid": "310116101000"
	},
	{
		"shortname": "金来居委会",
		"id": "310116101001024001",
		"parentid": "310116101000"
	},
	{
		"shortname": "红菱居委会",
		"id": "310116101001025001",
		"parentid": "310116101000"
	},
	{
		"shortname": "民主村村委会",
		"id": "310116101001203001",
		"parentid": "310116101000"
	},
	{
		"shortname": "大茫村村委会",
		"id": "310116101001204001",
		"parentid": "310116101000"
	},
	{
		"shortname": "待泾村村委会",
		"id": "310116101001205001",
		"parentid": "310116101000"
	},
	{
		"shortname": "秀州村村委会",
		"id": "310116101001206001",
		"parentid": "310116101000"
	},
	{
		"shortname": "新泾村村委会",
		"id": "310116101001207001",
		"parentid": "310116101000"
	},
	{
		"shortname": "万联村村委会",
		"id": "310116101001209001",
		"parentid": "310116101000"
	},
	{
		"shortname": "长浜村村委会",
		"id": "310116101001217001",
		"parentid": "310116101000"
	},
	{
		"shortname": "五龙村村委会",
		"id": "310116101001218001",
		"parentid": "310116101000"
	},
	{
		"shortname": "慧农村村委会",
		"id": "310116101001222001",
		"parentid": "310116101000"
	},
	{
		"shortname": "牡丹村村委会",
		"id": "310116101001223001",
		"parentid": "310116101000"
	},
	{
		"shortname": "温河村村委会",
		"id": "310116101001224001",
		"parentid": "310116101000"
	},
	{
		"shortname": "众安居委会(筹）",
		"id": "310116101001816001",
		"parentid": "310116101000"
	}, {
		"shortname": "和平居委会",
		"id": "310116102001001001",
		"parentid": "310116102000"
	},
	{
		"shortname": "友好居委会",
		"id": "310116102001005001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新枫居委会",
		"id": "310116102001006001",
		"parentid": "310116102000"
	},
	{
		"shortname": "白牛新村居委会",
		"id": "310116102001007001",
		"parentid": "310116102000"
	},
	{
		"shortname": "枫阳居委会",
		"id": "310116102001008001",
		"parentid": "310116102000"
	},
	{
		"shortname": "兴塔居委会",
		"id": "310116102001009001",
		"parentid": "310116102000"
	},
	{
		"shortname": "枫香居委会",
		"id": "310116102001010001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新苑居委会",
		"id": "310116102001011001",
		"parentid": "310116102000"
	},
	{
		"shortname": "枫岸居委会",
		"id": "310116102001012001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新元村村委会",
		"id": "310116102001201001",
		"parentid": "310116102000"
	},
	{
		"shortname": "中洪村村委会",
		"id": "310116102001202001",
		"parentid": "310116102000"
	},
	{
		"shortname": "俞汇村村委会",
		"id": "310116102001204001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新春村村委会",
		"id": "310116102001205001",
		"parentid": "310116102000"
	},
	{
		"shortname": "农兴村村委会",
		"id": "310116102001206001",
		"parentid": "310116102000"
	},
	{
		"shortname": "钱明村村委会",
		"id": "310116102001207001",
		"parentid": "310116102000"
	},
	{
		"shortname": "长征村村委会",
		"id": "310116102001209001",
		"parentid": "310116102000"
	},
	{
		"shortname": "盛新村村委会",
		"id": "310116102001211001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新华村村委会",
		"id": "310116102001213001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新义村村委会",
		"id": "310116102001214001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新新村村委会",
		"id": "310116102001216001",
		"parentid": "310116102000"
	},
	{
		"shortname": "菖梧村村委会",
		"id": "310116102001218001",
		"parentid": "310116102000"
	},
	{
		"shortname": "团新村村委会",
		"id": "310116102001219001",
		"parentid": "310116102000"
	},
	{
		"shortname": "双庙村村委会",
		"id": "310116102001220001",
		"parentid": "310116102000"
	},
	{
		"shortname": "兴塔村村委会",
		"id": "310116102001221001",
		"parentid": "310116102000"
	},
	{
		"shortname": "五一村村委会",
		"id": "310116102001222001",
		"parentid": "310116102000"
	},
	{
		"shortname": "贵泾村村委会",
		"id": "310116102001223001",
		"parentid": "310116102000"
	},
	{
		"shortname": "新黎村村委会",
		"id": "310116102001224001",
		"parentid": "310116102000"
	},
	{
		"shortname": "下坊村村委会",
		"id": "310116102001225001",
		"parentid": "310116102000"
	},
	{
		"shortname": "泖桥村村委会",
		"id": "310116102001226001",
		"parentid": "310116102000"
	},
	{
		"shortname": "韩坞村村委会",
		"id": "310116102001227001",
		"parentid": "310116102000"
	},
	{
		"shortname": "卫星村村委会",
		"id": "310116102001228001",
		"parentid": "310116102000"
	},
	{
		"shortname": "五星村村委会",
		"id": "310116102001229001",
		"parentid": "310116102000"
	}, {
		"shortname": "东风居委会",
		"id": "310116103001001001",
		"parentid": "310116103000"
	},
	{
		"shortname": "解放居委会",
		"id": "310116103001002001",
		"parentid": "310116103000"
	},
	{
		"shortname": "富民居委会",
		"id": "310116103001003001",
		"parentid": "310116103000"
	},
	{
		"shortname": "留溪居委会",
		"id": "310116103001004001",
		"parentid": "310116103000"
	},
	{
		"shortname": "旧港村村委会",
		"id": "310116103001201001",
		"parentid": "310116103000"
	},
	{
		"shortname": "桑园村村委会",
		"id": "310116103001202001",
		"parentid": "310116103000"
	},
	{
		"shortname": "甪里村村委会",
		"id": "310116103001203001",
		"parentid": "310116103000"
	},
	{
		"shortname": "鲁堰村村委会",
		"id": "310116103001204001",
		"parentid": "310116103000"
	},
	{
		"shortname": "百家村村委会",
		"id": "310116103001205001",
		"parentid": "310116103000"
	},
	{
		"shortname": "秦望村村委会",
		"id": "310116103001208001",
		"parentid": "310116103000"
	},
	{
		"shortname": "秦山村村委会",
		"id": "310116103001209001",
		"parentid": "310116103000"
	},
	{
		"shortname": "秦阳村村委会",
		"id": "310116103001210001",
		"parentid": "310116103000"
	},
	{
		"shortname": "建农村村委会",
		"id": "310116103001212001",
		"parentid": "310116103000"
	}, {
		"shortname": "中山居委会",
		"id": "310116104001001001",
		"parentid": "310116104000"
	},
	{
		"shortname": "新建居委会",
		"id": "310116104001002001",
		"parentid": "310116104000"
	},
	{
		"shortname": "复兴居委会",
		"id": "310116104001003001",
		"parentid": "310116104000"
	},
	{
		"shortname": "寺平居委会",
		"id": "310116104001004001",
		"parentid": "310116104000"
	},
	{
		"shortname": "松隐居委会",
		"id": "310116104001006001",
		"parentid": "310116104000"
	},
	{
		"shortname": "寺北居委会",
		"id": "310116104001008001",
		"parentid": "310116104000"
	},
	{
		"shortname": "龙泉村村委会",
		"id": "310116104001202001",
		"parentid": "310116104000"
	},
	{
		"shortname": "亭东村村委会",
		"id": "310116104001204001",
		"parentid": "310116104000"
	},
	{
		"shortname": "东新村村委会",
		"id": "310116104001205001",
		"parentid": "310116104000"
	},
	{
		"shortname": "新巷村村委会",
		"id": "310116104001207001",
		"parentid": "310116104000"
	},
	{
		"shortname": "油车村村委会",
		"id": "310116104001208001",
		"parentid": "310116104000"
	},
	{
		"shortname": "亭西村村委会",
		"id": "310116104001211001",
		"parentid": "310116104000"
	},
	{
		"shortname": "金门村村委会",
		"id": "310116104001212001",
		"parentid": "310116104000"
	},
	{
		"shortname": "亭北村村委会",
		"id": "310116104001215001",
		"parentid": "310116104000"
	},
	{
		"shortname": "红阳村村委会",
		"id": "310116104001216001",
		"parentid": "310116104000"
	},
	{
		"shortname": "浩光村村委会",
		"id": "310116104001226001",
		"parentid": "310116104000"
	},
	{
		"shortname": "南星村村委会",
		"id": "310116104001227001",
		"parentid": "310116104000"
	},
	{
		"shortname": "周栅村村委会",
		"id": "310116104001228001",
		"parentid": "310116104000"
	},
	{
		"shortname": "驳岸村村委会",
		"id": "310116104001229001",
		"parentid": "310116104000"
	},
	{
		"shortname": "后岗村村委会",
		"id": "310116104001230001",
		"parentid": "310116104000"
	},
	{
		"shortname": "金明村村委会",
		"id": "310116104001231001",
		"parentid": "310116104000"
	},
	{
		"shortname": "隆亭居委会（筹）",
		"id": "310116104001808001",
		"parentid": "310116104000"
	},
	{
		"shortname": "亭林大居（筹）",
		"id": "310116104001809001",
		"parentid": "310116104000"
	}, {
		"shortname": "吕巷居委会",
		"id": "310116105001002001",
		"parentid": "310116105000"
	},
	{
		"shortname": "干巷居委会",
		"id": "310116105001003001",
		"parentid": "310116105000"
	},
	{
		"shortname": "荡田村村委会",
		"id": "310116105001201001",
		"parentid": "310116105000"
	},
	{
		"shortname": "夹漏村村委会",
		"id": "310116105001203001",
		"parentid": "310116105000"
	},
	{
		"shortname": "姚家村村委会",
		"id": "310116105001204001",
		"parentid": "310116105000"
	},
	{
		"shortname": "马新村村委会",
		"id": "310116105001205001",
		"parentid": "310116105000"
	},
	{
		"shortname": "太平村村委会",
		"id": "310116105001209001",
		"parentid": "310116105000"
	},
	{
		"shortname": "蔷薇村村委会",
		"id": "310116105001210001",
		"parentid": "310116105000"
	},
	{
		"shortname": "龙跃村村委会",
		"id": "310116105001212001",
		"parentid": "310116105000"
	},
	{
		"shortname": "和平村村委会",
		"id": "310116105001215001",
		"parentid": "310116105000"
	},
	{
		"shortname": "白漾村村委会",
		"id": "310116105001216001",
		"parentid": "310116105000"
	},
	{
		"shortname": "颜圩村村委会",
		"id": "310116105001218001",
		"parentid": "310116105000"
	}, {
		"shortname": "廊下居委会",
		"id": "310116107001001001",
		"parentid": "310116107000"
	},
	{
		"shortname": "景展居委会",
		"id": "310116107001002001",
		"parentid": "310116107000"
	},
	{
		"shortname": "万春村村委会",
		"id": "310116107001201001",
		"parentid": "310116107000"
	},
	{
		"shortname": "中联村村委会",
		"id": "310116107001203001",
		"parentid": "310116107000"
	},
	{
		"shortname": "勇敢村村委会",
		"id": "310116107001204001",
		"parentid": "310116107000"
	},
	{
		"shortname": "中丰村村委会",
		"id": "310116107001206001",
		"parentid": "310116107000"
	},
	{
		"shortname": "景阳村村委会",
		"id": "310116107001208001",
		"parentid": "310116107000"
	},
	{
		"shortname": "中民村村委会",
		"id": "310116107001209001",
		"parentid": "310116107000"
	},
	{
		"shortname": "山塘村村委会",
		"id": "310116107001211001",
		"parentid": "310116107000"
	},
	{
		"shortname": "中华村村委会",
		"id": "310116107001212001",
		"parentid": "310116107000"
	},
	{
		"shortname": "南陆村村委会",
		"id": "310116107001214001",
		"parentid": "310116107000"
	},
	{
		"shortname": "南塘村村委会",
		"id": "310116107001216001",
		"parentid": "310116107000"
	},
	{
		"shortname": "光明村村委会",
		"id": "310116107001217001",
		"parentid": "310116107000"
	},
	{
		"shortname": "友好村村委会",
		"id": "310116107001219001",
		"parentid": "310116107000"
	}, {
		"shortname": "西门居委会",
		"id": "310116109001001001",
		"parentid": "310116109000"
	},
	{
		"shortname": "钱圩居委会",
		"id": "310116109001002001",
		"parentid": "310116109000"
	},
	{
		"shortname": "东门居委会",
		"id": "310116109001003001",
		"parentid": "310116109000"
	},
	{
		"shortname": "南门居委会",
		"id": "310116109001004001",
		"parentid": "310116109000"
	},
	{
		"shortname": "北门居委会",
		"id": "310116109001005001",
		"parentid": "310116109000"
	},
	{
		"shortname": "金康居委会",
		"id": "310116109001006001",
		"parentid": "310116109000"
	},
	{
		"shortname": "海帆居委会",
		"id": "310116109001007001",
		"parentid": "310116109000"
	},
	{
		"shortname": "八一村村委会",
		"id": "310116109001201001",
		"parentid": "310116109000"
	},
	{
		"shortname": "八二村村委会",
		"id": "310116109001202001",
		"parentid": "310116109000"
	},
	{
		"shortname": "永久村村委会",
		"id": "310116109001203001",
		"parentid": "310116109000"
	},
	{
		"shortname": "永联村村委会",
		"id": "310116109001204001",
		"parentid": "310116109000"
	},
	{
		"shortname": "横浦村村委会",
		"id": "310116109001209001",
		"parentid": "310116109000"
	},
	{
		"shortname": "卫通村村委会",
		"id": "310116109001212001",
		"parentid": "310116109000"
	},
	{
		"shortname": "农建村村委会",
		"id": "310116109001214001",
		"parentid": "310116109000"
	},
	{
		"shortname": "金卫村村委会",
		"id": "310116109001215001",
		"parentid": "310116109000"
	},
	{
		"shortname": "卫城村村委会",
		"id": "310116109001216001",
		"parentid": "310116109000"
	},
	{
		"shortname": "塔港村村委会",
		"id": "310116109001217001",
		"parentid": "310116109000"
	},
	{
		"shortname": "横召村村委会",
		"id": "310116109001219001",
		"parentid": "310116109000"
	},
	{
		"shortname": "星火村村委会",
		"id": "310116109001220001",
		"parentid": "310116109000"
	},
	{
		"shortname": "八字村村委会",
		"id": "310116109001221001",
		"parentid": "310116109000"
	},
	{
		"shortname": "张桥村村委会",
		"id": "310116109001223001",
		"parentid": "310116109000"
	},
	{
		"shortname": "东平居委会（筹）",
		"id": "310116109001801002",
		"parentid": "310116109000"
	},
	{
		"shortname": "花园居委会",
		"id": "310116112001001001",
		"parentid": "310116112000"
	},
	{
		"shortname": "建龙居委会",
		"id": "310116112001002001",
		"parentid": "310116112000"
	},
	{
		"shortname": "绿地居委会",
		"id": "310116112001003001",
		"parentid": "310116112000"
	},
	{
		"shortname": "增丰村村委会",
		"id": "310116112001201001",
		"parentid": "310116112000"
	},
	{
		"shortname": "东海村村委会",
		"id": "310116112001202001",
		"parentid": "310116112000"
	},
	{
		"shortname": "营房村村委会",
		"id": "310116112001204001",
		"parentid": "310116112000"
	},
	{
		"shortname": "沙积村村委会",
		"id": "310116112001205001",
		"parentid": "310116112000"
	},
	{
		"shortname": "阮巷村村委会",
		"id": "310116112001209001",
		"parentid": "310116112000"
	},
	{
		"shortname": "蒋庄村村委会",
		"id": "310116112001211001",
		"parentid": "310116112000"
	},
	{
		"shortname": "护塘村村委会",
		"id": "310116112001212001",
		"parentid": "310116112000"
	},
	{
		"shortname": "金光村村委会",
		"id": "310116112001214001",
		"parentid": "310116112000"
	},
	{
		"shortname": "水库村村委会",
		"id": "310116112001216001",
		"parentid": "310116112000"
	},
	{
		"shortname": "海渔村村委会",
		"id": "310116112001217001",
		"parentid": "310116112000"
	},
	{
		"shortname": "海涯村村委会",
		"id": "310116112001218001",
		"parentid": "310116112000"
	},
	{
		"shortname": "三新居委会",
		"id": "310116113001001001",
		"parentid": "310116113000"
	},
	{
		"shortname": "金海岸居委会",
		"id": "310116113001002001",
		"parentid": "310116113000"
	},
	{
		"shortname": "戚家墩居委会",
		"id": "310116113001003001",
		"parentid": "310116113000"
	},
	{
		"shortname": "海趣居委会",
		"id": "310116113001004001",
		"parentid": "310116113000"
	},
	{
		"shortname": "三岛龙洲居委会",
		"id": "310116113001005001",
		"parentid": "310116113000"
	},
	{
		"shortname": "联江居委会",
		"id": "310116113001006001",
		"parentid": "310116113000"
	},
	{
		"shortname": "金世纪居委会",
		"id": "310116113001007001",
		"parentid": "310116113000"
	},
	{
		"shortname": "金豪居委会",
		"id": "310116113001008001",
		"parentid": "310116113000"
	},
	{
		"shortname": "海云居委会",
		"id": "310116113001009001",
		"parentid": "310116113000"
	},
	{
		"shortname": "康建居委会",
		"id": "310116113001010001",
		"parentid": "310116113000"
	},
	{
		"shortname": "蓝色收获居委会",
		"id": "310116113001011001",
		"parentid": "310116113000"
	},
	{
		"shortname": "海尚居委会",
		"id": "310116113001012001",
		"parentid": "310116113000"
	},
	{
		"shortname": "海欣居委会",
		"id": "310116113001013001",
		"parentid": "310116113000"
	},
	{
		"shortname": "红树林居委会",
		"id": "310116113001014001",
		"parentid": "310116113000"
	},
	{
		"shortname": "金天地居委会",
		"id": "310116113001015001",
		"parentid": "310116113000"
	},
	{
		"shortname": "金悦居委会",
		"id": "310116113001016001",
		"parentid": "310116113000"
	},
	{
		"shortname": "金韵居委会",
		"id": "310116113001017001",
		"parentid": "310116113000"
	},
	{
		"shortname": "龙泽园居委会",
		"id": "310116113001018001",
		"parentid": "310116113000"
	},
	{
		"shortname": "向阳村村委会",
		"id": "310116113001202001",
		"parentid": "310116113000"
	},
	{
		"shortname": "九龙村村委会",
		"id": "310116113001205001",
		"parentid": "310116113000"
	},
	{
		"shortname": "杨家村村委会",
		"id": "310116113001207001",
		"parentid": "310116113000"
	},
	{
		"shortname": "东方村村委会",
		"id": "310116113001208001",
		"parentid": "310116113000"
	},
	{
		"shortname": "中兴村村委会",
		"id": "310116113001210001",
		"parentid": "310116113000"
	},
	{
		"shortname": "长兴村村委会",
		"id": "310116113001213001",
		"parentid": "310116113000"
	},
	{
		"shortname": "华新村村委会",
		"id": "310116113001214001",
		"parentid": "310116113000"
	},
	{
		"shortname": "渔业村村委会",
		"id": "310116113001215001",
		"parentid": "310116113000"
	},
	{
		"shortname": "新江村村委会",
		"id": "310116113001216001",
		"parentid": "310116113000"
	},
	{
		"shortname": "卫东村村委会",
		"id": "310116113001217001",
		"parentid": "310116113000"
	},
	{
		"shortname": "金湾居委会（筹）",
		"id": "310116113001817001",
		"parentid": "310116113000"
	},
	{
		"shortname": "万盛居委会（筹）",
		"id": "310116113001818001",
		"parentid": "310116113000"
	},
	{
		"shortname": "旭辉居委会(筹）",
		"id": "310116113001819001",
		"parentid": "310116113000"
	},
	{
		"shortname": "万达居委会（筹）",
		"id": "310116113001820001",
		"parentid": "310116113000"
	},
	{
		"shortname": "海悦居委会（筹）",
		"id": "310116113001821001",
		"parentid": "310116113000"
	}, {
		"shortname": "朱行居委会",
		"id": "310116503001001001",
		"parentid": "310116503000"
	},
	{
		"shortname": "恒信居委会",
		"id": "310116503001002001",
		"parentid": "310116503000"
	},
	{
		"shortname": "桥湾居委会",
		"id": "310116503001003001",
		"parentid": "310116503000"
	},
	{
		"shortname": "恒顺居委会",
		"id": "310116503001004001",
		"parentid": "310116503000"
	},
	{
		"shortname": "红叶居委会",
		"id": "310116503001005001",
		"parentid": "310116503000"
	},
	{
		"shortname": "恒康居委会",
		"id": "310116503001006001",
		"parentid": "310116503000"
	},
	{
		"shortname": "欢兴村村委会",
		"id": "310116503001201001",
		"parentid": "310116503000"
	},
	{
		"shortname": "红光村村委会",
		"id": "310116503001202001",
		"parentid": "310116503000"
	},
	{
		"shortname": "立新村村委会",
		"id": "310116503001203001",
		"parentid": "310116503000"
	},
	{
		"shortname": "运河村村委会",
		"id": "310116503001204001",
		"parentid": "310116503000"
	},
	{
		"shortname": "高楼村村委会",
		"id": "310116503001205001",
		"parentid": "310116503000"
	},
	{
		"shortname": "胥浦村村委会",
		"id": "310116503001206001",
		"parentid": "310116503000"
	},
	{
		"shortname": "合兴村村委会",
		"id": "310116503001207001",
		"parentid": "310116503000"
	},
	{
		"shortname": "保卫村村委会",
		"id": "310116503001208001",
		"parentid": "310116503000"
	},
	{
		"shortname": "新街村村委会",
		"id": "310116503001209001",
		"parentid": "310116503000"
	}, {
		"shortname": "龙潭居委会",
		"id": "310117001001001001",
		"parentid": "310117001000"
	},
	{
		"shortname": "醉白池居委会",
		"id": "310117001001002001",
		"parentid": "310117001000"
	},
	{
		"shortname": "金沙滩居委会",
		"id": "310117001001003001",
		"parentid": "310117001000"
	},
	{
		"shortname": "太平居委会",
		"id": "310117001001005001",
		"parentid": "310117001000"
	},
	{
		"shortname": "西新桥居委会",
		"id": "310117001001009001",
		"parentid": "310117001000"
	},
	{
		"shortname": "西林塔居委会",
		"id": "310117001001010001",
		"parentid": "310117001000"
	},
	{
		"shortname": "佛字桥居委会",
		"id": "310117001001011001",
		"parentid": "310117001000"
	},
	{
		"shortname": "马路桥居委会",
		"id": "310117001001012001",
		"parentid": "310117001000"
	},
	{
		"shortname": "长桥居委会",
		"id": "310117001001013001",
		"parentid": "310117001000"
	},
	{
		"shortname": "景德路居委会",
		"id": "310117001001014001",
		"parentid": "310117001000"
	},
	{
		"shortname": "通波居委会",
		"id": "310117001001015001",
		"parentid": "310117001000"
	},
	{
		"shortname": "菜花泾居委会",
		"id": "310117001001016001",
		"parentid": "310117001000"
	},
	{
		"shortname": "蒋泾居委会",
		"id": "310117001001017001",
		"parentid": "310117001000"
	},
	{
		"shortname": "荣乐居委会",
		"id": "310117001001018001",
		"parentid": "310117001000"
	},
	{
		"shortname": "人乐居委会",
		"id": "310117001001019001",
		"parentid": "310117001000"
	},
	{
		"shortname": "凤凰新村居委会",
		"id": "310117001001020001",
		"parentid": "310117001000"
	},
	{
		"shortname": "九峰居委会",
		"id": "310117001001023001",
		"parentid": "310117001000"
	},
	{
		"shortname": "黑鱼弄居委会",
		"id": "310117001001024001",
		"parentid": "310117001000"
	},
	{
		"shortname": "高乐居委会",
		"id": "310117001001025001",
		"parentid": "310117001000"
	},
	{
		"shortname": "人民桥居委会",
		"id": "310117001001026001",
		"parentid": "310117001000"
	},
	{
		"shortname": "龙兴居委会",
		"id": "310117001001027001",
		"parentid": "310117001000"
	},
	{
		"shortname": "民乐居委会",
		"id": "310117001001028001",
		"parentid": "310117001000"
	},
	{
		"shortname": "白洋居委会",
		"id": "310117001001030001",
		"parentid": "310117001000"
	},
	{
		"shortname": "方舟园居委会",
		"id": "310117001001031001",
		"parentid": "310117001000"
	},
	{
		"shortname": "松乐苑居委会",
		"id": "310117001001032001",
		"parentid": "310117001000"
	},
	{
		"shortname": "戴家浜居委会",
		"id": "310117001001033001",
		"parentid": "310117001000"
	}, {
		"shortname": "玉树南苑居委会",
		"id": "310117002001001001",
		"parentid": "310117002000"
	},
	{
		"shortname": "秀南居委会",
		"id": "310117002001003001",
		"parentid": "310117002000"
	},
	{
		"shortname": "仓城居委会",
		"id": "310117002001004001",
		"parentid": "310117002000"
	},
	{
		"shortname": "仓桥居委会",
		"id": "310117002001006001",
		"parentid": "310117002000"
	},
	{
		"shortname": "周星居委会",
		"id": "310117002001008001",
		"parentid": "310117002000"
	},
	{
		"shortname": "薛家居委会",
		"id": "310117002001009001",
		"parentid": "310117002000"
	},
	{
		"shortname": "仓吉居委会",
		"id": "310117002001010001",
		"parentid": "310117002000"
	},
	{
		"shortname": "盐仓居委会",
		"id": "310117002001011001",
		"parentid": "310117002000"
	},
	{
		"shortname": "玉乐居委会",
		"id": "310117002001012001",
		"parentid": "310117002000"
	},
	{
		"shortname": "三星苑居委会",
		"id": "310117002001013001",
		"parentid": "310117002000"
	},
	{
		"shortname": "花园浜居委会",
		"id": "310117002001014001",
		"parentid": "310117002000"
	},
	{
		"shortname": "玉荣居委会",
		"id": "310117002001016001",
		"parentid": "310117002000"
	},
	{
		"shortname": "银杏苑居委会",
		"id": "310117002001017001",
		"parentid": "310117002000"
	},
	{
		"shortname": "三辰苑居委会",
		"id": "310117002001018001",
		"parentid": "310117002000"
	},
	{
		"shortname": "玉龙苑居委会",
		"id": "310117002001019001",
		"parentid": "310117002000"
	},
	{
		"shortname": "五丰苑居委会",
		"id": "310117002001020001",
		"parentid": "310117002000"
	},
	{
		"shortname": "兴日家园居委会",
		"id": "310117002001021001",
		"parentid": "310117002000"
	},
	{
		"shortname": "华亭荣园居委会",
		"id": "310117002001022001",
		"parentid": "310117002000"
	},
	{
		"shortname": "百合苑居委会",
		"id": "310117002001023001",
		"parentid": "310117002000"
	},
	{
		"shortname": "新理想家园居委会",
		"id": "310117002001024001",
		"parentid": "310117002000"
	},
	{
		"shortname": "金色华亭居委会",
		"id": "310117002001025001",
		"parentid": "310117002000"
	}, {
		"shortname": "放生池居委会",
		"id": "310117003001001001",
		"parentid": "310117003000"
	},
	{
		"shortname": "江虹居委会",
		"id": "310117003001002001",
		"parentid": "310117003000"
	},
	{
		"shortname": "天乐居委会",
		"id": "310117003001003001",
		"parentid": "310117003000"
	},
	{
		"shortname": "江中居委会",
		"id": "310117003001005001",
		"parentid": "310117003000"
	},
	{
		"shortname": "绿庭苑居委会",
		"id": "310117003001006001",
		"parentid": "310117003000"
	},
	{
		"shortname": "祥和居委会",
		"id": "310117003001007001",
		"parentid": "310117003000"
	},
	{
		"shortname": "兰桥居委会",
		"id": "310117003001008001",
		"parentid": "310117003000"
	},
	{
		"shortname": "鼎信居委会",
		"id": "310117003001009001",
		"parentid": "310117003000"
	},
	{
		"shortname": "开元小区居委会",
		"id": "310117003001010001",
		"parentid": "310117003000"
	},
	{
		"shortname": "世纪小区居委会",
		"id": "310117003001011001",
		"parentid": "310117003000"
	},
	{
		"shortname": "檀香小区居委会",
		"id": "310117003001012001",
		"parentid": "310117003000"
	},
	{
		"shortname": "建设居委会",
		"id": "310117003001016001",
		"parentid": "310117003000"
	},
	{
		"shortname": "湖畔天地居委会",
		"id": "310117003001018001",
		"parentid": "310117003000"
	},
	{
		"shortname": "紫东新苑居委会",
		"id": "310117003001019001",
		"parentid": "310117003000"
	},
	{
		"shortname": "名庭花苑居委会",
		"id": "310117003001020001",
		"parentid": "310117003000"
	},
	{
		"shortname": "海德名园居委会",
		"id": "310117003001023001",
		"parentid": "310117003000"
	},
	{
		"shortname": "久阳文华居委会",
		"id": "310117003001024001",
		"parentid": "310117003000"
	},
	{
		"shortname": "润峰苑居委会",
		"id": "310117003001025001",
		"parentid": "310117003000"
	},
	{
		"shortname": "昌鑫花园居委会",
		"id": "310117003001026001",
		"parentid": "310117003000"
	},
	{
		"shortname": "泰唔士小镇居委会",
		"id": "310117003001027001",
		"parentid": "310117003000"
	},
	{
		"shortname": "原野居委会",
		"id": "310117003001028001",
		"parentid": "310117003000"
	},
	{
		"shortname": "安琪花苑居委会",
		"id": "310117003001032001",
		"parentid": "310117003000"
	},
	{
		"shortname": "华亭居委会",
		"id": "310117003001033001",
		"parentid": "310117003000"
	},
	{
		"shortname": "珠江新城居委会",
		"id": "310117003001034001",
		"parentid": "310117003000"
	},
	{
		"shortname": "月亮河居委会",
		"id": "310117003001035001",
		"parentid": "310117003000"
	},
	{
		"shortname": "上泰绅苑居委会",
		"id": "310117003001036001",
		"parentid": "310117003000"
	},
	{
		"shortname": "锦桂苑社区居委会",
		"id": "310117003001037001",
		"parentid": "310117003000"
	},
	{
		"shortname": "英郡别苑居委会",
		"id": "310117003001038001",
		"parentid": "310117003000"
	},
	{
		"shortname": "东鼎社区居委会",
		"id": "310117003001039001",
		"parentid": "310117003000"
	},
	{
		"shortname": "德邑小城居委会",
		"id": "310117003001040001",
		"parentid": "310117003000"
	},
	{
		"shortname": "浪琴水岸居委会",
		"id": "310117003001041001",
		"parentid": "310117003000"
	},
	{
		"shortname": "阳光翠庭居委会",
		"id": "310117003001042001",
		"parentid": "310117003000"
	},
	{
		"shortname": "茸梅居委会",
		"id": "310117004001001001",
		"parentid": "310117004000"
	},
	{
		"shortname": "北门居委会",
		"id": "310117004001002001",
		"parentid": "310117004000"
	},
	{
		"shortname": "白云居委会",
		"id": "310117004001003001",
		"parentid": "310117004000"
	},
	{
		"shortname": "平桥居委会",
		"id": "310117004001005001",
		"parentid": "310117004000"
	},
	{
		"shortname": "东外居委会",
		"id": "310117004001006001",
		"parentid": "310117004000"
	},
	{
		"shortname": "方东居委会",
		"id": "310117004001008001",
		"parentid": "310117004000"
	},
	{
		"shortname": "方西居委会",
		"id": "310117004001009001",
		"parentid": "310117004000"
	},
	{
		"shortname": "南门居委会",
		"id": "310117004001011001",
		"parentid": "310117004000"
	},
	{
		"shortname": "五龙居委会",
		"id": "310117004001012001",
		"parentid": "310117004000"
	},
	{
		"shortname": "花桥居委会",
		"id": "310117004001013001",
		"parentid": "310117004000"
	},
	{
		"shortname": "中山苑居委会",
		"id": "310117004001014001",
		"parentid": "310117004000"
	},
	{
		"shortname": "蓝天一村居委会",
		"id": "310117004001015001",
		"parentid": "310117004000"
	},
	{
		"shortname": "蓝天二村居委会",
		"id": "310117004001016001",
		"parentid": "310117004000"
	},
	{
		"shortname": "蓝天四村居委会",
		"id": "310117004001018001",
		"parentid": "310117004000"
	},
	{
		"shortname": "蓝天五村居委会",
		"id": "310117004001019001",
		"parentid": "310117004000"
	},
	{
		"shortname": "莱顿居委会",
		"id": "310117004001020001",
		"parentid": "310117004000"
	},
	{
		"shortname": "黄渡浜居委会",
		"id": "310117004001021001",
		"parentid": "310117004000"
	},
	{
		"shortname": "同济雅筑居委会",
		"id": "310117004001022001",
		"parentid": "310117004000"
	},
	{
		"shortname": "淡家浜社区居委会",
		"id": "310117004001023001",
		"parentid": "310117004000"
	},
	{
		"shortname": "松云水苑居委会",
		"id": "310117005001001001",
		"parentid": "310117118000"
	},
	{
		"shortname": "西子湾居委会",
		"id": "310117005001002001",
		"parentid": "310117118000"
	},
	{
		"shortname": "御上海居委会",
		"id": "310117005001003001",
		"parentid": "310117118000"
	},
	{
		"shortname": "星辰园居委会",
		"id": "310117005001004001",
		"parentid": "310117118000"
	},
	{
		"shortname": "三湘四季居委会",
		"id": "310117005001005001",
		"parentid": "310117118000"
	},
	{
		"shortname": "文翔名苑居委会",
		"id": "310117005001006001",
		"parentid": "310117118000"
	},
	{
		"shortname": "蔷薇居委会",
		"id": "310117005001007001",
		"parentid": "310117118000"
	},
	{
		"shortname": "丁香居委会",
		"id": "310117005001009001",
		"parentid": "310117118000"
	},
	{
		"shortname": "谷水湾居委会",
		"id": "310117005001010001",
		"parentid": "310117118000"
	},
	{
		"shortname": "上林居委会",
		"id": "310117005001011001",
		"parentid": "310117118000"
	},
	{
		"shortname": "银源居委会",
		"id": "310117005001012001",
		"parentid": "310117118000"
	},
	{
		"shortname": "辰富居委会",
		"id": "310117005001013001",
		"parentid": "310117118000"
	},
	{
		"shortname": "首创锦悦居委会（筹）",
		"id": "310117005001015001",
		"parentid": "310117118000"
	},
	{
		"shortname": "静观翠园居委会（筹）",
		"id": "310117005001016001",
		"parentid": "310117118000"
	}, {
		"shortname": "九里亭社区居委会",
		"id": "310117006001001001",
		"parentid": "310117119000"
	},
	{
		"shortname": "亭汇社区居委会",
		"id": "310117006001002001",
		"parentid": "310117119000"
	},
	{
		"shortname": "知雅汇社区居委会",
		"id": "310117006001003001",
		"parentid": "310117119000"
	},
	{
		"shortname": "南奥园社区居委会",
		"id": "310117006001004001",
		"parentid": "310117119000"
	},
	{
		"shortname": "北奥园社区居委会",
		"id": "310117006001005001",
		"parentid": "310117119000"
	},
	{
		"shortname": "中大社区居委会",
		"id": "310117006001006001",
		"parentid": "310117119000"
	},
	{
		"shortname": "亭北社区居委会",
		"id": "310117006001007001",
		"parentid": "310117119000"
	},
	{
		"shortname": "朗庭社区居委会",
		"id": "310117006001008001",
		"parentid": "310117119000"
	},
	{
		"shortname": "涞寅社区居委会",
		"id": "310117006001009001",
		"parentid": "310117119000"
	},
	{
		"shortname": "亭谊社区居委会",
		"id": "310117006001010001",
		"parentid": "310117119000"
	},
	{
		"shortname": "绿庭尚城社区居委会",
		"id": "310117006001011001",
		"parentid": "310117119000"
	},
	{
		"shortname": "九城湖滨社区居委会",
		"id": "310117006001012001",
		"parentid": "310117119000"
	},
	{
		"shortname": "贝尚湾社区居委会",
		"id": "310117006001013001",
		"parentid": "310117119000"
	},
	{
		"shortname": "百丽苑居委会",
		"id": "310117006001014001",
		"parentid": "310117119000"
	},
	{
		"shortname": "五洲居委会",
		"id": "310117006001015001",
		"parentid": "310117119000"
	},
	{
		"shortname": "杜巷社区居委会",
		"id": "310117006001016001",
		"parentid": "310117119000"
	}, {
		"shortname": "张泾居委会",
		"id": "310117102001001001",
		"parentid": "310117102000"
	},
	{
		"shortname": "中西居委会",
		"id": "310117102001002001",
		"parentid": "310117102000"
	},
	{
		"shortname": "江川路居委会",
		"id": "310117102001003001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新南居委会",
		"id": "310117102001004001",
		"parentid": "310117102000"
	},
	{
		"shortname": "润和苑居委会",
		"id": "310117102001005001",
		"parentid": "310117102000"
	},
	{
		"shortname": "润江小区居委会",
		"id": "310117102001006001",
		"parentid": "310117102000"
	},
	{
		"shortname": "丽水居委会",
		"id": "310117102001007001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯一村居委会",
		"id": "310117102001008001",
		"parentid": "310117102000"
	},
	{
		"shortname": "西南居委会",
		"id": "310117102001009001",
		"parentid": "310117102000"
	},
	{
		"shortname": "景港居委会",
		"id": "310117102001010001",
		"parentid": "310117102000"
	},
	{
		"shortname": "景园居委会",
		"id": "310117102001011001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯二村居委会",
		"id": "310117102001012001",
		"parentid": "310117102000"
	},
	{
		"shortname": "张施居委会",
		"id": "310117102001013001",
		"parentid": "310117102000"
	},
	{
		"shortname": "叶星居委会",
		"id": "310117102001014001",
		"parentid": "310117102000"
	},
	{
		"shortname": "赵非泾居委会",
		"id": "310117102001015001",
		"parentid": "310117102000"
	},
	{
		"shortname": "打铁桥居委会",
		"id": "310117102001016001",
		"parentid": "310117102000"
	},
	{
		"shortname": "横港居委会",
		"id": "310117102001017001",
		"parentid": "310117102000"
	},
	{
		"shortname": "祥泽居委会",
		"id": "310117102001018001",
		"parentid": "310117102000"
	},
	{
		"shortname": "青松居委会",
		"id": "310117102001019001",
		"parentid": "310117102000"
	},
	{
		"shortname": "古楼居委会",
		"id": "310117102001020001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯三村居委会",
		"id": "310117102001022001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯四村居委会",
		"id": "310117102001023001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯五村居委会",
		"id": "310117102001024001",
		"parentid": "310117102000"
	},
	{
		"shortname": "同润居委会",
		"id": "310117102001025001",
		"parentid": "310117102000"
	},
	{
		"shortname": "山原居委会(筹)",
		"id": "310117102001026001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯六村居委会(筹)",
		"id": "310117102001028001",
		"parentid": "310117102000"
	},
	{
		"shortname": "向阳桥居委会(筹)",
		"id": "310117102001031001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯七村居委会",
		"id": "310117102001032001",
		"parentid": "310117102000"
	},
	{
		"shortname": "新凯八村居委会",
		"id": "310117102001033001",
		"parentid": "310117102000"
	},
	{
		"shortname": "韵意一村居委会",
		"id": "310117102001034001",
		"parentid": "310117102000"
	},
	{
		"shortname": "韵意二村居委会",
		"id": "310117102001035001",
		"parentid": "310117102000"
	},
	{
		"shortname": "韵意三村居委会",
		"id": "310117102001036001",
		"parentid": "310117102000"
	},
	{
		"shortname": "韵意四村居委会",
		"id": "310117102001037001",
		"parentid": "310117102000"
	},
	{
		"shortname": "韵意五村居委会",
		"id": "310117102001038001",
		"parentid": "310117102000"
	}, {
		"shortname": "陈坊社区居委会",
		"id": "310117103001001001",
		"parentid": "310117103000"
	},
	{
		"shortname": "天马社区居委会",
		"id": "310117103001003001",
		"parentid": "310117103000"
	},
	{
		"shortname": "江秋新苑社区居委会",
		"id": "310117103001004001",
		"parentid": "310117103000"
	},
	{
		"shortname": "月湖社区居委会",
		"id": "310117103001005001",
		"parentid": "310117103000"
	},
	{
		"shortname": "翠鑫苑社区居委会",
		"id": "310117103001006001",
		"parentid": "310117103000"
	},
	{
		"shortname": "佘山家园社区居委会",
		"id": "310117103001007001",
		"parentid": "310117103000"
	},
	{
		"shortname": "秋潭苑社区居委会",
		"id": "310117103001008001",
		"parentid": "310117103000"
	},
	{
		"shortname": "陈坊新苑社区居委会",
		"id": "310117103001009001",
		"parentid": "310117103000"
	},
	{
		"shortname": "江秋村村委会",
		"id": "310117103001201001",
		"parentid": "310117103000"
	},
	{
		"shortname": "张朴村村委会",
		"id": "310117103001210001",
		"parentid": "310117103000"
	},
	{
		"shortname": "高家村村委会",
		"id": "310117103001212001",
		"parentid": "310117103000"
	},
	{
		"shortname": "北干山村村委会",
		"id": "310117103001213001",
		"parentid": "310117103000"
	},
	{
		"shortname": "陈坊村村委会",
		"id": "310117103001217001",
		"parentid": "310117103000"
	},
	{
		"shortname": "陆其浜村村委会",
		"id": "310117103001219001",
		"parentid": "310117103000"
	},
	{
		"shortname": "卫家埭村村委会",
		"id": "310117103001221001",
		"parentid": "310117103000"
	},
	{
		"shortname": "新镇村村委会",
		"id": "310117103001223001",
		"parentid": "310117103000"
	},
	{
		"shortname": "横山村村委会",
		"id": "310117103001226001",
		"parentid": "310117103000"
	},
	{
		"shortname": "刘家山村村委会",
		"id": "310117103001230001",
		"parentid": "310117103000"
	},
	{
		"shortname": "新宅村村委会",
		"id": "310117103001233001",
		"parentid": "310117103000"
	}, {
		"shortname": "虬长路居委会",
		"id": "310117104001001001",
		"parentid": "310117104000"
	},
	{
		"shortname": "华阳居委会",
		"id": "310117104001003001",
		"parentid": "310117104000"
	},
	{
		"shortname": "祥东居委会",
		"id": "310117104001004001",
		"parentid": "310117104000"
	},
	{
		"shortname": "影佳居委会",
		"id": "310117104001005002",
		"parentid": "310117104000"
	},
	{
		"shortname": "同乐居委会",
		"id": "310117104001006001",
		"parentid": "310117104000"
	},
	{
		"shortname": "高桥村村委会",
		"id": "310117104001202001",
		"parentid": "310117104000"
	},
	{
		"shortname": "新余村村委会",
		"id": "310117104001204001",
		"parentid": "310117104000"
	},
	{
		"shortname": "联建村村委会",
		"id": "310117104001205001",
		"parentid": "310117104000"
	},
	{
		"shortname": "得胜村村委会",
		"id": "310117104001206001",
		"parentid": "310117104000"
	},
	{
		"shortname": "联庄村村委会",
		"id": "310117104001207001",
		"parentid": "310117104000"
	},
	{
		"shortname": "汇桥村村委会",
		"id": "310117104001208001",
		"parentid": "310117104000"
	},
	{
		"shortname": "联民村村委会",
		"id": "310117104001209001",
		"parentid": "310117104000"
	},
	{
		"shortname": "南门村村委会",
		"id": "310117104001210001",
		"parentid": "310117104000"
	},
	{
		"shortname": "米市渡村村委会",
		"id": "310117104001211001",
		"parentid": "310117104000"
	},
	{
		"shortname": "永福村村委会",
		"id": "310117104001212001",
		"parentid": "310117104000"
	},
	{
		"shortname": "长溇村村委会",
		"id": "310117104001213001",
		"parentid": "310117104000"
	},
	{
		"shortname": "洋泾村村委会",
		"id": "310117104001216001",
		"parentid": "310117104000"
	},
	{
		"shortname": "香山村村委会",
		"id": "310117104001217001",
		"parentid": "310117104000"
	},
	{
		"shortname": "打铁桥村村委会",
		"id": "310117104001218001",
		"parentid": "310117104000"
	},
	{
		"shortname": "华阳村村委会",
		"id": "310117104001219001",
		"parentid": "310117104000"
	},
	{
		"shortname": "东门村村委会",
		"id": "310117104001220001",
		"parentid": "310117104000"
	}, {
		"shortname": "新乐居委会",
		"id": "310117105001001001",
		"parentid": "310117105000"
	},
	{
		"shortname": "新育居委会",
		"id": "310117105001002001",
		"parentid": "310117105000"
	},
	{
		"shortname": "民益居委会",
		"id": "310117105001003001",
		"parentid": "310117105000"
	},
	{
		"shortname": "场东居委会",
		"id": "310117105001004001",
		"parentid": "310117105000"
	},
	{
		"shortname": "场西居委会",
		"id": "310117105001005001",
		"parentid": "310117105000"
	},
	{
		"shortname": "潘家浜居委会",
		"id": "310117105001006001",
		"parentid": "310117105000"
	},
	{
		"shortname": "场中居委会",
		"id": "310117105001007001",
		"parentid": "310117105000"
	},
	{
		"shortname": "新东苑居委会",
		"id": "310117105001008001",
		"parentid": "310117105000"
	},
	{
		"shortname": "明中居委会",
		"id": "310117105001009001",
		"parentid": "310117105000"
	},
	{
		"shortname": "晨星居委会",
		"id": "310117105001010001",
		"parentid": "310117105000"
	},
	{
		"shortname": "马汤居委会",
		"id": "310117105001011001",
		"parentid": "310117105000"
	},
	{
		"shortname": "春申居委会",
		"id": "310117105001012001",
		"parentid": "310117105000"
	},
	{
		"shortname": "莘松居委会",
		"id": "310117105001013001",
		"parentid": "310117105000"
	},
	{
		"shortname": "春九居委会",
		"id": "310117105001014001",
		"parentid": "310117105000"
	},
	{
		"shortname": "春莘居委会",
		"id": "310117105001015001",
		"parentid": "310117105000"
	},
	{
		"shortname": "明兴居委会",
		"id": "310117105001016001",
		"parentid": "310117105000"
	},
	{
		"shortname": "白马居委会",
		"id": "310117105001017001",
		"parentid": "310117105000"
	},
	{
		"shortname": "明华居委会",
		"id": "310117105001018001",
		"parentid": "310117105000"
	},
	{
		"shortname": "达安居委会",
		"id": "310117105001019001",
		"parentid": "310117105000"
	},
	{
		"shortname": "馨庭居委会",
		"id": "310117105001020001",
		"parentid": "310117105000"
	},
	{
		"shortname": "新弘居委会",
		"id": "310117105001021001",
		"parentid": "310117105000"
	},
	{
		"shortname": "丁浜社区居委会",
		"id": "310117105001022001",
		"parentid": "310117105000"
	},
	{
		"shortname": "新泾社区居委会",
		"id": "310117105001023001",
		"parentid": "310117105000"
	},
	{
		"shortname": "庄浜社区居委会",
		"id": "310117105001024001",
		"parentid": "310117105000"
	}, {
		"shortname": "新欣居委会",
		"id": "310117106001001001",
		"parentid": "310117106000"
	},
	{
		"shortname": "长欣居委会",
		"id": "310117106001002001",
		"parentid": "310117106000"
	},
	{
		"shortname": "海欣居委会",
		"id": "310117106001003001",
		"parentid": "310117106000"
	},
	{
		"shortname": "同欣居委会",
		"id": "310117106001005001",
		"parentid": "310117106000"
	},
	{
		"shortname": "砖桥居委会",
		"id": "310117106001006001",
		"parentid": "310117106000"
	},
	{
		"shortname": "渔洋浜居委会",
		"id": "310117106001007001",
		"parentid": "310117106000"
	},
	{
		"shortname": "塘桥居委会",
		"id": "310117106001008001",
		"parentid": "310117106000"
	},
	{
		"shortname": "光星居委会",
		"id": "310117106001009001",
		"parentid": "310117106000"
	},
	{
		"shortname": "荣欣居委会",
		"id": "310117106001010001",
		"parentid": "310117106000"
	},
	{
		"shortname": "平阳居委会",
		"id": "310117106001011001",
		"parentid": "310117106000"
	}, {
		"shortname": "亭中居委会",
		"id": "310117107001001001",
		"parentid": "310117107000"
	},
	{
		"shortname": "亭东居委会",
		"id": "310117107001002001",
		"parentid": "310117107000"
	},
	{
		"shortname": "亭南居委会",
		"id": "310117107001004001",
		"parentid": "310117107000"
	},
	{
		"shortname": "庄家居委会",
		"id": "310117107001005001",
		"parentid": "310117107000"
	},
	{
		"shortname": "兴联居委会",
		"id": "310117107001006001",
		"parentid": "310117107000"
	},
	{
		"shortname": "朱龙居委会",
		"id": "310117107001008001",
		"parentid": "310117107000"
	},
	{
		"shortname": "金吴居委会",
		"id": "310117107001009001",
		"parentid": "310117107000"
	},
	{
		"shortname": "松沪居委会",
		"id": "310117107001010001",
		"parentid": "310117107000"
	},
	{
		"shortname": "小寅居委会",
		"id": "310117107001011001",
		"parentid": "310117107000"
	},
	{
		"shortname": "朱泾浜居委会",
		"id": "310117107001012001",
		"parentid": "310117107000"
	},
	{
		"shortname": "亭源居委会",
		"id": "310117107001013001",
		"parentid": "310117107000"
	},
	{
		"shortname": "北场居委会",
		"id": "310117107001014001",
		"parentid": "310117107000"
	},
	{
		"shortname": "牛车泾居委会",
		"id": "310117107001016001",
		"parentid": "310117107000"
	},
	{
		"shortname": "国亭居委会",
		"id": "310117107001017001",
		"parentid": "310117107000"
	},
	{
		"shortname": "嘉禾居委会",
		"id": "310117107001018001",
		"parentid": "310117107000"
	},
	{
		"shortname": "颐景园居委会",
		"id": "310117107001020001",
		"parentid": "310117107000"
	},
	{
		"shortname": "复地居委会",
		"id": "310117107001023001",
		"parentid": "310117107000"
	},
	{
		"shortname": "天元居委会",
		"id": "310117107001034001",
		"parentid": "310117107000"
	},
	{
		"shortname": "青春居委会",
		"id": "310117107001035001",
		"parentid": "310117107000"
	},
	{
		"shortname": "云润居委会",
		"id": "310117107001036001",
		"parentid": "310117107000"
	},
	{
		"shortname": "涞亭居委会",
		"id": "310117107001037001",
		"parentid": "310117107000"
	},
	{
		"shortname": "象屿都城居委会",
		"id": "310117107001038001",
		"parentid": "310117107000"
	},
	{
		"shortname": "紫金居委会",
		"id": "310117107001039001",
		"parentid": "310117107000"
	},
	{
		"shortname": "九亭家园居委会",
		"id": "310117107001040001",
		"parentid": "310117107000"
	},
	{
		"shortname": "象屿品城居委会",
		"id": "310117107001041001",
		"parentid": "310117107000"
	},
	{
		"shortname": "亭新居委会",
		"id": "310117107001207001",
		"parentid": "310117107000"
	}, {
		"shortname": "泖港居委会",
		"id": "310117109001001001",
		"parentid": "310117109000"
	},
	{
		"shortname": "五厍居委会",
		"id": "310117109001002001",
		"parentid": "310117109000"
	},
	{
		"shortname": "焦家村村委会",
		"id": "310117109001201001",
		"parentid": "310117109000"
	},
	{
		"shortname": "新龚村村委会",
		"id": "310117109001202001",
		"parentid": "310117109000"
	},
	{
		"shortname": "腰泾村村委会",
		"id": "310117109001203001",
		"parentid": "310117109000"
	},
	{
		"shortname": "胡光村村委会",
		"id": "310117109001204001",
		"parentid": "310117109000"
	},
	{
		"shortname": "黄桥村村委会",
		"id": "310117109001205001",
		"parentid": "310117109000"
	},
	{
		"shortname": "范家村村委会",
		"id": "310117109001206001",
		"parentid": "310117109000"
	},
	{
		"shortname": "泖港村村委会",
		"id": "310117109001207001",
		"parentid": "310117109000"
	},
	{
		"shortname": "新建村村委会",
		"id": "310117109001208001",
		"parentid": "310117109000"
	},
	{
		"shortname": "徐厍村村委会",
		"id": "310117109001209001",
		"parentid": "310117109000"
	},
	{
		"shortname": "南三村村委会",
		"id": "310117109001210001",
		"parentid": "310117109000"
	},
	{
		"shortname": "兴旺村村委会",
		"id": "310117109001211001",
		"parentid": "310117109000"
	},
	{
		"shortname": "田黄村村委会",
		"id": "310117109001212001",
		"parentid": "310117109000"
	},
	{
		"shortname": "曙光村村委会",
		"id": "310117109001213001",
		"parentid": "310117109000"
	},
	{
		"shortname": "曹家浜村村委会",
		"id": "310117109001214001",
		"parentid": "310117109000"
	},
	{
		"shortname": "朱定村村委会",
		"id": "310117109001215001",
		"parentid": "310117109000"
	},
	{
		"shortname": "茹塘村村委会",
		"id": "310117109001216001",
		"parentid": "310117109000"
	}, {
		"shortname": "古松居委会",
		"id": "310117116001001001",
		"parentid": "310117116000"
	},
	{
		"shortname": "塔汇居委会",
		"id": "310117116001002001",
		"parentid": "310117116000"
	},
	{
		"shortname": "恬润新苑居委会",
		"id": "310117116001003001",
		"parentid": "310117116000"
	},
	{
		"shortname": "新姚村村委会",
		"id": "310117116001201001",
		"parentid": "310117116000"
	},
	{
		"shortname": "泖新村村委会",
		"id": "310117116001202001",
		"parentid": "310117116000"
	},
	{
		"shortname": "新源村村委会",
		"id": "310117116001204001",
		"parentid": "310117116000"
	},
	{
		"shortname": "洙桥村村委会",
		"id": "310117116001205001",
		"parentid": "310117116000"
	},
	{
		"shortname": "东夏村村委会",
		"id": "310117116001206001",
		"parentid": "310117116000"
	},
	{
		"shortname": "东港村村委会",
		"id": "310117116001210001",
		"parentid": "310117116000"
	},
	{
		"shortname": "金汇村村委会",
		"id": "310117116001211001",
		"parentid": "310117116000"
	},
	{
		"shortname": "金胜村村委会",
		"id": "310117116001213001",
		"parentid": "310117116000"
	},
	{
		"shortname": "张庄村村委会",
		"id": "310117116001215001",
		"parentid": "310117116000"
	},
	{
		"shortname": "新中村村委会",
		"id": "310117116001217001",
		"parentid": "310117116000"
	}, {
		"shortname": "桃园居委会",
		"id": "310117117001002001",
		"parentid": "310117117000"
	},
	{
		"shortname": "方家哈居委会",
		"id": "310117117001003001",
		"parentid": "310117117000"
	},
	{
		"shortname": "鲁星村村委会",
		"id": "310117117001204001",
		"parentid": "310117117000"
	},
	{
		"shortname": "南杨村村委会",
		"id": "310117117001207001",
		"parentid": "310117117000"
	},
	{
		"shortname": "陈堵村村委会",
		"id": "310117117001208001",
		"parentid": "310117117000"
	},
	{
		"shortname": "赵王村村委会",
		"id": "310117117001210001",
		"parentid": "310117117000"
	},
	{
		"shortname": "林建村村委会",
		"id": "310117117001212001",
		"parentid": "310117117000"
	},
	{
		"shortname": "许家草村村委会",
		"id": "310117117001213001",
		"parentid": "310117117000"
	},
	{
		"shortname": "新浜村村委会",
		"id": "310117117001215001",
		"parentid": "310117117000"
	},
	{
		"shortname": "黄家埭村村委会",
		"id": "310117117001216001",
		"parentid": "310117117000"
	},
	{
		"shortname": "文华村村委会",
		"id": "310117117001217001",
		"parentid": "310117117000"
	},
	{
		"shortname": "胡家埭村村委会",
		"id": "310117117001218001",
		"parentid": "310117117000"
	},
	{
		"shortname": "香塘村村委会",
		"id": "310117117001220001",
		"parentid": "310117117000"
	}, {
		"shortname": "张泽居委会",
		"id": "310117120001002001",
		"parentid": "310117120000"
	},
	{
		"shortname": "中原居委会",
		"id": "310117120001003001",
		"parentid": "310117120000"
	},
	{
		"shortname": "世强居委会",
		"id": "310117120001004001",
		"parentid": "310117120000"
	},
	{
		"shortname": "同建村村委会",
		"id": "310117120001202001",
		"parentid": "310117120000"
	},
	{
		"shortname": "金家村村委会",
		"id": "310117120001203001",
		"parentid": "310117120000"
	},
	{
		"shortname": "东石村村委会",
		"id": "310117120001205001",
		"parentid": "310117120000"
	},
	{
		"shortname": "兴达村村委会",
		"id": "310117120001206001",
		"parentid": "310117120000"
	},
	{
		"shortname": "东勤村村委会",
		"id": "310117120001208001",
		"parentid": "310117120000"
	},
	{
		"shortname": "堰泾村村委会",
		"id": "310117120001210001",
		"parentid": "310117120000"
	},
	{
		"shortname": "团结村村委会",
		"id": "310117120001211001",
		"parentid": "310117120000"
	},
	{
		"shortname": "四村村村委会",
		"id": "310117120001213001",
		"parentid": "310117120000"
	},
	{
		"shortname": "井凌桥村村委会",
		"id": "310117120001214001",
		"parentid": "310117120000"
	},
	{
		"shortname": "大庙村村委会",
		"id": "310117120001216001",
		"parentid": "310117120000"
	},
	{
		"shortname": "马桥村村委会",
		"id": "310117120001217001",
		"parentid": "310117120000"
	},
	{
		"shortname": "八字桥村村委会",
		"id": "310117120001218001",
		"parentid": "310117120000"
	},
	{
		"shortname": "徐姚村村委会",
		"id": "310117120001220001",
		"parentid": "310117120000"
	}, {
		"shortname": "秦安居委会",
		"id": "310117121001001001",
		"parentid": "310117121000"
	},
	{
		"shortname": "平原居委会",
		"id": "310117121001002001",
		"parentid": "310117121000"
	},
	{
		"shortname": "昆西居委会",
		"id": "310117121001003001",
		"parentid": "310117121000"
	},
	{
		"shortname": "大港居委会",
		"id": "310117121001004001",
		"parentid": "310117121000"
	},
	{
		"shortname": "玉昆一村居委会",
		"id": "310117121001005001",
		"parentid": "310117121000"
	},
	{
		"shortname": "玉昆二村居委会",
		"id": "310117121001006001",
		"parentid": "310117121000"
	},
	{
		"shortname": "文晋苑居委会",
		"id": "310117121001007001",
		"parentid": "310117121000"
	},
	{
		"shortname": "翔昆苑居委会",
		"id": "310117121001008001",
		"parentid": "310117121000"
	},
	{
		"shortname": "平复苑居委会",
		"id": "310117121001009001",
		"parentid": "310117121000"
	},
	{
		"shortname": "周家浜村村委会",
		"id": "310117121001201001",
		"parentid": "310117121000"
	},
	{
		"shortname": "汤村村委会",
		"id": "310117121001202001",
		"parentid": "310117121000"
	},
	{
		"shortname": "永丰村村委会",
		"id": "310117121001203001",
		"parentid": "310117121000"
	},
	{
		"shortname": "荡湾村村委会",
		"id": "310117121001204001",
		"parentid": "310117121000"
	},
	{
		"shortname": "泾德村村委会",
		"id": "310117121001205001",
		"parentid": "310117121000"
	},
	{
		"shortname": "港丰村村委会",
		"id": "310117121001206001",
		"parentid": "310117121000"
	},
	{
		"shortname": "大港村村委会",
		"id": "310117121001207001",
		"parentid": "310117121000"
	},
	{
		"shortname": "陆家埭村村委会",
		"id": "310117121001208001",
		"parentid": "310117121000"
	}, {
		"shortname": "松江工业区虚拟社区",
		"id": "310117501001498001",
		"parentid": "310117501000"
	}, {
		"shortname": "东盛社区居委会",
		"id": "310118001001001001",
		"parentid": "310118001000"
	},
	{
		"shortname": "东方社区居委会",
		"id": "310118001001002001",
		"parentid": "310118001000"
	},
	{
		"shortname": "章浜社区居委会",
		"id": "310118001001003001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青城社区居委会",
		"id": "310118001001004001",
		"parentid": "310118001000"
	},
	{
		"shortname": "祥龙社区居委会",
		"id": "310118001001005001",
		"parentid": "310118001000"
	},
	{
		"shortname": "界泾港社区居委会",
		"id": "310118001001006001",
		"parentid": "310118001000"
	},
	{
		"shortname": "新青浦社区居委会",
		"id": "310118001001007001",
		"parentid": "310118001000"
	},
	{
		"shortname": "桂花园社区居委会",
		"id": "310118001001008001",
		"parentid": "310118001000"
	},
	{
		"shortname": "华骥苑社区居委会",
		"id": "310118001001009001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青湖社区居委会",
		"id": "310118001001010001",
		"parentid": "310118001000"
	},
	{
		"shortname": "夏阳湖社区居委会",
		"id": "310118001001011001",
		"parentid": "310118001000"
	},
	{
		"shortname": "千步泾社区居委会",
		"id": "310118001001012001",
		"parentid": "310118001000"
	},
	{
		"shortname": "佳乐苑社区居委会",
		"id": "310118001001013001",
		"parentid": "310118001000"
	},
	{
		"shortname": "仓桥社区居委会",
		"id": "310118001001014001",
		"parentid": "310118001000"
	},
	{
		"shortname": "宜达社区居委会",
		"id": "310118001001015001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青平社区居委会",
		"id": "310118001001016001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青松社区居委会",
		"id": "310118001001017001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青华社区居委会",
		"id": "310118001001018001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青安社区居委会",
		"id": "310118001001019001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青乐社区居委会",
		"id": "310118001001020001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青泽社区居委会",
		"id": "310118001001021001",
		"parentid": "310118001000"
	},
	{
		"shortname": "青园社区居委会",
		"id": "310118001001022001",
		"parentid": "310118001000"
	},
	{
		"shortname": "南箐园社区居委会",
		"id": "310118001001023001",
		"parentid": "310118001000"
	},
	{
		"shortname": "王仙村村委会",
		"id": "310118001001201001",
		"parentid": "310118001000"
	},
	{
		"shortname": "新阳村村委会",
		"id": "310118001001202001",
		"parentid": "310118001000"
	},
	{
		"shortname": "塘郁村村委会",
		"id": "310118001001204001",
		"parentid": "310118001000"
	},
	{
		"shortname": "金家村村委会",
		"id": "310118001001205001",
		"parentid": "310118001000"
	},
	{
		"shortname": "枫泾村村委会",
		"id": "310118001001206001",
		"parentid": "310118001000"
	},
	{
		"shortname": "泰来村村委会",
		"id": "310118001001207001",
		"parentid": "310118001000"
	},
	{
		"shortname": "塔湾村村委会",
		"id": "310118001001208001",
		"parentid": "310118001000"
	},
	{
		"shortname": "城南村村委会",
		"id": "310118001001209001",
		"parentid": "310118001000"
	}, {
		"shortname": "庆华社区居委会",
		"id": "310118002001001001",
		"parentid": "310118002000"
	},
	{
		"shortname": "庆新社区居委会",
		"id": "310118002001002001",
		"parentid": "310118002000"
	},
	{
		"shortname": "城北社区居委会",
		"id": "310118002001003001",
		"parentid": "310118002000"
	},
	{
		"shortname": "龙威社区居委会",
		"id": "310118002001004001",
		"parentid": "310118002000"
	},
	{
		"shortname": "复兴社区居委会",
		"id": "310118002001005001",
		"parentid": "310118002000"
	},
	{
		"shortname": "解放社区居委会",
		"id": "310118002001006001",
		"parentid": "310118002000"
	},
	{
		"shortname": "西部花苑社区居委会",
		"id": "310118002001007001",
		"parentid": "310118002000"
	},
	{
		"shortname": "尚美社区居委会",
		"id": "310118002001008001",
		"parentid": "310118002000"
	},
	{
		"shortname": "万寿社区居委会",
		"id": "310118002001009001",
		"parentid": "310118002000"
	},
	{
		"shortname": "盈港社区居委会",
		"id": "310118002001010001",
		"parentid": "310118002000"
	},
	{
		"shortname": "盈中社区居委会",
		"id": "310118002001011001",
		"parentid": "310118002000"
	},
	{
		"shortname": "三元河社区居委会",
		"id": "310118002001012001",
		"parentid": "310118002000"
	},
	{
		"shortname": "盈联社区居委会",
		"id": "310118002001013001",
		"parentid": "310118002000"
	},
	{
		"shortname": "民乐社区居委会",
		"id": "310118002001014001",
		"parentid": "310118002000"
	},
	{
		"shortname": "民佳社区居委会",
		"id": "310118002001015001",
		"parentid": "310118002000"
	},
	{
		"shortname": "绿舟社区居委会",
		"id": "310118002001016001",
		"parentid": "310118002000"
	},
	{
		"shortname": "上达社区居委会",
		"id": "310118002001017001",
		"parentid": "310118002000"
	},
	{
		"shortname": "浩泽社区居委会",
		"id": "310118002001018001",
		"parentid": "310118002000"
	},
	{
		"shortname": "民欣社区居委会",
		"id": "310118002001019001",
		"parentid": "310118002000"
	},
	{
		"shortname": "华浦社区居委会",
		"id": "310118002001020001",
		"parentid": "310118002000"
	},
	{
		"shortname": "怡澜社区居委会",
		"id": "310118002001021001",
		"parentid": "310118002000"
	},
	{
		"shortname": "双桥社区居委会",
		"id": "310118002001022001",
		"parentid": "310118002000"
	},
	{
		"shortname": "东渡社区居委会",
		"id": "310118002001023001",
		"parentid": "310118002000"
	},
	{
		"shortname": "赵屯浦社区居委会",
		"id": "310118002001024001",
		"parentid": "310118002000"
	},
	{
		"shortname": "崧子浦社区居委会",
		"id": "310118002001025001",
		"parentid": "310118002000"
	},
	{
		"shortname": "贺桥村村委会",
		"id": "310118002001202001",
		"parentid": "310118002000"
	},
	{
		"shortname": "南厍村村委会",
		"id": "310118002001203001",
		"parentid": "310118002000"
	},
	{
		"shortname": "俞家埭村村委会",
		"id": "310118002001204001",
		"parentid": "310118002000"
	},
	{
		"shortname": "天恩桥村村委会",
		"id": "310118002001205001",
		"parentid": "310118002000"
	},
	{
		"shortname": "南横村村委会",
		"id": "310118002001206001",
		"parentid": "310118002000"
	}, {
		"shortname": "香花桥居委会",
		"id": "310118003001001001",
		"parentid": "310118003000"
	},
	{
		"shortname": "大盈居委会",
		"id": "310118003001002001",
		"parentid": "310118003000"
	},
	{
		"shortname": "青山社区居委会",
		"id": "310118003001005001",
		"parentid": "310118003000"
	},
	{
		"shortname": "金巷社区居委会",
		"id": "310118003001006001",
		"parentid": "310118003000"
	},
	{
		"shortname": "民惠社区居委会",
		"id": "310118003001007001",
		"parentid": "310118003000"
	},
	{
		"shortname": "民惠第二社区居委会",
		"id": "310118003001008001",
		"parentid": "310118003000"
	},
	{
		"shortname": "都汇华庭社区居委会",
		"id": "310118003001009001",
		"parentid": "310118003000"
	},
	{
		"shortname": "桃源埔社区居委会",
		"id": "310118003001010001",
		"parentid": "310118003000"
	},
	{
		"shortname": "清河湾社区居委会",
		"id": "310118003001011001",
		"parentid": "310118003000"
	},
	{
		"shortname": "友爱社区居委会",
		"id": "310118003001012001",
		"parentid": "310118003000"
	},
	{
		"shortname": "玉兰花园社区居委会",
		"id": "310118003001013001",
		"parentid": "310118003000"
	},
	{
		"shortname": "玫瑰湾社区居委会",
		"id": "310118003001014001",
		"parentid": "310118003000"
	},
	{
		"shortname": "民惠第三社区居委会",
		"id": "310118003001015001",
		"parentid": "310118003000"
	},
	{
		"shortname": "盈中村村委会",
		"id": "310118003001201001",
		"parentid": "310118003000"
	},
	{
		"shortname": "胜利村村委会",
		"id": "310118003001202001",
		"parentid": "310118003000"
	},
	{
		"shortname": "石西村村委会",
		"id": "310118003001203001",
		"parentid": "310118003000"
	},
	{
		"shortname": "陈桥村村委会",
		"id": "310118003001204001",
		"parentid": "310118003000"
	},
	{
		"shortname": "杨元村村委会",
		"id": "310118003001205001",
		"parentid": "310118003000"
	},
	{
		"shortname": "袁家村村委会",
		"id": "310118003001206001",
		"parentid": "310118003000"
	},
	{
		"shortname": "七汇村村委会",
		"id": "310118003001207001",
		"parentid": "310118003000"
	},
	{
		"shortname": "郏一村村委会",
		"id": "310118003001208001",
		"parentid": "310118003000"
	},
	{
		"shortname": "曹泾村村委会",
		"id": "310118003001209001",
		"parentid": "310118003000"
	},
	{
		"shortname": "金星村村委会",
		"id": "310118003001210001",
		"parentid": "310118003000"
	},
	{
		"shortname": "朝阳村村委会",
		"id": "310118003001211001",
		"parentid": "310118003000"
	},
	{
		"shortname": "新姚村村委会",
		"id": "310118003001213001",
		"parentid": "310118003000"
	},
	{
		"shortname": "天一村村委会",
		"id": "310118003001214001",
		"parentid": "310118003000"
	},
	{
		"shortname": "向阳村村委会",
		"id": "310118003001215001",
		"parentid": "310118003000"
	},
	{
		"shortname": "新桥村村委会",
		"id": "310118003001216001",
		"parentid": "310118003000"
	},
	{
		"shortname": "东方村村委会",
		"id": "310118003001217001",
		"parentid": "310118003000"
	},
	{
		"shortname": "泾阳村村委会",
		"id": "310118003001218001",
		"parentid": "310118003000"
	},
	{
		"shortname": "燕南村村委会",
		"id": "310118003001219001",
		"parentid": "310118003000"
	},
	{
		"shortname": "大联村村委会",
		"id": "310118003001220001",
		"parentid": "310118003000"
	},
	{
		"shortname": "东斜村村委会",
		"id": "310118003001222001",
		"parentid": "310118003000"
	},
	{
		"shortname": "金米村村委会",
		"id": "310118003001223001",
		"parentid": "310118003000"
	},
	{
		"shortname": "爱星村村委会",
		"id": "310118003001224001",
		"parentid": "310118003000"
	}, {
		"shortname": "大新街居委会",
		"id": "310118102001001001",
		"parentid": "310118102000"
	},
	{
		"shortname": "胜利街居委会",
		"id": "310118102001002001",
		"parentid": "310118102000"
	},
	{
		"shortname": "东湖街居委会",
		"id": "310118102001003001",
		"parentid": "310118102000"
	},
	{
		"shortname": "西湖新村居委会",
		"id": "310118102001004001",
		"parentid": "310118102000"
	},
	{
		"shortname": "北大街居委会",
		"id": "310118102001005001",
		"parentid": "310118102000"
	},
	{
		"shortname": "东井街居委会",
		"id": "310118102001006001",
		"parentid": "310118102000"
	},
	{
		"shortname": "大淀湖居委会",
		"id": "310118102001007001",
		"parentid": "310118102000"
	},
	{
		"shortname": "沈巷居委会",
		"id": "310118102001008001",
		"parentid": "310118102000"
	},
	{
		"shortname": "东大门社区居委会",
		"id": "310118102001009001",
		"parentid": "310118102000"
	},
	{
		"shortname": "泰安第一社区居委会",
		"id": "310118102001010001",
		"parentid": "310118102000"
	},
	{
		"shortname": "泰安第二社区居委会",
		"id": "310118102001011001",
		"parentid": "310118102000"
	},
	{
		"shortname": "周荡村村委会",
		"id": "310118102001201001",
		"parentid": "310118102000"
	},
	{
		"shortname": "横江村村委会",
		"id": "310118102001202001",
		"parentid": "310118102000"
	},
	{
		"shortname": "盛家埭村村委会",
		"id": "310118102001204001",
		"parentid": "310118102000"
	},
	{
		"shortname": "张家圩村村委会",
		"id": "310118102001205001",
		"parentid": "310118102000"
	},
	{
		"shortname": "新旺村村委会",
		"id": "310118102001206001",
		"parentid": "310118102000"
	},
	{
		"shortname": "新华村村委会",
		"id": "310118102001208001",
		"parentid": "310118102000"
	},
	{
		"shortname": "小江村村委会",
		"id": "310118102001212001",
		"parentid": "310118102000"
	},
	{
		"shortname": "周家港村村委会",
		"id": "310118102001213001",
		"parentid": "310118102000"
	},
	{
		"shortname": "沙家埭村村委会",
		"id": "310118102001214001",
		"parentid": "310118102000"
	},
	{
		"shortname": "山湾村村委会",
		"id": "310118102001217001",
		"parentid": "310118102000"
	},
	{
		"shortname": "庆丰村村委会",
		"id": "310118102001218001",
		"parentid": "310118102000"
	},
	{
		"shortname": "淀峰村村委会",
		"id": "310118102001219001",
		"parentid": "310118102000"
	},
	{
		"shortname": "山海桥村村委会",
		"id": "310118102001220001",
		"parentid": "310118102000"
	},
	{
		"shortname": "创建村村委会",
		"id": "310118102001221001",
		"parentid": "310118102000"
	},
	{
		"shortname": "淀山湖一村村委会",
		"id": "310118102001223001",
		"parentid": "310118102000"
	},
	{
		"shortname": "水产村村委会",
		"id": "310118102001224001",
		"parentid": "310118102000"
	},
	{
		"shortname": "安庄村村委会",
		"id": "310118102001226001",
		"parentid": "310118102000"
	},
	{
		"shortname": "先锋村村委会",
		"id": "310118102001227001",
		"parentid": "310118102000"
	},
	{
		"shortname": "沈巷村村委会",
		"id": "310118102001230001",
		"parentid": "310118102000"
	},
	{
		"shortname": "张马村村委会",
		"id": "310118102001232001",
		"parentid": "310118102000"
	},
	{
		"shortname": "李庄村村委会",
		"id": "310118102001235001",
		"parentid": "310118102000"
	},
	{
		"shortname": "建新村村委会",
		"id": "310118102001236001",
		"parentid": "310118102000"
	},
	{
		"shortname": "王金村村委会",
		"id": "310118102001237001",
		"parentid": "310118102000"
	},
	{
		"shortname": "林家村村委会",
		"id": "310118102001240001",
		"parentid": "310118102000"
	},
	{
		"shortname": "新胜村村委会",
		"id": "310118102001241001",
		"parentid": "310118102000"
	},
	{
		"shortname": "张巷村村委会",
		"id": "310118102001243001",
		"parentid": "310118102000"
	},
	{
		"shortname": "万隆村村委会",
		"id": "310118102001246001",
		"parentid": "310118102000"
	},
	{
		"shortname": "薛间村村委会",
		"id": "310118102001247001",
		"parentid": "310118102000"
	},
	{
		"shortname": "上海市青浦区朱家角镇珠湖社区居委会（筹）",
		"id": "310118102001801001",
		"parentid": "310118102000"
	},
	{
		"shortname": "上海市青浦区朱家角镇淀湖社区居委会(筹)",
		"id": "310118102001802001",
		"parentid": "310118102000"
	},
	{
		"shortname": "上海市青浦区朱家角镇珠溪社区居委会（筹）",
		"id": "310118102001803001",
		"parentid": "310118102000"
	}, {
		"shortname": "下塘居委会",
		"id": "310118103001001001",
		"parentid": "310118103000"
	},
	{
		"shortname": "湾塘居委会",
		"id": "310118103001002001",
		"parentid": "310118103000"
	},
	{
		"shortname": "小蒸居委会",
		"id": "310118103001003001",
		"parentid": "310118103000"
	},
	{
		"shortname": "蒸淀居委会",
		"id": "310118103001004001",
		"parentid": "310118103000"
	},
	{
		"shortname": "三里塘居委会",
		"id": "310118103001005001",
		"parentid": "310118103000"
	},
	{
		"shortname": "泖甸村村委会",
		"id": "310118103001209001",
		"parentid": "310118103000"
	},
	{
		"shortname": "泾花村村委会",
		"id": "310118103001244001",
		"parentid": "310118103000"
	},
	{
		"shortname": "练东村村委会",
		"id": "310118103001255001",
		"parentid": "310118103000"
	},
	{
		"shortname": "泾珠村村委会",
		"id": "310118103001256001",
		"parentid": "310118103000"
	},
	{
		"shortname": "北埭村村委会",
		"id": "310118103001257001",
		"parentid": "310118103000"
	},
	{
		"shortname": "金前村村委会",
		"id": "310118103001258001",
		"parentid": "310118103000"
	},
	{
		"shortname": "太北村村委会",
		"id": "310118103001259001",
		"parentid": "310118103000"
	},
	{
		"shortname": "叶港村村委会",
		"id": "310118103001260001",
		"parentid": "310118103000"
	},
	{
		"shortname": "朱庄村村委会",
		"id": "310118103001261001",
		"parentid": "310118103000"
	},
	{
		"shortname": "东泖村村委会",
		"id": "310118103001262001",
		"parentid": "310118103000"
	},
	{
		"shortname": "东田村村委会",
		"id": "310118103001263001",
		"parentid": "310118103000"
	},
	{
		"shortname": "联农村村委会",
		"id": "310118103001264001",
		"parentid": "310118103000"
	},
	{
		"shortname": "双菱村村委会",
		"id": "310118103001265001",
		"parentid": "310118103000"
	},
	{
		"shortname": "东淇村村委会",
		"id": "310118103001266001",
		"parentid": "310118103000"
	},
	{
		"shortname": "长河村村委会",
		"id": "310118103001267001",
		"parentid": "310118103000"
	},
	{
		"shortname": "大新村村委会",
		"id": "310118103001268001",
		"parentid": "310118103000"
	},
	{
		"shortname": "东厍村村委会",
		"id": "310118103001269001",
		"parentid": "310118103000"
	},
	{
		"shortname": "张联村村委会",
		"id": "310118103001270001",
		"parentid": "310118103000"
	},
	{
		"shortname": "徐练村村委会",
		"id": "310118103001271001",
		"parentid": "310118103000"
	},
	{
		"shortname": "浦南村村委会",
		"id": "310118103001272001",
		"parentid": "310118103000"
	},
	{
		"shortname": "蒸浦村村委会",
		"id": "310118103001273001",
		"parentid": "310118103000"
	},
	{
		"shortname": "东庄村村委会",
		"id": "310118103001274001",
		"parentid": "310118103000"
	},
	{
		"shortname": "蒸夏村村委会",
		"id": "310118103001275001",
		"parentid": "310118103000"
	},
	{
		"shortname": "芦潼村村委会",
		"id": "310118103001276001",
		"parentid": "310118103000"
	},
	{
		"shortname": "星浜村村委会",
		"id": "310118103001277001",
		"parentid": "310118103000"
	}, {
		"shortname": "金溪居委会",
		"id": "310118104001001001",
		"parentid": "310118104000"
	},
	{
		"shortname": "金杨居委会",
		"id": "310118104001002001",
		"parentid": "310118104000"
	},
	{
		"shortname": "西岑居委会",
		"id": "310118104001003001",
		"parentid": "310118104000"
	},
	{
		"shortname": "莲盛居委会",
		"id": "310118104001004001",
		"parentid": "310118104000"
	},
	{
		"shortname": "商榻居委会",
		"id": "310118104001005001",
		"parentid": "310118104000"
	},
	{
		"shortname": "徐李村村委会",
		"id": "310118104001201001",
		"parentid": "310118104000"
	},
	{
		"shortname": "新池村村委会",
		"id": "310118104001203001",
		"parentid": "310118104000"
	},
	{
		"shortname": "金泽村村委会",
		"id": "310118104001204001",
		"parentid": "310118104000"
	},
	{
		"shortname": "杨湾村村委会",
		"id": "310118104001205001",
		"parentid": "310118104000"
	},
	{
		"shortname": "东西村村委会",
		"id": "310118104001207001",
		"parentid": "310118104000"
	},
	{
		"shortname": "建国村村委会",
		"id": "310118104001208001",
		"parentid": "310118104000"
	},
	{
		"shortname": "金姚村村委会",
		"id": "310118104001209001",
		"parentid": "310118104000"
	},
	{
		"shortname": "新港村村委会",
		"id": "310118104001210001",
		"parentid": "310118104000"
	},
	{
		"shortname": "岑卜村村委会",
		"id": "310118104001211001",
		"parentid": "310118104000"
	},
	{
		"shortname": "西岑村村委会",
		"id": "310118104001212001",
		"parentid": "310118104000"
	},
	{
		"shortname": "三塘村村委会",
		"id": "310118104001213001",
		"parentid": "310118104000"
	},
	{
		"shortname": "育田村村委会",
		"id": "310118104001214001",
		"parentid": "310118104000"
	},
	{
		"shortname": "河祝村村委会",
		"id": "310118104001215001",
		"parentid": "310118104000"
	},
	{
		"shortname": "爱国村村委会",
		"id": "310118104001216001",
		"parentid": "310118104000"
	},
	{
		"shortname": "东天村村委会",
		"id": "310118104001217001",
		"parentid": "310118104000"
	},
	{
		"shortname": "任屯村村委会",
		"id": "310118104001218001",
		"parentid": "310118104000"
	},
	{
		"shortname": "田山庄村村委会",
		"id": "310118104001219001",
		"parentid": "310118104000"
	},
	{
		"shortname": "龚都村村委会",
		"id": "310118104001220001",
		"parentid": "310118104000"
	},
	{
		"shortname": "钱盛村村委会",
		"id": "310118104001221001",
		"parentid": "310118104000"
	},
	{
		"shortname": "莲湖村村委会",
		"id": "310118104001222001",
		"parentid": "310118104000"
	},
	{
		"shortname": "淀湖村村委会",
		"id": "310118104001223001",
		"parentid": "310118104000"
	},
	{
		"shortname": "蔡浜村村委会",
		"id": "310118104001224001",
		"parentid": "310118104000"
	},
	{
		"shortname": "东星村村委会",
		"id": "310118104001225001",
		"parentid": "310118104000"
	},
	{
		"shortname": "王港村村委会",
		"id": "310118104001226001",
		"parentid": "310118104000"
	},
	{
		"shortname": "双祥村村委会",
		"id": "310118104001227001",
		"parentid": "310118104000"
	},
	{
		"shortname": "南新村村委会",
		"id": "310118104001228001",
		"parentid": "310118104000"
	},
	{
		"shortname": "陈东村村委会",
		"id": "310118104001229001",
		"parentid": "310118104000"
	},
	{
		"shortname": "雪米村村委会",
		"id": "310118104001230001",
		"parentid": "310118104000"
	},
	{
		"shortname": "淀西村村委会",
		"id": "310118104001231001",
		"parentid": "310118104000"
	},
	{
		"shortname": "沙港村村委会",
		"id": "310118104001232001",
		"parentid": "310118104000"
	},
	{
		"shortname": "赵巷居委会",
		"id": "310118105001001001",
		"parentid": "310118105000"
	},
	{
		"shortname": "北崧居委会",
		"id": "310118105001002001",
		"parentid": "310118105000"
	},
	{
		"shortname": "新镇居委会",
		"id": "310118105001003001",
		"parentid": "310118105000"
	},
	{
		"shortname": "金葫芦社区居委会",
		"id": "310118105001004001",
		"parentid": "310118105000"
	},
	{
		"shortname": "金葫芦第二社区居委会",
		"id": "310118105001005001",
		"parentid": "310118105000"
	},
	{
		"shortname": "崧涵居委",
		"id": "310118105001006001",
		"parentid": "310118105000"
	},
	{
		"shortname": "崧湖居委",
		"id": "310118105001007001",
		"parentid": "310118105000"
	},
	{
		"shortname": "佳福居委",
		"id": "310118105001008001",
		"parentid": "310118105000"
	},
	{
		"shortname": "崧鑫居委",
		"id": "310118105001009001",
		"parentid": "310118105000"
	},
	{
		"shortname": "巷佳居委",
		"id": "310118105001010001",
		"parentid": "310118105000"
	},
	{
		"shortname": "南崧村村委会",
		"id": "310118105001201001",
		"parentid": "310118105000"
	},
	{
		"shortname": "方夏村村委会",
		"id": "310118105001202001",
		"parentid": "310118105000"
	},
	{
		"shortname": "和睦村村委会",
		"id": "310118105001205001",
		"parentid": "310118105000"
	},
	{
		"shortname": "垂姚村村委会",
		"id": "310118105001207001",
		"parentid": "310118105000"
	},
	{
		"shortname": "沈泾塘村村委会",
		"id": "310118105001208001",
		"parentid": "310118105000"
	},
	{
		"shortname": "崧泽村村委会",
		"id": "310118105001216001",
		"parentid": "310118105000"
	},
	{
		"shortname": "中步村村委会",
		"id": "310118105001217001",
		"parentid": "310118105000"
	},
	{
		"shortname": "金汇村村委会",
		"id": "310118105001221001",
		"parentid": "310118105000"
	}, {
		"shortname": "徐泾居委会",
		"id": "310118106001001001",
		"parentid": "310118106000"
	},
	{
		"shortname": "龙阳居委会",
		"id": "310118106001002001",
		"parentid": "310118106000"
	},
	{
		"shortname": "宅东居委会",
		"id": "310118106001003001",
		"parentid": "310118106000"
	},
	{
		"shortname": "京华居委会",
		"id": "310118106001004001",
		"parentid": "310118106000"
	},
	{
		"shortname": "蟠龙居委会",
		"id": "310118106001005001",
		"parentid": "310118106000"
	},
	{
		"shortname": "徐安第一社区居委会",
		"id": "310118106001006001",
		"parentid": "310118106000"
	},
	{
		"shortname": "徐安第二社区居委会",
		"id": "310118106001007001",
		"parentid": "310118106000"
	},
	{
		"shortname": "高泾社区居委会",
		"id": "310118106001008001",
		"parentid": "310118106000"
	},
	{
		"shortname": "卫家角第一社区居委会",
		"id": "310118106001009001",
		"parentid": "310118106000"
	},
	{
		"shortname": "卫家角第二社区居委会",
		"id": "310118106001010001",
		"parentid": "310118106000"
	},
	{
		"shortname": "徐安第三社区居委会",
		"id": "310118106001011001",
		"parentid": "310118106000"
	},
	{
		"shortname": "徐安第四社区居委会",
		"id": "310118106001012001",
		"parentid": "310118106000"
	},
	{
		"shortname": "玉兰清苑社区居委会",
		"id": "310118106001013001",
		"parentid": "310118106000"
	},
	{
		"shortname": "尚鸿路社区居委会",
		"id": "310118106001014001",
		"parentid": "310118106000"
	},
	{
		"shortname": "尚泰路社区居委会",
		"id": "310118106001015001",
		"parentid": "310118106000"
	},
	{
		"shortname": "尚茂路社区居委会",
		"id": "310118106001016001",
		"parentid": "310118106000"
	},
	{
		"shortname": "前明村村委会",
		"id": "310118106001202001",
		"parentid": "310118106000"
	},
	{
		"shortname": "金云村村委会",
		"id": "310118106001203001",
		"parentid": "310118106000"
	},
	{
		"shortname": "联民村村委会",
		"id": "310118106001204001",
		"parentid": "310118106000"
	},
	{
		"shortname": "光联村村委会",
		"id": "310118106001207001",
		"parentid": "310118106000"
	},
	{
		"shortname": "民主村村委会",
		"id": "310118106001208001",
		"parentid": "310118106000"
	},
	{
		"shortname": "二联村村委会",
		"id": "310118106001209001",
		"parentid": "310118106000"
	},
	{
		"shortname": "金联村村委会",
		"id": "310118106001212001",
		"parentid": "310118106000"
	},
	{
		"shortname": "迮庵村村委会",
		"id": "310118106001213001",
		"parentid": "310118106000"
	},
	{
		"shortname": "陆家角村村委会",
		"id": "310118106001214001",
		"parentid": "310118106000"
	}, {
		"shortname": "华新居委会",
		"id": "310118107001001001",
		"parentid": "310118107000"
	},
	{
		"shortname": "凤溪居委会",
		"id": "310118107001002001",
		"parentid": "310118107000"
	},
	{
		"shortname": "华腾社区居委会",
		"id": "310118107001003001",
		"parentid": "310118107000"
	},
	{
		"shortname": "徐谢村村委会",
		"id": "310118107001201001",
		"parentid": "310118107000"
	},
	{
		"shortname": "周浜村村委会",
		"id": "310118107001202001",
		"parentid": "310118107000"
	},
	{
		"shortname": "朱长村村委会",
		"id": "310118107001203001",
		"parentid": "310118107000"
	},
	{
		"shortname": "华益村村委会",
		"id": "310118107001205001",
		"parentid": "310118107000"
	},
	{
		"shortname": "陆象村村委会",
		"id": "310118107001206001",
		"parentid": "310118107000"
	},
	{
		"shortname": "凌家村村委会",
		"id": "310118107001207001",
		"parentid": "310118107000"
	},
	{
		"shortname": "淮海村村委会",
		"id": "310118107001208001",
		"parentid": "310118107000"
	},
	{
		"shortname": "马阳村村委会",
		"id": "310118107001209001",
		"parentid": "310118107000"
	},
	{
		"shortname": "秀龙村村委会",
		"id": "310118107001211001",
		"parentid": "310118107000"
	},
	{
		"shortname": "新谊村村委会",
		"id": "310118107001212001",
		"parentid": "310118107000"
	},
	{
		"shortname": "火星村村委会",
		"id": "310118107001213001",
		"parentid": "310118107000"
	},
	{
		"shortname": "嵩山村村委会",
		"id": "310118107001214001",
		"parentid": "310118107000"
	},
	{
		"shortname": "北新村村委会",
		"id": "310118107001215001",
		"parentid": "310118107000"
	},
	{
		"shortname": "新木桥村村委会",
		"id": "310118107001217001",
		"parentid": "310118107000"
	},
	{
		"shortname": "叙南村村委会",
		"id": "310118107001218001",
		"parentid": "310118107000"
	},
	{
		"shortname": "叙中村村委会",
		"id": "310118107001219001",
		"parentid": "310118107000"
	},
	{
		"shortname": "坚强村村委会",
		"id": "310118107001221001",
		"parentid": "310118107000"
	},
	{
		"shortname": "白马塘村村委会",
		"id": "310118107001222001",
		"parentid": "310118107000"
	},
	{
		"shortname": "杨家庄村村委会",
		"id": "310118107001223001",
		"parentid": "310118107000"
	},
	{
		"shortname": "新丰社区居民委员会（筹）",
		"id": "310118107001800001",
		"parentid": "310118107000"
	},
	{
		"shortname": "春江三月社区居民委员会（筹）",
		"id": "310118107001801002",
		"parentid": "310118107000"
	},
	{
		"shortname": "瑞和锦庭社区居民委员会（筹）",
		"id": "310118107001802002",
		"parentid": "310118107000"
	},
	{
		"shortname": "悦欣社区居民委员会（筹）",
		"id": "310118107001803002",
		"parentid": "310118107000"
	},
	{
		"shortname": "金瑞苑社区居民委员会（筹）",
		"id": "310118107001804001",
		"parentid": "310118107000"
	},
	{
		"shortname": "华府社区居民委员会（筹）",
		"id": "310118107001805001",
		"parentid": "310118107000"
	},
	{
		"shortname": "宝龙社区居民委员会（筹）",
		"id": "310118107001806001",
		"parentid": "310118107000"
	},
	{
		"shortname": "西郊半岛社区居民委员会（筹）",
		"id": "310118107001807001",
		"parentid": "310118107000"
	},
	{
		"shortname": "星尚湾社区居民委员会（筹）",
		"id": "310118107001808001",
		"parentid": "310118107000"
	}, {
		"shortname": "福泉社区居委会",
		"id": "310118109001001001",
		"parentid": "310118109000"
	},
	{
		"shortname": "泉山社区居委会",
		"id": "310118109001002002",
		"parentid": "310118109000"
	},
	{
		"shortname": "福定社区居委会",
		"id": "310118109001003001",
		"parentid": "310118109000"
	},
	{
		"shortname": "泉华社区居委会",
		"id": "310118109001004001",
		"parentid": "310118109000"
	},
	{
		"shortname": "回龙村村委会",
		"id": "310118109001201001",
		"parentid": "310118109000"
	},
	{
		"shortname": "新丰村村委会",
		"id": "310118109001202001",
		"parentid": "310118109000"
	},
	{
		"shortname": "章堰村村委会",
		"id": "310118109001203001",
		"parentid": "310118109000"
	},
	{
		"shortname": "徐姚村村委会",
		"id": "310118109001204001",
		"parentid": "310118109000"
	},
	{
		"shortname": "郏店村村委会",
		"id": "310118109001207001",
		"parentid": "310118109000"
	},
	{
		"shortname": "毛家角村村委会",
		"id": "310118109001208001",
		"parentid": "310118109000"
	},
	{
		"shortname": "新联村村委会",
		"id": "310118109001211001",
		"parentid": "310118109000"
	},
	{
		"shortname": "中新村村委会",
		"id": "310118109001213001",
		"parentid": "310118109000"
	},
	{
		"shortname": "福泉山村村委会",
		"id": "310118109001214001",
		"parentid": "310118109000"
	}, {
		"shortname": "白鹤一居委会",
		"id": "310118110001001001",
		"parentid": "310118110000"
	},
	{
		"shortname": "白鹤二居委会",
		"id": "310118110001002001",
		"parentid": "310118110000"
	},
	{
		"shortname": "赵屯居委会",
		"id": "310118110001003001",
		"parentid": "310118110000"
	},
	{
		"shortname": "新江居委会",
		"id": "310118110001004001",
		"parentid": "310118110000"
	},
	{
		"shortname": "白鹤村村委会",
		"id": "310118110001201001",
		"parentid": "310118110000"
	},
	{
		"shortname": "沈联村村委会",
		"id": "310118110001203001",
		"parentid": "310118110000"
	},
	{
		"shortname": "鹤联村村委会",
		"id": "310118110001205001",
		"parentid": "310118110000"
	},
	{
		"shortname": "青龙村村委会",
		"id": "310118110001208001",
		"parentid": "310118110000"
	},
	{
		"shortname": "塘湾村村委会",
		"id": "310118110001209001",
		"parentid": "310118110000"
	},
	{
		"shortname": "胜新村村委会",
		"id": "310118110001210001",
		"parentid": "310118110000"
	},
	{
		"shortname": "朱浦村村委会",
		"id": "310118110001211001",
		"parentid": "310118110000"
	},
	{
		"shortname": "金项村村委会",
		"id": "310118110001213001",
		"parentid": "310118110000"
	},
	{
		"shortname": "新江村村委会",
		"id": "310118110001214001",
		"parentid": "310118110000"
	},
	{
		"shortname": "王泾村村委会",
		"id": "310118110001216001",
		"parentid": "310118110000"
	},
	{
		"shortname": "杜村村委会",
		"id": "310118110001218001",
		"parentid": "310118110000"
	},
	{
		"shortname": "响新村村委会",
		"id": "310118110001219001",
		"parentid": "310118110000"
	},
	{
		"shortname": "五里村村委会",
		"id": "310118110001220001",
		"parentid": "310118110000"
	},
	{
		"shortname": "万狮村村委会",
		"id": "310118110001221001",
		"parentid": "310118110000"
	},
	{
		"shortname": "梅桥村村委会",
		"id": "310118110001222001",
		"parentid": "310118110000"
	},
	{
		"shortname": "曙光村村委会",
		"id": "310118110001223001",
		"parentid": "310118110000"
	},
	{
		"shortname": "红旗村村委会",
		"id": "310118110001224001",
		"parentid": "310118110000"
	},
	{
		"shortname": "南巷村村委会",
		"id": "310118110001225001",
		"parentid": "310118110000"
	},
	{
		"shortname": "江南村村委会",
		"id": "310118110001226001",
		"parentid": "310118110000"
	},
	{
		"shortname": "太平村村委会",
		"id": "310118110001229001",
		"parentid": "310118110000"
	},
	{
		"shortname": "赵屯村村委会",
		"id": "310118110001230001",
		"parentid": "310118110000"
	}, {
		"shortname": "鸿宝第一社区居委会",
		"id": "310120001001001001",
		"parentid": "310120103000"
	},
	{
		"shortname": "鸿宝第二社区居委会",
		"id": "310120001001002001",
		"parentid": "310120103000"
	},
	{
		"shortname": "鸿宝第三社区居委会",
		"id": "310120001001003001",
		"parentid": "310120103000"
	},
	{
		"shortname": "水闸居委会",
		"id": "310120001001004001",
		"parentid": "310120103000"
	},
	{
		"shortname": "闸园社区居委会",
		"id": "310120001001005001",
		"parentid": "310120103000"
	},
	{
		"shortname": "浦江居委会",
		"id": "310120001001006001",
		"parentid": "310120103000"
	},
	{
		"shortname": "新南社区居委会",
		"id": "310120001001007001",
		"parentid": "310120103000"
	},
	{
		"shortname": "水岸社区居委会",
		"id": "310120001001008001",
		"parentid": "310120103000"
	},
	{
		"shortname": "文怡社区居委会",
		"id": "310120001001009001",
		"parentid": "310120103000"
	},
	{
		"shortname": "金都居委会",
		"id": "310120001001010001",
		"parentid": "310120103000"
	},
	{
		"shortname": "发展村村委会",
		"id": "310120001001201001",
		"parentid": "310120103000"
	},
	{
		"shortname": "灯塔村村委会",
		"id": "310120001001202001",
		"parentid": "310120103000"
	},
	{
		"shortname": "南渡村村委会",
		"id": "310120001001203001",
		"parentid": "310120103000"
	},
	{
		"shortname": "金港村村委会",
		"id": "310120001001204001",
		"parentid": "310120103000"
	},
	{
		"shortname": "益民村村委会",
		"id": "310120001001205001",
		"parentid": "310120103000"
	},
	{
		"shortname": "关港村村委会",
		"id": "310120001001206001",
		"parentid": "310120103000"
	},
	{
		"shortname": "北新村村委会",
		"id": "310120001001207001",
		"parentid": "310120103000"
	},
	{
		"shortname": "五宅村村委会",
		"id": "310120001001208001",
		"parentid": "310120103000"
	}, {
		"shortname": "奉浦一居委会",
		"id": "310120002001001001",
		"parentid": "310120002001"
	},
	{
		"shortname": "奉浦二居委会",
		"id": "310120002001002001",
		"parentid": "310120002001"
	},
	{
		"shortname": "奉浦三居委会",
		"id": "310120002001003001",
		"parentid": "310120002001"
	},
	{
		"shortname": "第四社区居委会",
		"id": "310120002001004001",
		"parentid": "310120002001"
	},
	{
		"shortname": "第五社区居委会",
		"id": "310120002001005001",
		"parentid": "310120002001"
	},
	{
		"shortname": "第六社区居委会",
		"id": "310120002001006001",
		"parentid": "310120002001"
	},
	{
		"shortname": "第七社区居委会",
		"id": "310120002001007001",
		"parentid": "310120002001"
	},
	{
		"shortname": "第九社区居委会",
		"id": "310120002001009001",
		"parentid": "310120002001"
	},
	{
		"shortname": "肖塘居委会",
		"id": "310120002001010001",
		"parentid": "310120002001"
	},
	{
		"shortname": "弯弯社区居委会",
		"id": "310120002001011001",
		"parentid": "310120002001"
	},
	{
		"shortname": "天鹅湾社区居委会",
		"id": "310120002001012001",
		"parentid": "310120002001"
	},
	{
		"shortname": "秋月社区居委会",
		"id": "310120002001013001",
		"parentid": "310120002001"
	},
	{
		"shortname": "陈湾村村委会",
		"id": "310120002001201001",
		"parentid": "310120002001"
	},
	{
		"shortname": "公谊村村委会",
		"id": "310120002001202001",
		"parentid": "310120002001"
	},
	{
		"shortname": "韩村村委会",
		"id": "310120002001204001",
		"parentid": "310120002001"
	},
	{
		"shortname": "九华村村委会",
		"id": "310120002001205001",
		"parentid": "310120002001"
	},
	{
		"shortname": "肖塘村村委会",
		"id": "310120002001207001",
		"parentid": "310120002001"
	}, {
		"shortname": "古华第一居委会",
		"id": "310120101001001001",
		"parentid": "310120101000"
	},
	{
		"shortname": "古华第二居委会",
		"id": "310120101001002001",
		"parentid": "310120101000"
	},
	{
		"shortname": "古华第三居委会",
		"id": "310120101001003001",
		"parentid": "310120101000"
	},
	{
		"shortname": "运河居委会",
		"id": "310120101001004001",
		"parentid": "310120101000"
	},
	{
		"shortname": "育秀第一居委会",
		"id": "310120101001005001",
		"parentid": "310120101000"
	},
	{
		"shortname": "育秀第二居委会",
		"id": "310120101001006001",
		"parentid": "310120101000"
	},
	{
		"shortname": "育秀第三居委会",
		"id": "310120101001007001",
		"parentid": "310120101000"
	},
	{
		"shortname": "育秀第五居委会",
		"id": "310120101001008001",
		"parentid": "310120101000"
	},
	{
		"shortname": "育秀第七居委会",
		"id": "310120101001009001",
		"parentid": "310120101000"
	},
	{
		"shortname": "解放第一居委会",
		"id": "310120101001010001",
		"parentid": "310120101000"
	},
	{
		"shortname": "解放第二居委会",
		"id": "310120101001011001",
		"parentid": "310120101000"
	},
	{
		"shortname": "解放第三居委会",
		"id": "310120101001012001",
		"parentid": "310120101000"
	},
	{
		"shortname": "北街居委会",
		"id": "310120101001013001",
		"parentid": "310120101000"
	},
	{
		"shortname": "中街居委会",
		"id": "310120101001014001",
		"parentid": "310120101000"
	},
	{
		"shortname": "南街居委会",
		"id": "310120101001015001",
		"parentid": "310120101000"
	},
	{
		"shortname": "曙光第一居委会",
		"id": "310120101001016001",
		"parentid": "310120101000"
	},
	{
		"shortname": "贝港第一居委会",
		"id": "310120101001017001",
		"parentid": "310120101000"
	},
	{
		"shortname": "贝港第二居委会",
		"id": "310120101001018001",
		"parentid": "310120101000"
	},
	{
		"shortname": "贝港第三居委会",
		"id": "310120101001019001",
		"parentid": "310120101000"
	},
	{
		"shortname": "贝港第四居委会",
		"id": "310120101001020001",
		"parentid": "310120101000"
	},
	{
		"shortname": "贝港第五居委会",
		"id": "310120101001021001",
		"parentid": "310120101000"
	},
	{
		"shortname": "江海第一居委会",
		"id": "310120101001022001",
		"parentid": "310120101000"
	},
	{
		"shortname": "江海第二居委会",
		"id": "310120101001024001",
		"parentid": "310120101000"
	},
	{
		"shortname": "江海第三居委会",
		"id": "310120101001025001",
		"parentid": "310120101000"
	},
	{
		"shortname": "江海第四居委会",
		"id": "310120101001028001",
		"parentid": "310120101000"
	},
	{
		"shortname": "江海第五居委会",
		"id": "310120101001030001",
		"parentid": "310120101000"
	},
	{
		"shortname": "曙光第二社区居委会",
		"id": "310120101001031001",
		"parentid": "310120101000"
	},
	{
		"shortname": "阳光第一社区居委会",
		"id": "310120101001032001",
		"parentid": "310120101000"
	},
	{
		"shortname": "正阳第一社区居委会",
		"id": "310120101001042001",
		"parentid": "310120101000"
	},
	{
		"shortname": "阳光第二社区居委会",
		"id": "310120101001043001",
		"parentid": "310120101000"
	},
	{
		"shortname": "贝港第六社区居委会",
		"id": "310120101001044001",
		"parentid": "310120101000"
	},
	{
		"shortname": "正阳第二社区居委会",
		"id": "310120101001047001",
		"parentid": "310120101000"
	},
	{
		"shortname": "民旺苑第一社区居委会",
		"id": "310120101001048001",
		"parentid": "310120101000"
	},
	{
		"shortname": "正阳第三社区居委会",
		"id": "310120101001049001",
		"parentid": "310120101000"
	},
	{
		"shortname": "阳光第三社区居委会",
		"id": "310120101001050001",
		"parentid": "310120101000"
	},
	{
		"shortname": "朝阳居委会",
		"id": "310120101001052001",
		"parentid": "310120101000"
	},
	{
		"shortname": "新悦社区居委会",
		"id": "310120101001053001",
		"parentid": "310120101000"
	},
	{
		"shortname": "银河社区居委会",
		"id": "310120101001054001",
		"parentid": "310120101000"
	},
	{
		"shortname": "昊海社区居委会",
		"id": "310120101001055001",
		"parentid": "310120101000"
	},
	{
		"shortname": "富康社区居委会",
		"id": "310120101001056001",
		"parentid": "310120101000"
	},
	{
		"shortname": "沈陆村村委会",
		"id": "310120101001201001",
		"parentid": "310120101000"
	},
	{
		"shortname": "江海村村委会",
		"id": "310120101001203001",
		"parentid": "310120101000"
	},
	{
		"shortname": "六墩村村委会",
		"id": "310120101001208001",
		"parentid": "310120101000"
	},
	{
		"shortname": "曙光村村委会",
		"id": "310120101001212001",
		"parentid": "310120101000"
	},
	{
		"shortname": "张翁庙村村委会",
		"id": "310120101001213001",
		"parentid": "310120101000"
	},
	{
		"shortname": "华严村村委会",
		"id": "310120101001221001",
		"parentid": "310120101000"
	},
	{
		"shortname": "庙泾村村委会",
		"id": "310120101001231001",
		"parentid": "310120101000"
	},
	{
		"shortname": "光明村村委会",
		"id": "310120101001232001",
		"parentid": "310120101000"
	},
	{
		"shortname": "杨王村村委会",
		"id": "310120101001234001",
		"parentid": "310120101000"
	},
	{
		"shortname": "吴塘村村委会",
		"id": "310120101001235001",
		"parentid": "310120101000"
	},
	{
		"shortname": "灵芝村村委会",
		"id": "310120101001236001",
		"parentid": "310120101000"
	}, {
		"shortname": "第一社区居委会",
		"id": "310120102001008001",
		"parentid": "310120102000"
	},
	{
		"shortname": "第二社区居委会",
		"id": "310120102001009001",
		"parentid": "310120102000"
	},
	{
		"shortname": "第三社区居委会",
		"id": "310120102001010001",
		"parentid": "310120102000"
	},
	{
		"shortname": "第四社区居委会",
		"id": "310120102001011001",
		"parentid": "310120102000"
	},
	{
		"shortname": "头桥第一社区居委会",
		"id": "310120102001012001",
		"parentid": "310120102000"
	},
	{
		"shortname": "头桥第二社区居委会",
		"id": "310120102001013001",
		"parentid": "310120102000"
	},
	{
		"shortname": "洪庙第一社区居委会",
		"id": "310120102001014001",
		"parentid": "310120102000"
	},
	{
		"shortname": "洪庙第二社区居委会",
		"id": "310120102001015001",
		"parentid": "310120102000"
	},
	{
		"shortname": "塘外社区居委会",
		"id": "310120102001016001",
		"parentid": "310120102000"
	},
	{
		"shortname": "奉城社区第五居委会",
		"id": "310120102001017001",
		"parentid": "310120102000"
	},
	{
		"shortname": "奉城社区第六居委会",
		"id": "310120102001018001",
		"parentid": "310120102000"
	},
	{
		"shortname": "灯民村村委会",
		"id": "310120102001201001",
		"parentid": "310120102000"
	},
	{
		"shortname": "高桥村村委会",
		"id": "310120102001202001",
		"parentid": "310120102000"
	},
	{
		"shortname": "陈桥村村委会",
		"id": "310120102001203001",
		"parentid": "310120102000"
	},
	{
		"shortname": "八字村村委会",
		"id": "310120102001204001",
		"parentid": "310120102000"
	},
	{
		"shortname": "路口村村委会",
		"id": "310120102001205001",
		"parentid": "310120102000"
	},
	{
		"shortname": "久茂村村委会",
		"id": "310120102001207001",
		"parentid": "310120102000"
	},
	{
		"shortname": "爱民村村委会",
		"id": "310120102001208001",
		"parentid": "310120102000"
	},
	{
		"shortname": "永民村村委会",
		"id": "310120102001209001",
		"parentid": "310120102000"
	},
	{
		"shortname": "联民村村委会",
		"id": "310120102001211001",
		"parentid": "310120102000"
	},
	{
		"shortname": "新民村村委会",
		"id": "310120102001213001",
		"parentid": "310120102000"
	},
	{
		"shortname": "东门村村委会",
		"id": "310120102001214001",
		"parentid": "310120102000"
	},
	{
		"shortname": "城东村村委会",
		"id": "310120102001215001",
		"parentid": "310120102000"
	},
	{
		"shortname": "南街村村委会",
		"id": "310120102001216001",
		"parentid": "310120102000"
	},
	{
		"shortname": "奉城村村委会",
		"id": "310120102001217001",
		"parentid": "310120102000"
	},
	{
		"shortname": "北门村村委会",
		"id": "310120102001218001",
		"parentid": "310120102000"
	},
	{
		"shortname": "白衣聚村村委会",
		"id": "310120102001219001",
		"parentid": "310120102000"
	},
	{
		"shortname": "盐行村村委会",
		"id": "310120102001220001",
		"parentid": "310120102000"
	},
	{
		"shortname": "朱墩村村委会",
		"id": "310120102001222001",
		"parentid": "310120102000"
	},
	{
		"shortname": "大门村村委会",
		"id": "310120102001223001",
		"parentid": "310120102000"
	},
	{
		"shortname": "塘外村村委会",
		"id": "310120102001224001",
		"parentid": "310120102000"
	},
	{
		"shortname": "卫季村村委会",
		"id": "310120102001225001",
		"parentid": "310120102000"
	},
	{
		"shortname": "护民村村委会",
		"id": "310120102001229001",
		"parentid": "310120102000"
	},
	{
		"shortname": "洪东村村委会",
		"id": "310120102001230001",
		"parentid": "310120102000"
	},
	{
		"shortname": "洪北村村委会",
		"id": "310120102001232001",
		"parentid": "310120102000"
	},
	{
		"shortname": "洪庙村村委会",
		"id": "310120102001233001",
		"parentid": "310120102000"
	},
	{
		"shortname": "洪西村村委会",
		"id": "310120102001234001",
		"parentid": "310120102000"
	},
	{
		"shortname": "洪南村村委会",
		"id": "310120102001235001",
		"parentid": "310120102000"
	},
	{
		"shortname": "协新村村委会",
		"id": "310120102001236001",
		"parentid": "310120102000"
	},
	{
		"shortname": "朱新村村委会",
		"id": "310120102001238001",
		"parentid": "310120102000"
	},
	{
		"shortname": "集贤村村委会",
		"id": "310120102001240001",
		"parentid": "310120102000"
	},
	{
		"shortname": "陆家桥村村委会",
		"id": "310120102001242001",
		"parentid": "310120102000"
	},
	{
		"shortname": "红旗村村委会",
		"id": "310120102001243001",
		"parentid": "310120102000"
	},
	{
		"shortname": "冯家村村委会",
		"id": "310120102001245001",
		"parentid": "310120102000"
	},
	{
		"shortname": "幸福村村委会",
		"id": "310120102001246001",
		"parentid": "310120102000"
	},
	{
		"shortname": "戴家村村委会",
		"id": "310120102001247001",
		"parentid": "310120102000"
	},
	{
		"shortname": "分水墩村村委会",
		"id": "310120102001248001",
		"parentid": "310120102000"
	},
	{
		"shortname": "二桥村村委会",
		"id": "310120102001252001",
		"parentid": "310120102000"
	},
	{
		"shortname": "蔡家桥村村委会",
		"id": "310120102001253001",
		"parentid": "310120102000"
	},
	{
		"shortname": "东新市村村委会",
		"id": "310120102001255001",
		"parentid": "310120102000"
	},
	{
		"shortname": "南宋村村委会",
		"id": "310120102001257001",
		"parentid": "310120102000"
	},
	{
		"shortname": "北宋村村委会",
		"id": "310120102001259001",
		"parentid": "310120102000"
	}, {
		"shortname": "庄行居委会",
		"id": "310120104001001001",
		"parentid": "310120104000"
	},
	{
		"shortname": "邬桥居委会",
		"id": "310120104001003001",
		"parentid": "310120104000"
	},
	{
		"shortname": "庄行新苑第一居委会",
		"id": "310120104001004001",
		"parentid": "310120104000"
	},
	{
		"shortname": "丽水湾社区居委会",
		"id": "310120104001005001",
		"parentid": "310120104000"
	},
	{
		"shortname": "沙港湾社区居委会",
		"id": "310120104001006001",
		"parentid": "310120104000"
	},
	{
		"shortname": "吕桥村村委会",
		"id": "310120104001201001",
		"parentid": "310120104000"
	},
	{
		"shortname": "东风村村委会",
		"id": "310120104001203001",
		"parentid": "310120104000"
	},
	{
		"shortname": "长浜村村委会",
		"id": "310120104001205001",
		"parentid": "310120104000"
	},
	{
		"shortname": "长堤村村委会",
		"id": "310120104001209001",
		"parentid": "310120104000"
	},
	{
		"shortname": "潘垫村村委会",
		"id": "310120104001210001",
		"parentid": "310120104000"
	},
	{
		"shortname": "新华村村委会",
		"id": "310120104001213001",
		"parentid": "310120104000"
	},
	{
		"shortname": "杨溇村村委会",
		"id": "310120104001216001",
		"parentid": "310120104000"
	},
	{
		"shortname": "芦泾村村委会",
		"id": "310120104001218001",
		"parentid": "310120104000"
	},
	{
		"shortname": "存古村村委会",
		"id": "310120104001220001",
		"parentid": "310120104000"
	},
	{
		"shortname": "西校村村委会",
		"id": "310120104001221001",
		"parentid": "310120104000"
	},
	{
		"shortname": "汇安村村委会",
		"id": "310120104001222001",
		"parentid": "310120104000"
	},
	{
		"shortname": "马路村村委会",
		"id": "310120104001225001",
		"parentid": "310120104000"
	},
	{
		"shortname": "浦秀村村委会",
		"id": "310120104001227001",
		"parentid": "310120104000"
	},
	{
		"shortname": "渔沥村村委会",
		"id": "310120104001229001",
		"parentid": "310120104000"
	},
	{
		"shortname": "新叶村村委会",
		"id": "310120104001231001",
		"parentid": "310120104000"
	},
	{
		"shortname": "张塘村村委会",
		"id": "310120104001232001",
		"parentid": "310120104000"
	}, {
		"shortname": "金汇镇居委会",
		"id": "310120106001001001",
		"parentid": "310120106000"
	},
	{
		"shortname": "齐贤居委会",
		"id": "310120106001002001",
		"parentid": "310120106000"
	},
	{
		"shortname": "泰日居委会",
		"id": "310120106001003001",
		"parentid": "310120106000"
	},
	{
		"shortname": "泰绿社区居委会",
		"id": "310120106001004001",
		"parentid": "310120106000"
	},
	{
		"shortname": "金碧社区居委会",
		"id": "310120106001005001",
		"parentid": "310120106000"
	},
	{
		"shortname": "恒苑社区居委会",
		"id": "310120106001006001",
		"parentid": "310120106000"
	},
	{
		"shortname": "和苑社区居委会",
		"id": "310120106001007001",
		"parentid": "310120106000"
	},
	{
		"shortname": "旺苑社区居委会",
		"id": "310120106001008001",
		"parentid": "310120106000"
	},
	{
		"shortname": "金汇村村委会",
		"id": "310120106001201001",
		"parentid": "310120106000"
	},
	{
		"shortname": "金星村村委会",
		"id": "310120106001203001",
		"parentid": "310120106000"
	},
	{
		"shortname": "东星村村委会",
		"id": "310120106001204001",
		"parentid": "310120106000"
	},
	{
		"shortname": "新强村村委会",
		"id": "310120106001206001",
		"parentid": "310120106000"
	},
	{
		"shortname": "白沙村村委会",
		"id": "310120106001221001",
		"parentid": "310120106000"
	},
	{
		"shortname": "行前村村委会",
		"id": "310120106001222001",
		"parentid": "310120106000"
	},
	{
		"shortname": "百曲村村委会",
		"id": "310120106001225001",
		"parentid": "310120106000"
	},
	{
		"shortname": "南行村村委会",
		"id": "310120106001228002",
		"parentid": "310120106000"
	},
	{
		"shortname": "光辉村村委会",
		"id": "310120106001231001",
		"parentid": "310120106000"
	},
	{
		"shortname": "明星村村委会",
		"id": "310120106001233001",
		"parentid": "310120106000"
	},
	{
		"shortname": "北丁村村委会",
		"id": "310120106001234002",
		"parentid": "310120106000"
	},
	{
		"shortname": "南陈村村委会",
		"id": "310120106001236001",
		"parentid": "310120106000"
	},
	{
		"shortname": "乐善村村委会",
		"id": "310120106001237001",
		"parentid": "310120106000"
	},
	{
		"shortname": "梁典村村委会",
		"id": "310120106001240001",
		"parentid": "310120106000"
	},
	{
		"shortname": "资福村村委会",
		"id": "310120106001243001",
		"parentid": "310120106000"
	},
	{
		"shortname": "梅园村村委会",
		"id": "310120106001244001",
		"parentid": "310120106000"
	},
	{
		"shortname": "周家村村委会",
		"id": "310120106001246001",
		"parentid": "310120106000"
	},
	{
		"shortname": "墩头村村委会",
		"id": "310120106001248001",
		"parentid": "310120106000"
	}, {
		"shortname": "四团居委会",
		"id": "310120109001001001",
		"parentid": "310120109000"
	},
	{
		"shortname": "平安居委会",
		"id": "310120109001002001",
		"parentid": "310120109000"
	},
	{
		"shortname": "邵厂居委会",
		"id": "310120109001003001",
		"parentid": "310120109000"
	},
	{
		"shortname": "平安第二社区居委会",
		"id": "310120109001004001",
		"parentid": "310120109000"
	},
	{
		"shortname": "锦港佳苑社区居委会",
		"id": "310120109001005001",
		"parentid": "310120109000"
	},
	{
		"shortname": "海港新苑社区居委会",
		"id": "310120109001006001",
		"parentid": "310120109000"
	},
	{
		"shortname": "三坎村村委会",
		"id": "310120109001201001",
		"parentid": "310120109000"
	},
	{
		"shortname": "镇西村村委会",
		"id": "310120109001203001",
		"parentid": "310120109000"
	},
	{
		"shortname": "大桥村村委会",
		"id": "310120109001204001",
		"parentid": "310120109000"
	},
	{
		"shortname": "团南村村委会",
		"id": "310120109001205001",
		"parentid": "310120109000"
	},
	{
		"shortname": "四团村村委会",
		"id": "310120109001207001",
		"parentid": "310120109000"
	},
	{
		"shortname": "长堰村村委会",
		"id": "310120109001210001",
		"parentid": "310120109000"
	},
	{
		"shortname": "小荡村村委会",
		"id": "310120109001212001",
		"parentid": "310120109000"
	},
	{
		"shortname": "新桥村村委会",
		"id": "310120109001215001",
		"parentid": "310120109000"
	},
	{
		"shortname": "夏家村村委会",
		"id": "310120109001217001",
		"parentid": "310120109000"
	},
	{
		"shortname": "拾村村村委会",
		"id": "310120109001218001",
		"parentid": "310120109000"
	},
	{
		"shortname": "渔墩村村委会",
		"id": "310120109001220001",
		"parentid": "310120109000"
	},
	{
		"shortname": "渔洋村村委会",
		"id": "310120109001222001",
		"parentid": "310120109000"
	},
	{
		"shortname": "向阳村村委会",
		"id": "310120109001223001",
		"parentid": "310120109000"
	},
	{
		"shortname": "龙尖村村委会",
		"id": "310120109001225001",
		"parentid": "310120109000"
	},
	{
		"shortname": "平海村村委会",
		"id": "310120109001228001",
		"parentid": "310120109000"
	},
	{
		"shortname": "三团港村村委会",
		"id": "310120109001229001",
		"parentid": "310120109000"
	},
	{
		"shortname": "五四村村委会",
		"id": "310120109001231001",
		"parentid": "310120109000"
	},
	{
		"shortname": "新建村村委会",
		"id": "310120109001235001",
		"parentid": "310120109000"
	},
	{
		"shortname": "前哨村村委会",
		"id": "310120109001236001",
		"parentid": "310120109000"
	},
	{
		"shortname": "横桥村村委会",
		"id": "310120109001240001",
		"parentid": "310120109000"
	},
	{
		"shortname": "杨家宅村村委会",
		"id": "310120109001241001",
		"parentid": "310120109000"
	},
	{
		"shortname": "平南村村委会",
		"id": "310120109001244001",
		"parentid": "310120109000"
	},
	{
		"shortname": "红庄村村委会",
		"id": "310120109001245001",
		"parentid": "310120109000"
	},
	{
		"shortname": "农展村村委会",
		"id": "310120109001246001",
		"parentid": "310120109000"
	},
	{
		"shortname": "民福村村委会",
		"id": "310120109001247001",
		"parentid": "310120109000"
	},
	{
		"shortname": "邵靴村村委会",
		"id": "310120109001248001",
		"parentid": "310120109000"
	}, {
		"shortname": "青村镇居委会",
		"id": "310120111001001001",
		"parentid": "310120111000"
	},
	{
		"shortname": "钱桥居委会",
		"id": "310120111001002001",
		"parentid": "310120111000"
	},
	{
		"shortname": "北唐社区居委会",
		"id": "310120111001004001",
		"parentid": "310120111000"
	},
	{
		"shortname": "红星社区居委会",
		"id": "310120111001005001",
		"parentid": "310120111000"
	},
	{
		"shortname": "朱店村村委会",
		"id": "310120111001201001",
		"parentid": "310120111000"
	},
	{
		"shortname": "钟家村村委会",
		"id": "310120111001202001",
		"parentid": "310120111000"
	},
	{
		"shortname": "姚家村村委会",
		"id": "310120111001203001",
		"parentid": "310120111000"
	},
	{
		"shortname": "和中村村委会",
		"id": "310120111001206001",
		"parentid": "310120111000"
	},
	{
		"shortname": "岳和村村委会",
		"id": "310120111001207001",
		"parentid": "310120111000"
	},
	{
		"shortname": "陶宅村村委会",
		"id": "310120111001208001",
		"parentid": "310120111000"
	},
	{
		"shortname": "西吴村村委会",
		"id": "310120111001210001",
		"parentid": "310120111000"
	},
	{
		"shortname": "北唐村村委会",
		"id": "310120111001212001",
		"parentid": "310120111000"
	},
	{
		"shortname": "李窑村村委会",
		"id": "310120111001214001",
		"parentid": "310120111000"
	},
	{
		"shortname": "钱忠村村委会",
		"id": "310120111001215001",
		"parentid": "310120111000"
	},
	{
		"shortname": "桃园村村委会",
		"id": "310120111001217001",
		"parentid": "310120111000"
	},
	{
		"shortname": "申隆二村村委会",
		"id": "310120111001219001",
		"parentid": "310120111000"
	},
	{
		"shortname": "申隆一村村委会",
		"id": "310120111001220001",
		"parentid": "310120111000"
	},
	{
		"shortname": "元通村村委会",
		"id": "310120111001222001",
		"parentid": "310120111000"
	},
	{
		"shortname": "金王村村委会",
		"id": "310120111001223001",
		"parentid": "310120111000"
	},
	{
		"shortname": "吴房村村委会",
		"id": "310120111001224001",
		"parentid": "310120111000"
	},
	{
		"shortname": "新张村村委会",
		"id": "310120111001225001",
		"parentid": "310120111000"
	},
	{
		"shortname": "花角村村委会",
		"id": "310120111001226001",
		"parentid": "310120111000"
	},
	{
		"shortname": "石海村村委会",
		"id": "310120111001227001",
		"parentid": "310120111000"
	},
	{
		"shortname": "湾张村村委会",
		"id": "310120111001233001",
		"parentid": "310120111000"
	},
	{
		"shortname": "工农村村委会",
		"id": "310120111001234001",
		"parentid": "310120111000"
	},
	{
		"shortname": "张弄村村委会",
		"id": "310120111001235001",
		"parentid": "310120111000"
	},
	{
		"shortname": "解放村村委会",
		"id": "310120111001236001",
		"parentid": "310120111000"
	},
	{
		"shortname": "南星村村委会",
		"id": "310120111001237001",
		"parentid": "310120111000"
	},
	{
		"shortname": "柘林镇居委会",
		"id": "310120118001001001",
		"parentid": "310120118000"
	},
	{
		"shortname": "新寺居委会",
		"id": "310120118001002001",
		"parentid": "310120118000"
	},
	{
		"shortname": "胡桥居委会",
		"id": "310120118001003001",
		"parentid": "310120118000"
	},
	{
		"shortname": "目华居委会",
		"id": "310120118001004001",
		"parentid": "310120118000"
	},
	{
		"shortname": "冯桥居委会",
		"id": "310120118001005001",
		"parentid": "310120118000"
	},
	{
		"shortname": "渔业新村社区居委会",
		"id": "310120118001006001",
		"parentid": "310120118000"
	},
	{
		"shortname": "海畔新村社区居委会",
		"id": "310120118001007001",
		"parentid": "310120118000"
	},
	{
		"shortname": "海韵社区居委会",
		"id": "310120118001008001",
		"parentid": "310120118000"
	},
	{
		"shortname": "营房村村委会",
		"id": "310120118001202001",
		"parentid": "310120118000"
	},
	{
		"shortname": "夹路村村委会",
		"id": "310120118001203001",
		"parentid": "310120118000"
	},
	{
		"shortname": "柘林村村委会",
		"id": "310120118001205001",
		"parentid": "310120118000"
	},
	{
		"shortname": "华亭村村委会",
		"id": "310120118001207002",
		"parentid": "310120118000"
	},
	{
		"shortname": "新塘村村委会",
		"id": "310120118001210001",
		"parentid": "310120118000"
	},
	{
		"shortname": "新寺村村委会",
		"id": "310120118001212001",
		"parentid": "310120118000"
	},
	{
		"shortname": "南胜村村委会",
		"id": "310120118001214001",
		"parentid": "310120118000"
	},
	{
		"shortname": "金海村村委会",
		"id": "310120118001216001",
		"parentid": "310120118000"
	},
	{
		"shortname": "海湾村村委会",
		"id": "310120118001217001",
		"parentid": "310120118000"
	},
	{
		"shortname": "胡桥村村委会",
		"id": "310120118001221001",
		"parentid": "310120118000"
	},
	{
		"shortname": "王家圩村村委会",
		"id": "310120118001224001",
		"parentid": "310120118000"
	},
	{
		"shortname": "迎龙村村委会",
		"id": "310120118001226001",
		"parentid": "310120118000"
	},
	{
		"shortname": "法华村村委会",
		"id": "310120118001227001",
		"parentid": "310120118000"
	},
	{
		"shortname": "三桥村村委会",
		"id": "310120118001229001",
		"parentid": "310120118000"
	},
	{
		"shortname": "兴园村村委会",
		"id": "310120118001233001",
		"parentid": "310120118000"
	},
	{
		"shortname": "临海村村委会",
		"id": "310120118001235001",
		"parentid": "310120118000"
	}, {
		"shortname": "明城新村社区居委会",
		"id": "310120123001001001",
		"parentid": "310120123000"
	},
	{
		"shortname": "星火一居委会",
		"id": "310120123001002001",
		"parentid": "310120123000"
	},
	{
		"shortname": "星火二居委会",
		"id": "310120123001003001",
		"parentid": "310120123000"
	},
	{
		"shortname": "燎原居委会",
		"id": "310120123001004001",
		"parentid": "310120123000"
	},
	{
		"shortname": "中港居委会",
		"id": "310120123001005001",
		"parentid": "310120123000"
	},
	{
		"shortname": "一兴居委会",
		"id": "310120123001006001",
		"parentid": "310120123000"
	},
	{
		"shortname": "洪卫居委会",
		"id": "310120123001007001",
		"parentid": "310120123000"
	},
	{
		"shortname": "星火世茂社区居委会",
		"id": "310120123001008001",
		"parentid": "310120123000"
	}, {
		"shortname": "海湾居委会",
		"id": "310120503001001001",
		"parentid": "310120503000"
	},
	{
		"shortname": "第二社区居委会",
		"id": "310120503001002001",
		"parentid": "310120503000"
	},
	{
		"shortname": "新港村村委会",
		"id": "310120503001201001",
		"parentid": "310120503000"
	},
	{
		"shortname": "海棠社区居民委员会",
		"id": "310120503001801002",
		"parentid": "310120503000"
	}, {
		"shortname": "金水苑社区居委会",
		"id": "310120504001001001",
		"parentid": "310120504000"
	},
	{
		"shortname": "金水新苑社区居委会",
		"id": "310120504001002001",
		"parentid": "310120504000"
	},
	{
		"shortname": "恒盛居委会",
		"id": "310120504001003001",
		"parentid": "310120504000"
	},
	{
		"shortname": "恒贤居委会",
		"id": "310120504001004001",
		"parentid": "310120504000"
	},
	{
		"shortname": "金水佳苑居委会",
		"id": "310120504001005001",
		"parentid": "310120504000"
	},
	{
		"shortname": "韩树村村委会",
		"id": "310120504001201001",
		"parentid": "310120504000"
	},
	{
		"shortname": "陈谊村村委会",
		"id": "310120504001202001",
		"parentid": "310120504000"
	},
	{
		"shortname": "齐贤村村委会",
		"id": "310120504001203001",
		"parentid": "310120504000"
	},
	{
		"shortname": "龙潭村村委会",
		"id": "310120504001204001",
		"parentid": "310120504000"
	},
	{
		"shortname": "三长村村委会",
		"id": "310120504001205001",
		"parentid": "310120504000"
	},
	{
		"shortname": "陈家村村委会",
		"id": "310120504001206001",
		"parentid": "310120504000"
	},
	{
		"shortname": "屠家村村委会",
		"id": "310120504001207001",
		"parentid": "310120504000"
	},
	{
		"shortname": "丁家村村委会",
		"id": "310120504001208001",
		"parentid": "310120504000"
	},
	{
		"shortname": "石家村村委会",
		"id": "310120504001209001",
		"parentid": "310120504000"
	}, {
		"shortname": "南门居委会",
		"id": "310151101001001001",
		"parentid": "310230101000"
	},
	{
		"shortname": "花园弄居委会",
		"id": "310151101001002001",
		"parentid": "310230101000"
	},
	{
		"shortname": "新崇居委会",
		"id": "310151101001003001",
		"parentid": "310230101000"
	},
	{
		"shortname": "城中居委会",
		"id": "310151101001004001",
		"parentid": "310230101000"
	},
	{
		"shortname": "吴家弄居委会",
		"id": "310151101001005001",
		"parentid": "310230101000"
	},
	{
		"shortname": "川心街居委会",
		"id": "310151101001006001",
		"parentid": "310230101000"
	},
	{
		"shortname": "西泯沟居委会",
		"id": "310151101001007001",
		"parentid": "310230101000"
	},
	{
		"shortname": "东河沿居委会",
		"id": "310151101001008001",
		"parentid": "310230101000"
	},
	{
		"shortname": "北门社区居委会",
		"id": "310151101001009001",
		"parentid": "310230101000"
	},
	{
		"shortname": "西门南村居委会",
		"id": "310151101001010001",
		"parentid": "310230101000"
	},
	{
		"shortname": "西门北村居委会",
		"id": "310151101001011001",
		"parentid": "310230101000"
	},
	{
		"shortname": "城西居委会",
		"id": "310151101001012001",
		"parentid": "310230101000"
	},
	{
		"shortname": "东门新村居委会",
		"id": "310151101001013001",
		"parentid": "310230101000"
	},
	{
		"shortname": "玉环新村居委会",
		"id": "310151101001014001",
		"parentid": "310230101000"
	},
	{
		"shortname": "江山新村居委会",
		"id": "310151101001015001",
		"parentid": "310230101000"
	},
	{
		"shortname": "学宫新村居委会",
		"id": "310151101001016001",
		"parentid": "310230101000"
	},
	{
		"shortname": "湄洲新村居委会",
		"id": "310151101001017001",
		"parentid": "310230101000"
	},
	{
		"shortname": "观潮新村居委会",
		"id": "310151101001018001",
		"parentid": "310230101000"
	},
	{
		"shortname": "小港新村居委会",
		"id": "310151101001019001",
		"parentid": "310230101000"
	},
	{
		"shortname": "永凤居委会",
		"id": "310151101001020001",
		"parentid": "310230101000"
	},
	{
		"shortname": "怡祥居居委会",
		"id": "310151101001021001",
		"parentid": "310230101000"
	},
	{
		"shortname": "城东居委会",
		"id": "310151101001022001",
		"parentid": "310230101000"
	},
	{
		"shortname": "明珠花苑居委会",
		"id": "310151101001023001",
		"parentid": "310230101000"
	},
	{
		"shortname": "金珠居委会",
		"id": "310151101001024001",
		"parentid": "310230101000"
	},
	{
		"shortname": "海岛星城居委会",
		"id": "310151101001025001",
		"parentid": "310230101000"
	},
	{
		"shortname": "金鳌山社区居委会",
		"id": "310151101001026001",
		"parentid": "310230101000"
	},
	{
		"shortname": "江帆社区居委会",
		"id": "310151101001027001",
		"parentid": "310230101000"
	},
	{
		"shortname": "金日社区居委会",
		"id": "310151101001028001",
		"parentid": "310230101000"
	},
	{
		"shortname": "丁家桥居委会",
		"id": "310151101001029001",
		"parentid": "310230101000"
	},
	{
		"shortname": "城桥村村委会",
		"id": "310151101001201001",
		"parentid": "310230101000"
	},
	{
		"shortname": "马桥村村委会",
		"id": "310151101001202001",
		"parentid": "310230101000"
	},
	{
		"shortname": "运粮村村委会",
		"id": "310151101001203001",
		"parentid": "310230101000"
	},
	{
		"shortname": "新闸村村委会",
		"id": "310151101001204001",
		"parentid": "310230101000"
	},
	{
		"shortname": "元六村村委会",
		"id": "310151101001205001",
		"parentid": "310230101000"
	},
	{
		"shortname": "湾南村村委会",
		"id": "310151101001206001",
		"parentid": "310230101000"
	},
	{
		"shortname": "利民村村委会",
		"id": "310151101001207001",
		"parentid": "310230101000"
	},
	{
		"shortname": "老滧港渔村村委会",
		"id": "310151101001208001",
		"parentid": "310230101000"
	},
	{
		"shortname": "推虾港村村委会",
		"id": "310151101001209001",
		"parentid": "310230101000"
	},
	{
		"shortname": "鳌山村村委会",
		"id": "310151101001210001",
		"parentid": "310230101000"
	},
	{
		"shortname": "侯南村村委会",
		"id": "310151101001211001",
		"parentid": "310230101000"
	},
	{
		"shortname": "聚训村村委会",
		"id": "310151101001212001",
		"parentid": "310230101000"
	},
	{
		"shortname": "山阳村村委会",
		"id": "310151101001213001",
		"parentid": "310230101000"
	},
	{
		"shortname": "长兴村村委会",
		"id": "310151101001214001",
		"parentid": "310230101000"
	},
	{
		"shortname": "海天景苑居委会（筹建）",
		"id": "310151101001830001",
		"parentid": "310230101000"
	}, {
		"shortname": "解放社区居委会",
		"id": "310151102001001001",
		"parentid": "310230102000"
	},
	{
		"shortname": "电业社区居委会",
		"id": "310151102001002001",
		"parentid": "310230102000"
	},
	{
		"shortname": "向阳社区居委会",
		"id": "310151102001003001",
		"parentid": "310230102000"
	},
	{
		"shortname": "正大社区居委会",
		"id": "310151102001004001",
		"parentid": "310230102000"
	},
	{
		"shortname": "光明社区居委会",
		"id": "310151102001005001",
		"parentid": "310230102000"
	},
	{
		"shortname": "新港社区居委会",
		"id": "310151102001006001",
		"parentid": "310230102000"
	},
	{
		"shortname": "玉屏社区居委会",
		"id": "310151102001007001",
		"parentid": "310230102000"
	},
	{
		"shortname": "交通社区居委会",
		"id": "310151102001008001",
		"parentid": "310230102000"
	},
	{
		"shortname": "虹宝社区居委会",
		"id": "310151102001009001",
		"parentid": "310230102000"
	},
	{
		"shortname": "永和村村委会",
		"id": "310151102001201001",
		"parentid": "310230102000"
	},
	{
		"shortname": "花园村村委会",
		"id": "310151102001202001",
		"parentid": "310230102000"
	},
	{
		"shortname": "桃源村村委会",
		"id": "310151102001203001",
		"parentid": "310230102000"
	},
	{
		"shortname": "财贸村村委会",
		"id": "310151102001204001",
		"parentid": "310230102000"
	},
	{
		"shortname": "堡北村村委会",
		"id": "310151102001205001",
		"parentid": "310230102000"
	},
	{
		"shortname": "堡港村村委会",
		"id": "310151102001206001",
		"parentid": "310230102000"
	},
	{
		"shortname": "营房村村委会",
		"id": "310151102001207001",
		"parentid": "310230102000"
	},
	{
		"shortname": "人民村村委会",
		"id": "310151102001208001",
		"parentid": "310230102000"
	},
	{
		"shortname": "堡渔村村委会",
		"id": "310151102001209001",
		"parentid": "310230102000"
	},
	{
		"shortname": "堡兴村村委会",
		"id": "310151102001210001",
		"parentid": "310230102000"
	},
	{
		"shortname": "菜园村村委会",
		"id": "310151102001211001",
		"parentid": "310230102000"
	},
	{
		"shortname": "南海村村委会",
		"id": "310151102001212001",
		"parentid": "310230102000"
	},
	{
		"shortname": "小漾村村委会",
		"id": "310151102001213001",
		"parentid": "310230102000"
	},
	{
		"shortname": "米行村村委会",
		"id": "310151102001214001",
		"parentid": "310230102000"
	},
	{
		"shortname": "瀛南村村委会",
		"id": "310151102001215001",
		"parentid": "310230102000"
	},
	{
		"shortname": "四滧村村委会",
		"id": "310151102001216001",
		"parentid": "310230102000"
	},
	{
		"shortname": "彷徨村村委会",
		"id": "310151102001217001",
		"parentid": "310230102000"
	},
	{
		"shortname": "五滧村村委会",
		"id": "310151102001218001",
		"parentid": "310230102000"
	}, {
		"shortname": "新南居委会",
		"id": "310151103001001001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新东居委会",
		"id": "310151103001002001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新晨居委会",
		"id": "310151103001003001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新源居委会",
		"id": "310151103001004001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新景居委会",
		"id": "310151103001005001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新舟居委会",
		"id": "310151103001006001",
		"parentid": "310230103000"
	},
	{
		"shortname": "天新村村委会",
		"id": "310151103001201001",
		"parentid": "310230103000"
	},
	{
		"shortname": "金桥村村委会",
		"id": "310151103001202001",
		"parentid": "310230103000"
	},
	{
		"shortname": "石路村村委会",
		"id": "310151103001203001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新梅村村委会",
		"id": "310151103001204001",
		"parentid": "310230103000"
	},
	{
		"shortname": "三烈村村委会",
		"id": "310151103001205001",
		"parentid": "310230103000"
	},
	{
		"shortname": "兴教村村委会",
		"id": "310151103001206001",
		"parentid": "310230103000"
	},
	{
		"shortname": "井亭村村委会",
		"id": "310151103001207001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新民村村委会",
		"id": "310151103001208001",
		"parentid": "310230103000"
	},
	{
		"shortname": "永丰村村委会",
		"id": "310151103001209001",
		"parentid": "310230103000"
	},
	{
		"shortname": "群英村村委会",
		"id": "310151103001210001",
		"parentid": "310230103000"
	},
	{
		"shortname": "卫东村村委会",
		"id": "310151103001211001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新建村村委会",
		"id": "310151103001212001",
		"parentid": "310230103000"
	},
	{
		"shortname": "民生村村委会",
		"id": "310151103001213001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新隆村村委会",
		"id": "310151103001214001",
		"parentid": "310230103000"
	},
	{
		"shortname": "进化村村委会",
		"id": "310151103001215001",
		"parentid": "310230103000"
	},
	{
		"shortname": "强民村村委会",
		"id": "310151103001216001",
		"parentid": "310230103000"
	},
	{
		"shortname": "新光村村委会",
		"id": "310151103001217001",
		"parentid": "310230103000"
	},
	{
		"shortname": "庙镇居委会",
		"id": "310151104001001001",
		"parentid": "310230104000"
	},
	{
		"shortname": "猛将庙居委会",
		"id": "310151104001002001",
		"parentid": "310230104000"
	},
	{
		"shortname": "江口居委会",
		"id": "310151104001003001",
		"parentid": "310230104000"
	},
	{
		"shortname": "爱民村村委会",
		"id": "310151104001201001",
		"parentid": "310230104000"
	},
	{
		"shortname": "南星村村委会",
		"id": "310151104001202001",
		"parentid": "310230104000"
	},
	{
		"shortname": "庙南村村委会",
		"id": "310151104001203001",
		"parentid": "310230104000"
	},
	{
		"shortname": "庙西村村委会",
		"id": "310151104001204001",
		"parentid": "310230104000"
	},
	{
		"shortname": "米洪村村委会",
		"id": "310151104001205001",
		"parentid": "310230104000"
	},
	{
		"shortname": "庙中村村委会",
		"id": "310151104001206001",
		"parentid": "310230104000"
	},
	{
		"shortname": "庙港村村委会",
		"id": "310151104001207001",
		"parentid": "310230104000"
	},
	{
		"shortname": "白港村村委会",
		"id": "310151104001208001",
		"parentid": "310230104000"
	},
	{
		"shortname": "万安村村委会",
		"id": "310151104001209001",
		"parentid": "310230104000"
	},
	{
		"shortname": "鸽龙村村委会",
		"id": "310151104001210001",
		"parentid": "310230104000"
	},
	{
		"shortname": "万北村村委会",
		"id": "310151104001211001",
		"parentid": "310230104000"
	},
	{
		"shortname": "宏达村村委会",
		"id": "310151104001212001",
		"parentid": "310230104000"
	},
	{
		"shortname": "民华村村委会",
		"id": "310151104001213001",
		"parentid": "310230104000"
	},
	{
		"shortname": "江镇村村委会",
		"id": "310151104001214001",
		"parentid": "310230104000"
	},
	{
		"shortname": "启瀛村村委会",
		"id": "310151104001215001",
		"parentid": "310230104000"
	},
	{
		"shortname": "联益村村委会",
		"id": "310151104001216001",
		"parentid": "310230104000"
	},
	{
		"shortname": "镇东村村委会",
		"id": "310151104001217001",
		"parentid": "310230104000"
	},
	{
		"shortname": "通济村村委会",
		"id": "310151104001218001",
		"parentid": "310230104000"
	},
	{
		"shortname": "和平村村委会",
		"id": "310151104001219001",
		"parentid": "310230104000"
	},
	{
		"shortname": "合中村村委会",
		"id": "310151104001220001",
		"parentid": "310230104000"
	},
	{
		"shortname": "小竖村村委会",
		"id": "310151104001221001",
		"parentid": "310230104000"
	},
	{
		"shortname": "猛东村村委会",
		"id": "310151104001222001",
		"parentid": "310230104000"
	},
	{
		"shortname": "窑桥村村委会",
		"id": "310151104001223001",
		"parentid": "310230104000"
	},
	{
		"shortname": "周河村村委会",
		"id": "310151104001224001",
		"parentid": "310230104000"
	},
	{
		"shortname": "猛西村村委会",
		"id": "310151104001225001",
		"parentid": "310230104000"
	},
	{
		"shortname": "保东村村委会",
		"id": "310151104001226001",
		"parentid": "310230104000"
	},
	{
		"shortname": "永乐村村委会",
		"id": "310151104001227001",
		"parentid": "310230104000"
	},
	{
		"shortname": "保安村村委会",
		"id": "310151104001228001",
		"parentid": "310230104000"
	}, {
		"shortname": "新乐居委会",
		"id": "310151105001001001",
		"parentid": "310230106000"
	},
	{
		"shortname": "瀛兴居委会",
		"id": "310151105001002001",
		"parentid": "310230106000"
	},
	{
		"shortname": "堡西村村委会",
		"id": "310151105001201001",
		"parentid": "310230106000"
	},
	{
		"shortname": "东新村村委会",
		"id": "310151105001202001",
		"parentid": "310230106000"
	},
	{
		"shortname": "油桥村村委会",
		"id": "310151105001203001",
		"parentid": "310230106000"
	},
	{
		"shortname": "明强村村委会",
		"id": "310151105001204001",
		"parentid": "310230106000"
	},
	{
		"shortname": "永兴村村委会",
		"id": "310151105001205001",
		"parentid": "310230106000"
	},
	{
		"shortname": "竖西村村委会",
		"id": "310151105001206001",
		"parentid": "310230106000"
	},
	{
		"shortname": "惠民村村委会",
		"id": "310151105001207001",
		"parentid": "310230106000"
	},
	{
		"shortname": "竖河村村委会",
		"id": "310151105001208001",
		"parentid": "310230106000"
	},
	{
		"shortname": "竖南村村委会",
		"id": "310151105001209001",
		"parentid": "310230106000"
	},
	{
		"shortname": "新征村村委会",
		"id": "310151105001210001",
		"parentid": "310230106000"
	},
	{
		"shortname": "仙桥村村委会",
		"id": "310151105001211001",
		"parentid": "310230106000"
	},
	{
		"shortname": "大东村村委会",
		"id": "310151105001212001",
		"parentid": "310230106000"
	},
	{
		"shortname": "响同村村委会",
		"id": "310151105001213001",
		"parentid": "310230106000"
	},
	{
		"shortname": "跃进村村委会",
		"id": "310151105001214001",
		"parentid": "310230106000"
	},
	{
		"shortname": "春风村村委会",
		"id": "310151105001215001",
		"parentid": "310230106000"
	},
	{
		"shortname": "时桥村村委会",
		"id": "310151105001216001",
		"parentid": "310230106000"
	},
	{
		"shortname": "椿南村村委会",
		"id": "310151105001217001",
		"parentid": "310230106000"
	},
	{
		"shortname": "大椿村村委会",
		"id": "310151105001218001",
		"parentid": "310230106000"
	},
	{
		"shortname": "前哨村村委会",
		"id": "310151105001219001",
		"parentid": "310230106000"
	},
	{
		"shortname": "育才村村委会",
		"id": "310151105001220001",
		"parentid": "310230106000"
	},
	{
		"shortname": "前卫村村委会",
		"id": "310151105001221001",
		"parentid": "310230106000"
	}, {
		"shortname": "向宏居委会",
		"id": "310151106001001001",
		"parentid": "310230107000"
	},
	{
		"shortname": "六滧村村委会",
		"id": "310151106001201001",
		"parentid": "310230107000"
	},
	{
		"shortname": "花仓村村委会",
		"id": "310151106001202001",
		"parentid": "310230107000"
	},
	{
		"shortname": "南江村村委会",
		"id": "310151106001203001",
		"parentid": "310230107000"
	},
	{
		"shortname": "春光村村委会",
		"id": "310151106001204001",
		"parentid": "310230107000"
	},
	{
		"shortname": "阜康村村委会",
		"id": "310151106001205001",
		"parentid": "310230107000"
	},
	{
		"shortname": "向化村村委会",
		"id": "310151106001206001",
		"parentid": "310230107000"
	},
	{
		"shortname": "齐南村村委会",
		"id": "310151106001207001",
		"parentid": "310230107000"
	},
	{
		"shortname": "北港村村委会",
		"id": "310151106001208001",
		"parentid": "310230107000"
	},
	{
		"shortname": "卫星村村委会",
		"id": "310151106001209001",
		"parentid": "310230107000"
	},
	{
		"shortname": "米新村村委会",
		"id": "310151106001210001",
		"parentid": "310230107000"
	},
	{
		"shortname": "渔业村村委会",
		"id": "310151106001211001",
		"parentid": "310230107000"
	}, {
		"shortname": "三星居委会",
		"id": "310151107001001001",
		"parentid": "310230109000"
	},
	{
		"shortname": "沈镇村村委会",
		"id": "310151107001201001",
		"parentid": "310230109000"
	},
	{
		"shortname": "洪海村村委会",
		"id": "310151107001202001",
		"parentid": "310230109000"
	},
	{
		"shortname": "东安村村委会",
		"id": "310151107001203001",
		"parentid": "310230109000"
	},
	{
		"shortname": "平安村村委会",
		"id": "310151107001204001",
		"parentid": "310230109000"
	},
	{
		"shortname": "协进村村委会",
		"id": "310151107001205001",
		"parentid": "310230109000"
	},
	{
		"shortname": "海洪港村村委会",
		"id": "310151107001206001",
		"parentid": "310230109000"
	},
	{
		"shortname": "纯阳村村委会",
		"id": "310151107001207001",
		"parentid": "310230109000"
	},
	{
		"shortname": "南协村村委会",
		"id": "310151107001208001",
		"parentid": "310230109000"
	},
	{
		"shortname": "育德村村委会",
		"id": "310151107001209001",
		"parentid": "310230109000"
	},
	{
		"shortname": "育新村村委会",
		"id": "310151107001210001",
		"parentid": "310230109000"
	},
	{
		"shortname": "三协村村委会",
		"id": "310151107001211001",
		"parentid": "310230109000"
	},
	{
		"shortname": "西新村村委会",
		"id": "310151107001212001",
		"parentid": "310230109000"
	},
	{
		"shortname": "邻江村村委会",
		"id": "310151107001213001",
		"parentid": "310230109000"
	},
	{
		"shortname": "南桥村村委会",
		"id": "310151107001214001",
		"parentid": "310230109000"
	},
	{
		"shortname": "新安村村委会",
		"id": "310151107001215001",
		"parentid": "310230109000"
	},
	{
		"shortname": "永安村村委会",
		"id": "310151107001216001",
		"parentid": "310230109000"
	},
	{
		"shortname": "大平村村委会",
		"id": "310151107001217001",
		"parentid": "310230109000"
	},
	{
		"shortname": "海中村村委会",
		"id": "310151107001218001",
		"parentid": "310230109000"
	},
	{
		"shortname": "北桥村村委会",
		"id": "310151107001219001",
		"parentid": "310230109000"
	},
	{
		"shortname": "海滨村村委会",
		"id": "310151107001220001",
		"parentid": "310230109000"
	},
	{
		"shortname": "海安村村委会",
		"id": "310151107001221001",
		"parentid": "310230109000"
	}, {
		"shortname": "沿中居委会",
		"id": "310151108001001001",
		"parentid": "310230113000"
	},
	{
		"shortname": "建中村村委会",
		"id": "310151108001201001",
		"parentid": "310230113000"
	},
	{
		"shortname": "建华村村委会",
		"id": "310151108001202001",
		"parentid": "310230113000"
	},
	{
		"shortname": "港沿村村委会",
		"id": "310151108001203001",
		"parentid": "310230113000"
	},
	{
		"shortname": "齐力村村委会",
		"id": "310151108001204001",
		"parentid": "310230113000"
	},
	{
		"shortname": "跃马村村委会",
		"id": "310151108001205001",
		"parentid": "310230113000"
	},
	{
		"shortname": "骏马村村委会",
		"id": "310151108001206001",
		"parentid": "310230113000"
	},
	{
		"shortname": "富国村村委会",
		"id": "310151108001207001",
		"parentid": "310230113000"
	},
	{
		"shortname": "富强村村委会",
		"id": "310151108001208001",
		"parentid": "310230113000"
	},
	{
		"shortname": "惠中村村委会",
		"id": "310151108001209001",
		"parentid": "310230113000"
	},
	{
		"shortname": "富军村村委会",
		"id": "310151108001210001",
		"parentid": "310230113000"
	},
	{
		"shortname": "齐成村村委会",
		"id": "310151108001211001",
		"parentid": "310230113000"
	},
	{
		"shortname": "惠军村村委会",
		"id": "310151108001212001",
		"parentid": "310230113000"
	},
	{
		"shortname": "梅园村村委会",
		"id": "310151108001213001",
		"parentid": "310230113000"
	},
	{
		"shortname": "漾滨村村委会",
		"id": "310151108001214001",
		"parentid": "310230113000"
	},
	{
		"shortname": "合东村村委会",
		"id": "310151108001215001",
		"parentid": "310230113000"
	},
	{
		"shortname": "合兴村村委会",
		"id": "310151108001216001",
		"parentid": "310230113000"
	},
	{
		"shortname": "同滧村村委会",
		"id": "310151108001217001",
		"parentid": "310230113000"
	},
	{
		"shortname": "鲁东村村委会",
		"id": "310151108001218001",
		"parentid": "310230113000"
	},
	{
		"shortname": "鲁玙村村委会",
		"id": "310151108001219001",
		"parentid": "310230113000"
	},
	{
		"shortname": "园艺村村委会",
		"id": "310151108001220001",
		"parentid": "310230113000"
	},
	{
		"shortname": "同心村村委会",
		"id": "310151108001221001",
		"parentid": "310230113000"
	}, {
		"shortname": "广福居委会",
		"id": "310151109001001001",
		"parentid": "310230114000"
	},
	{
		"shortname": "七滧村村委会",
		"id": "310151109001201001",
		"parentid": "310230114000"
	},
	{
		"shortname": "爱国村村委会",
		"id": "310151109001202001",
		"parentid": "310230114000"
	},
	{
		"shortname": "红星村村委会",
		"id": "310151109001203001",
		"parentid": "310230114000"
	},
	{
		"shortname": "滧中村村委会",
		"id": "310151109001204001",
		"parentid": "310230114000"
	},
	{
		"shortname": "中兴村村委会",
		"id": "310151109001205001",
		"parentid": "310230114000"
	},
	{
		"shortname": "永南村村委会",
		"id": "310151109001206001",
		"parentid": "310230114000"
	},
	{
		"shortname": "胜利村村委会",
		"id": "310151109001207001",
		"parentid": "310230114000"
	},
	{
		"shortname": "北兴村村委会",
		"id": "310151109001208001",
		"parentid": "310230114000"
	},
	{
		"shortname": "汲浜村村委会",
		"id": "310151109001209001",
		"parentid": "310230114000"
	},
	{
		"shortname": "永隆村村委会",
		"id": "310151109001210001",
		"parentid": "310230114000"
	},
	{
		"shortname": "富圩村村委会",
		"id": "310151109001211001",
		"parentid": "310230114000"
	},
	{
		"shortname": "开港村村委会",
		"id": "310151109001212001",
		"parentid": "310230114000"
	}, {
		"shortname": "裕弘居委会",
		"id": "310151110001001001",
		"parentid": "310230115000"
	},
	{
		"shortname": "瀛陈居委会",
		"id": "310151110001002001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑居委会",
		"id": "310151110001003001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑第三社区居委会",
		"id": "310151110001004001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑第二社区居委会",
		"id": "310151110001005001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑第四社区居委会",
		"id": "310151110001006001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑第七社区居委会",
		"id": "310151110001007001",
		"parentid": "310230115000"
	},
	{
		"shortname": "立新村村委会",
		"id": "310151110001201001",
		"parentid": "310230115000"
	},
	{
		"shortname": "新桥村村委会",
		"id": "310151110001202001",
		"parentid": "310230115000"
	},
	{
		"shortname": "铁塔村村委会",
		"id": "310151110001203001",
		"parentid": "310230115000"
	},
	{
		"shortname": "东海村村委会",
		"id": "310151110001204001",
		"parentid": "310230115000"
	},
	{
		"shortname": "朝阳村村委会",
		"id": "310151110001205001",
		"parentid": "310230115000"
	},
	{
		"shortname": "陈南村村委会",
		"id": "310151110001206001",
		"parentid": "310230115000"
	},
	{
		"shortname": "瀛东村村委会",
		"id": "310151110001207001",
		"parentid": "310230115000"
	},
	{
		"shortname": "陈西村村委会",
		"id": "310151110001208001",
		"parentid": "310230115000"
	},
	{
		"shortname": "八滧村村委会",
		"id": "310151110001209001",
		"parentid": "310230115000"
	},
	{
		"shortname": "协隆村村委会",
		"id": "310151110001210001",
		"parentid": "310230115000"
	},
	{
		"shortname": "奚家港村村委会",
		"id": "310151110001211001",
		"parentid": "310230115000"
	},
	{
		"shortname": "花漂村村委会",
		"id": "310151110001212001",
		"parentid": "310230115000"
	},
	{
		"shortname": "晨光村村委会",
		"id": "310151110001213001",
		"parentid": "310230115000"
	},
	{
		"shortname": "德云村村委会",
		"id": "310151110001214001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕丰村村委会",
		"id": "310151110001215001",
		"parentid": "310230115000"
	},
	{
		"shortname": "先锋村村委会",
		"id": "310151110001216001",
		"parentid": "310230115000"
	},
	{
		"shortname": "鸿田村村委会",
		"id": "310151110001217001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕北村村委会",
		"id": "310151110001218001",
		"parentid": "310230115000"
	},
	{
		"shortname": "展宏村村委会",
		"id": "310151110001219001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕安村村委会",
		"id": "310151110001220001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕西村村委会",
		"id": "310151110001221001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑第五社区居委会（筹建）",
		"id": "310151110001801001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑第六社区居委会（筹建）",
		"id": "310151110001802001",
		"parentid": "310230115000"
	},
	{
		"shortname": "裕鸿佳苑第八社区居委会（筹建）",
		"id": "310151110001803001",
		"parentid": "310230115000"
	},
	{
		"shortname": "新绿居委会",
		"id": "310151111001001001",
		"parentid": "310230116000"
	},
	{
		"shortname": "绿湖村村委会",
		"id": "310151111001201001",
		"parentid": "310230116000"
	},
	{
		"shortname": "绿港村村委会",
		"id": "310151111001202001",
		"parentid": "310230116000"
	},
	{
		"shortname": "华星村村委会",
		"id": "310151111001203001",
		"parentid": "310230116000"
	},
	{
		"shortname": "华荣村村委会",
		"id": "310151111001204001",
		"parentid": "310230116000"
	},
	{
		"shortname": "绿园村村委会",
		"id": "310151111001205001",
		"parentid": "310230116000"
	},
	{
		"shortname": "华西村村委会",
		"id": "310151111001206001",
		"parentid": "310230116000"
	},
	{
		"shortname": "华渔村村委会",
		"id": "310151111001207001",
		"parentid": "310230116000"
	}, {
		"shortname": "双津村村委会",
		"id": "310151112001201001",
		"parentid": "310230118000"
	},
	{
		"shortname": "北双村村委会",
		"id": "310151112001202001",
		"parentid": "310230118000"
	},
	{
		"shortname": "盘西村村委会",
		"id": "310151112001203001",
		"parentid": "310230118000"
	},
	{
		"shortname": "协西村村委会",
		"id": "310151112001204001",
		"parentid": "310230118000"
	},
	{
		"shortname": "协北村村委会",
		"id": "310151112001205001",
		"parentid": "310230118000"
	},
	{
		"shortname": "新港村村委会",
		"id": "310151112001206001",
		"parentid": "310230118000"
	},
	{
		"shortname": "协兴村村委会",
		"id": "310151112001207001",
		"parentid": "310230118000"
	},
	{
		"shortname": "团结村村委会",
		"id": "310151112001208001",
		"parentid": "310230118000"
	},
	{
		"shortname": "富民村村委会",
		"id": "310151112001209001",
		"parentid": "310230118000"
	},
	{
		"shortname": "排衙村村委会",
		"id": "310151112001210001",
		"parentid": "310230118000"
	},
	{
		"shortname": "北闸村村委会",
		"id": "310151112001211001",
		"parentid": "310230118000"
	},
	{
		"shortname": "静南村村委会",
		"id": "310151112001212001",
		"parentid": "310230118000"
	}, {
		"shortname": "富安村村委会",
		"id": "310151113001201001",
		"parentid": "310230119000"
	},
	{
		"shortname": "虹桥村村委会",
		"id": "310151113001202001",
		"parentid": "310230119000"
	},
	{
		"shortname": "效东村村委会",
		"id": "310151113001203001",
		"parentid": "310230119000"
	},
	{
		"shortname": "建垦村村委会",
		"id": "310151113001204001",
		"parentid": "310230119000"
	},
	{
		"shortname": "运南村村委会",
		"id": "310151113001205001",
		"parentid": "310230119000"
	},
	{
		"shortname": "白钥村村委会",
		"id": "310151113001206001",
		"parentid": "310230119000"
	},
	{
		"shortname": "三星村村委会",
		"id": "310151113001207001",
		"parentid": "310230119000"
	},
	{
		"shortname": "界东村村委会",
		"id": "310151113001208001",
		"parentid": "310230119000"
	},
	{
		"shortname": "浜东村村委会",
		"id": "310151113001209001",
		"parentid": "310230119000"
	},
	{
		"shortname": "建设村村委会",
		"id": "310151113001210001",
		"parentid": "310230119000"
	},
	{
		"shortname": "蟠南村村委会",
		"id": "310151113001211001",
		"parentid": "310230119000"
	},
	{
		"shortname": "大同村村委会",
		"id": "310151113001212001",
		"parentid": "310230119000"
	},
	{
		"shortname": "浜西村村委会",
		"id": "310151113001213001",
		"parentid": "310230119000"
	},
	{
		"shortname": "跃进居委会",
		"id": "310151114001001001",
		"parentid": "310230121000"
	},
	{
		"shortname": "新海居委会",
		"id": "310151114001002001",
		"parentid": "310230121000"
	},
	{
		"shortname": "新海二村居委会",
		"id": "310151114001003001",
		"parentid": "310230121000"
	},
	{
		"shortname": "红星居委会",
		"id": "310151114001004001",
		"parentid": "310230121000"
	},
	{
		"shortname": "长征居委会",
		"id": "310151114001005001",
		"parentid": "310230121000"
	},
	{
		"shortname": "东风新村居委会",
		"id": "310151115001001001",
		"parentid": "310230122000"
	},
	{
		"shortname": "风伟新村居委会",
		"id": "310151115001002001",
		"parentid": "310230122000"
	},
	{
		"shortname": "桂林新村居委会",
		"id": "310151115001003001",
		"parentid": "310230122000"
	},
	{
		"shortname": "长江新村居委会",
		"id": "310151115001004001",
		"parentid": "310230122000"
	},
	{
		"shortname": "前进新村居委会",
		"id": "310151115001005001",
		"parentid": "310230122000"
	},
	{
		"shortname": "前哨新村居委会",
		"id": "310151115001006001",
		"parentid": "310230122000"
	}, {
		"shortname": "凤凰居委会",
		"id": "310151116001001001",
		"parentid": "310230123000"
	},
	{
		"shortname": "圆沙居委会",
		"id": "310151116001002001",
		"parentid": "310230123000"
	},
	{
		"shortname": "前卫新村居委会",
		"id": "310151116001003001",
		"parentid": "310230123000"
	},
	{
		"shortname": "滨江苑社区居委会",
		"id": "310151116001004001",
		"parentid": "310230123000"
	},
	{
		"shortname": "凤辰乐苑社区居委会",
		"id": "310151116001005001",
		"parentid": "310230123000"
	},
	{
		"shortname": "鹭岛华庭社区居委会",
		"id": "310151116001006001",
		"parentid": "310230123000"
	},
	{
		"shortname": "长兴家园社区居委会",
		"id": "310151116001007001",
		"parentid": "310230123000"
	},
	{
		"shortname": "海星村村委会",
		"id": "310151116001201001",
		"parentid": "310230123000"
	},
	{
		"shortname": "新建村村委会",
		"id": "310151116001202001",
		"parentid": "310230123000"
	},
	{
		"shortname": "合心村村委会",
		"id": "310151116001203001",
		"parentid": "310230123000"
	},
	{
		"shortname": "鼎丰村村委会",
		"id": "310151116001204001",
		"parentid": "310230123000"
	},
	{
		"shortname": "跃进村村委会",
		"id": "310151116001205001",
		"parentid": "310230123000"
	},
	{
		"shortname": "大兴村村委会",
		"id": "310151116001206001",
		"parentid": "310230123000"
	},
	{
		"shortname": "农建村村委会",
		"id": "310151116001207001",
		"parentid": "310230123000"
	},
	{
		"shortname": "圆东村村委会",
		"id": "310151116001208001",
		"parentid": "310230123000"
	},
	{
		"shortname": "同心村村委会",
		"id": "310151116001209001",
		"parentid": "310230123000"
	},
	{
		"shortname": "庆丰村村委会",
		"id": "310151116001210001",
		"parentid": "310230123000"
	},
	{
		"shortname": "长明村村委会",
		"id": "310151116001211001",
		"parentid": "310230123000"
	},
	{
		"shortname": "丰产村村委会",
		"id": "310151116001212001",
		"parentid": "310230123000"
	},
	{
		"shortname": "新港村村委会",
		"id": "310151116001213001",
		"parentid": "310230123000"
	},
	{
		"shortname": "先进村村委会",
		"id": "310151116001214001",
		"parentid": "310230123000"
	},
	{
		"shortname": "北兴村村委会",
		"id": "310151116001215001",
		"parentid": "310230123000"
	},
	{
		"shortname": "红星村村委会",
		"id": "310151116001216001",
		"parentid": "310230123000"
	},
	{
		"shortname": "团结村村委会",
		"id": "310151116001217001",
		"parentid": "310230123000"
	},
	{
		"shortname": "建新村村委会",
		"id": "310151116001218001",
		"parentid": "310230123000"
	},
	{
		"shortname": "石沙村村委会",
		"id": "310151116001219001",
		"parentid": "310230123000"
	},
	{
		"shortname": "先丰村村委会",
		"id": "310151116001220001",
		"parentid": "310230123000"
	},
	{
		"shortname": "光荣村村委会",
		"id": "310151116001221001",
		"parentid": "310230123000"
	},
	{
		"shortname": "长征村村委会",
		"id": "310151116001222001",
		"parentid": "310230123000"
	},
	{
		"shortname": "潘石村村委会",
		"id": "310151116001223001",
		"parentid": "310230123000"
	},
	{
		"shortname": "创建村村委会",
		"id": "310151116001224001",
		"parentid": "310230123000"
	}, {
		"shortname": "新中村村委会",
		"id": "310151201001201001",
		"parentid": "310230201000"
	},
	{
		"shortname": "新卫村村委会",
		"id": "310151201001202001",
		"parentid": "310230201000"
	},
	{
		"shortname": "新乐村村委会",
		"id": "310151201001203001",
		"parentid": "310230201000"
	},
	{
		"shortname": "新浜村村委会",
		"id": "310151201001204001",
		"parentid": "310230201000"
	},
	{
		"shortname": "新国村村委会",
		"id": "310151201001205001",
		"parentid": "310230201000"
	},
	{
		"shortname": "新洲村村委会",
		"id": "310151201001206001",
		"parentid": "310230201000"
	}, {
		"shortname": "新民居委会",
		"id": "310151202001001001",
		"parentid": "310230203000"
	},
	{
		"shortname": "兴胜村村委会",
		"id": "310151202001201001",
		"parentid": "310230203000"
	},
	{
		"shortname": "增产村村委会",
		"id": "310151202001202001",
		"parentid": "310230203000"
	},
	{
		"shortname": "公平村村委会",
		"id": "310151202001203001",
		"parentid": "310230203000"
	},
	{
		"shortname": "红旗村村委会",
		"id": "310151202001204001",
		"parentid": "310230203000"
	},
	{
		"shortname": "东浜村村委会",
		"id": "310151202001205001",
		"parentid": "310230203000"
	},
	{
		"shortname": "新北村村委会",
		"id": "310151202001206001",
		"parentid": "310230203000"
	},
	{
		"shortname": "兴隆村村委会",
		"id": "310151202001207001",
		"parentid": "310230203000"
	},
	{
		"shortname": "丰乐村村委会",
		"id": "310151202001208001",
		"parentid": "310230203000"
	},
	{
		"shortname": "新春村村委会",
		"id": "310151202001209001",
		"parentid": "310230203000"
	},
	{
		"shortname": "东兴村村委会",
		"id": "310151202001210001",
		"parentid": "310230203000"
	},
	{
		"shortname": "新联村村委会",
		"id": "310151202001211001",
		"parentid": "310230203000"
	},
	{
		"shortname": "惠丰村村委会",
		"id": "310151202001212001",
		"parentid": "310230203000"
	},
	{
		"shortname": "新永村村委会",
		"id": "310151202001213001",
		"parentid": "310230203000"
	},
	{
		"shortname": "民建村村委会",
		"id": "310151202001214001",
		"parentid": "310230203000"
	},
	{
		"shortname": "民生村村委会",
		"id": "310151202001215001",
		"parentid": "310230203000"
	},
	{
		"shortname": "永发村村委会",
		"id": "310151202001216001",
		"parentid": "310230203000"
	},
	{
		"shortname": "富民村村委会",
		"id": "310151202001217001",
		"parentid": "310230203000"
	},
	{
		"shortname": "永胜村村委会",
		"id": "310151202001218001",
		"parentid": "310230203000"
	},
	{
		"shortname": "东海村村委会",
		"id": "310151202001219001",
		"parentid": "310230203000"
	},
	{
		"shortname": "民星村村委会",
		"id": "310151202001220001",
		"parentid": "310230203000"
	},
	{
		"shortname": "江海村村委会",
		"id": "310151202001221001",
		"parentid": "310230203000"
	},
	{
		"shortname": "民永村村委会",
		"id": "310151202001222001",
		"parentid": "310230203000"
	},
	{
		"shortname": "民东村村委会",
		"id": "310151202001223001",
		"parentid": "310230203000"
	},
	{
		"shortname": "海鸿村村委会",
		"id": "310151202001224001",
		"parentid": "310230203000"
	}
]

// 省份
var province = [{
		"id": '310000',
		"shortname": '上海市',
		"parentid": ''
	}, {
		"id": '110000',
		"shortname": '北京市',
		"parentid": ''
	},
	{
		"id": '120000',
		"shortname": '天津市',
		"parentid": ''
	}, {
		"id": '500000',
		"shortname": '重庆市',
		"parentid": ''
	},
	{
		"id": '130000',
		"shortname": '河北省',
		"parentid": ''
	}, {
		"id": '140000',
		"shortname": '山西省',
		"parentid": ''
	},
	{
		"id": '210000',
		"shortname": '辽宁省',
		"parentid": ''
	}, {
		"id": '220000',
		"shortname": '吉林省',
		"parentid": ''
	},
	{
		"id": '230000',
		"shortname": '黑龙江省',
		"parentid": ''
	}, {
		"id": '320000',
		"shortname": '江苏省',
		"parentid": ''
	},
	{
		"id": '330000',
		"shortname": '浙江省',
		"parentid": ''
	}, {
		"id": '340000',
		"shortname": '安徽省',
		"parentid": ''
	},
	{
		"id": '350000',
		"shortname": '福建省',
		"parentid": ''
	}, {
		"id": '360000',
		"shortname": '江西省',
		"parentid": ''
	},
	{
		"id": '370000',
		"shortname": '山东省',
		"parentid": ''
	}, {
		"id": '410000',
		"shortname": '河南省',
		"parentid": ''
	},
	{
		"id": '420000',
		"shortname": '湖北省',
		"parentid": ''
	}, {
		"id": '430000',
		"shortname": '湖南省',
		"parentid": ''
	},
	{
		"id": '440000',
		"shortname": '广东省',
		"parentid": ''
	}, {
		"id": '460000',
		"shortname": '海南省',
		"parentid": ''
	},
	{
		"id": '510000',
		"shortname": '四川省',
		"parentid": ''
	}, {
		"id": '520000',
		"shortname": '贵州省',
		"parentid": ''
	},
	{
		"id": '610000',
		"shortname": '陕西省',
		"parentid": ''
	}, {
		"id": '620000',
		"shortname": '甘肃省',
		"parentid": ''
	},
	{
		"id": '630000',
		"shortname": '青海省',
		"parentid": ''
	}, {
		"id": '530000',
		"shortname": '云南省',
		"parentid": ''
	},
	{
		"id": '150000',
		"shortname": '内蒙古自治区',
		"parentid": ''
	}, {
		"id": '450000',
		"shortname": '广西壮族自治区',
		"parentid": ''
	},
	{
		"id": '540000',
		"shortname": '西藏自治区',
		"parentid": ''
	}, {
		"id": '640000',
		"shortname": '宁夏回族自治区',
		"parentid": ''
	},
	{
		"id": '650000',
		"shortname": '新疆维吾尔自治区',
		"parentid": ''
	}
];

// 市
var city = [{
		"id": '119900',
		"shortname": '北京市',
		"parentid": '110000'
	}, {
		"id": '129900',
		"shortname": '天津市',
		"parentid": '120000'
	}, {
		"id": '130100',
		"shortname": '石家庄市',
		"parentid": '130000'
	}, {
		"id": '130200',
		"shortname": '唐山市',
		"parentid": '130000'
	}, {
		"id": '130300',
		"shortname": '秦皇岛市',
		"parentid": '130000'
	}, {
		"id": '130400',
		"shortname": '邯郸市',
		"parentid": '130000'
	}, {
		"id": '130600',
		"shortname": '保定市',
		"parentid": '130000'
	}, {
		"id": '130700',
		"shortname": '张家口市',
		"parentid": '130000'
	},
	{
		"id": '130800',
		"shortname": '承德市',
		"parentid": '130000'
	}, {
		"id": '130900',
		"shortname": '沧州市',
		"parentid": '130000'
	}, {
		"id": '131000',
		"shortname": '廊坊市',
		"parentid": '130000'
	}, {
		"id": '131100',
		"shortname": '衡水市',
		"parentid": '130000'
	}, {
		"id": '130500',
		"shortname": '邢台市',
		"parentid": '130000'
	}, {
		"id": '140100',
		"shortname": '太原市',
		"parentid": '140000'
	}, {
		"id": '140200',
		"shortname": '大同市',
		"parentid": '140000'
	}, {
		"id": '140300',
		"shortname": '阳泉市',
		"parentid": '140000'
	}, {
		"id": '140400',
		"shortname": '长治市',
		"parentid": '140000'
	}, {
		"id": '140500',
		"shortname": '晋城市',
		"parentid": '140000'
	}, {
		"id": '140600',
		"shortname": '朔州市',
		"parentid": '140000'
	}, {
		"id": '140700',
		"shortname": '晋中市',
		"parentid": '140000'
	}, {
		"id": '140800',
		"shortname": '运城市',
		"parentid": '140000'
	}, {
		"id": '140900',
		"shortname": '忻州市',
		"parentid": '140000'
	}, {
		"id": '141000',
		"shortname": '临汾市',
		"parentid": '140000'
	}, {
		"id": '141100',
		"shortname": '吕梁市',
		"parentid": '140000'
	}, {
		"id": '150800',
		"shortname": '巴彦淖尔市',
		"parentid": '150000'
	}, {
		"id": '150900',
		"shortname": '乌兰察布市',
		"parentid": '150000'
	}, {
		"id": '152200',
		"shortname": '兴安盟',
		"parentid": '150000'
	}, {
		"id": '152500',
		"shortname": '锡林郭勒盟',
		"parentid": '150000'
	}, {
		"id": '152900',
		"shortname": '阿拉善盟',
		"parentid": '150000'
	}, {
		"id": '150100',
		"shortname": '呼和浩特市',
		"parentid": '150000'
	}, {
		"id": '150200',
		"shortname": '包头市',
		"parentid": '150000'
	}, {
		"id": '150300',
		"shortname": '乌海市',
		"parentid": '150000'
	}, {
		"id": '150400',
		"shortname": '赤峰市',
		"parentid": '150000'
	}, {
		"id": '150500',
		"shortname": '通辽市',
		"parentid": '150000'
	}, {
		"id": '150600',
		"shortname": '鄂尔多斯市',
		"parentid": '150000'
	}, {
		"id": '150700',
		"shortname": '呼伦贝尔市',
		"parentid": '150000'
	}, {
		"id": '210200',
		"shortname": '大连市',
		"parentid": '210000'
	}, {
		"id": '210300',
		"shortname": '鞍山市',
		"parentid": '210000'
	}, {
		"id": '210400',
		"shortname": '抚顺市',
		"parentid": '210000'
	}, {
		"id": '210500',
		"shortname": '本溪市',
		"parentid": '210000'
	}, {
		"id": '210600',
		"shortname": '丹东市',
		"parentid": '210000'
	}, {
		"id": '210700',
		"shortname": '锦州市',
		"parentid": '210000'
	}, {
		"id": '210800',
		"shortname": '营口市',
		"parentid": '210000'
	}, {
		"id": '210900',
		"shortname": '阜新市',
		"parentid": '210000'
	}, {
		"id": '211000',
		"shortname": '辽阳市',
		"parentid": '210000'
	}, {
		"id": '211100',
		"shortname": '盘锦市',
		"parentid": '210000'
	}, {
		"id": '211200',
		"shortname": '铁岭市',
		"parentid": '210000'
	}, {
		"id": '211300',
		"shortname": '朝阳市',
		"parentid": '210000'
	}, {
		"id": '211400',
		"shortname": '葫芦岛市',
		"parentid": '210000'
	}, {
		"id": '210100',
		"shortname": '沈阳市',
		"parentid": '210000'
	}, {
		"id": '220100',
		"shortname": '长春市',
		"parentid": '220000'
	}, {
		"id": '220200',
		"shortname": '吉林市',
		"parentid": '220000'
	}, {
		"id": '220300',
		"shortname": '四平市',
		"parentid": '220000'
	}, {
		"id": '220400',
		"shortname": '辽源市',
		"parentid": '220000'
	}, {
		"id": '220500',
		"shortname": '通化市',
		"parentid": '220000'
	}, {
		"id": '220600',
		"shortname": '白山市',
		"parentid": '220000'
	}, {
		"id": '220700',
		"shortname": '松原市',
		"parentid": '220000'
	}, {
		"id": '220800',
		"shortname": '白城市',
		"parentid": '220000'
	}, {
		"id": '222200',
		"shortname": '长白山管委会',
		"parentid": '220000'
	}, {
		"id": '222400',
		"shortname": '延边朝鲜族自治州',
		"parentid": '220000'
	}, {
		"id": '230200',
		"shortname": '齐齐哈尔市',
		"parentid": '230000'
	}, {
		"id": '230300',
		"shortname": '鸡西市',
		"parentid": '230000'
	}, {
		"id": '230400',
		"shortname": '鹤岗市',
		"parentid": '230000'
	}, {
		"id": '230500',
		"shortname": '双鸭山市',
		"parentid": '230000'
	}, {
		"id": '230600',
		"shortname": '大庆市',
		"parentid": '230000'
	}, {
		"id": '230700',
		"shortname": '伊春市',
		"parentid": '230000'
	}, {
		"id": '230800',
		"shortname": '佳木斯市',
		"parentid": '230000'
	}, {
		"id": '230900',
		"shortname": '七台河市',
		"parentid": '230000'
	}, {
		"id": '231000',
		"shortname": '牡丹江市',
		"parentid": '230000'
	}, {
		"id": '231100',
		"shortname": '黑河市',
		"parentid": '230000'
	}, {
		"id": '231200',
		"shortname": '绥化市',
		"parentid": '230000'
	}, {
		"id": '232700',
		"shortname": '大兴安岭地区',
		"parentid": '230000'
	}, {
		"id": '232800',
		"shortname": '省森工地区',
		"parentid": '230000'
	}, {
		"id": '232900',
		"shortname": '省农垦总局',
		"parentid": '230000'
	}, {
		"id": '230100',
		"shortname": '哈尔滨市',
		"parentid": '230000'
	}, {
		"id": '310000000000',
		"shortname": '上海市',
		"parentid": '310000'
	}, {
		"id": '321200',
		"shortname": '泰州市',
		"parentid": '320000'
	}, {
		"id": '321300',
		"shortname": '宿迁市',
		"parentid": '320000'
	}, {
		"id": '320100',
		"shortname": '南京市',
		"parentid": '320000'
	}, {
		"id": '320200',
		"shortname": '无锡市',
		"parentid": '320000'
	}, {
		"id": '320300',
		"shortname": '徐州市',
		"parentid": '320000'
	}, {
		"id": '320400',
		"shortname": '常州市',
		"parentid": '320000'
	}, {
		"id": '320500',
		"shortname": '苏州市',
		"parentid": '320000'
	}, {
		"id": '320600',
		"shortname": '南通市',
		"parentid": '320000'
	}, {
		"id": '320700',
		"shortname": '连云港市',
		"parentid": '320000'
	}, {
		"id": '320800',
		"shortname": '淮安市',
		"parentid": '320000'
	}, {
		"id": '320900',
		"shortname": '盐城市',
		"parentid": '320000'
	}, {
		"id": '321000',
		"shortname": '扬州市',
		"parentid": '320000'
	}, {
		"id": '321100',
		"shortname": '镇江市',
		"parentid": '320000'
	}, {
		"id": '330100',
		"shortname": '杭州市',
		"parentid": '330000'
	}, {
		"id": '330300',
		"shortname": '温州市',
		"parentid": '330000'
	}, {
		"id": '330400',
		"shortname": '嘉兴市',
		"parentid": '330000'
	}, {
		"id": '330500',
		"shortname": '湖州市',
		"parentid": '330000'
	}, {
		"id": '330600',
		"shortname": '绍兴市',
		"parentid": '330000'
	}, {
		"id": '330700',
		"shortname": '金华市',
		"parentid": '330000'
	}, {
		"id": '330800',
		"shortname": '衢州市',
		"parentid": '330000'
	}, {
		"id": '330900',
		"shortname": '舟山市',
		"parentid": '330000'
	}, {
		"id": '331100',
		"shortname": '丽水市',
		"parentid": '330000'
	}, {
		"id": '330200',
		"shortname": '宁波市',
		"parentid": '330000'
	}, {
		"id": '331000',
		"shortname": '台州市',
		"parentid": '330000'
	}, {
		"id": '340100',
		"shortname": '合肥市',
		"parentid": '340000'
	}, {
		"id": '340200',
		"shortname": '芜湖市',
		"parentid": '340000'
	}, {
		"id": '340300',
		"shortname": '蚌埠市',
		"parentid": '340000'
	}, {
		"id": '340400',
		"shortname": '淮南市',
		"parentid": '340000'
	}, {
		"id": '340500',
		"shortname": '马鞍山市',
		"parentid": '340000'
	}, {
		"id": '340600',
		"shortname": '淮北市',
		"parentid": '340000'
	}, {
		"id": '340700',
		"shortname": '铜陵市',
		"parentid": '340000'
	}, {
		"id": '340800',
		"shortname": '安庆市',
		"parentid": '340000'
	}, {
		"id": '341000',
		"shortname": '黄山市',
		"parentid": '340000'
	}, {
		"id": '341100',
		"shortname": '滁州市',
		"parentid": '340000'
	}, {
		"id": '341200',
		"shortname": '阜阳市',
		"parentid": '340000'
	}, {
		"id": '341300',
		"shortname": '宿州市',
		"parentid": '340000'
	}, {
		"id": '341400',
		"shortname": '巢湖市',
		"parentid": '340000'
	}, {
		"id": '341500',
		"shortname": '六安市',
		"parentid": '340000'
	}, {
		"id": '341600',
		"shortname": '亳州市',
		"parentid": '340000'
	}, {
		"id": '341700',
		"shortname": '池州市',
		"parentid": '340000'
	}, {
		"id": '341800',
		"shortname": '宣城市',
		"parentid": '340000'
	}, {
		"id": '350100',
		"shortname": '福州市',
		"parentid": '350000'
	}, {
		"id": '350200',
		"shortname": '厦门市',
		"parentid": '350000'
	}, {
		"id": '350300',
		"shortname": '莆田市',
		"parentid": '350000'
	}, {
		"id": '350400',
		"shortname": '三明市',
		"parentid": '350000'
	}, {
		"id": '350500',
		"shortname": '泉州市',
		"parentid": '350000'
	}, {
		"id": '350600',
		"shortname": '漳州市',
		"parentid": '350000'
	}, {
		"id": '350700',
		"shortname": '南平市',
		"parentid": '350000'
	}, {
		"id": '350800',
		"shortname": '龙岩市',
		"parentid": '350000'
	}, {
		"id": '350900',
		"shortname": '宁德市',
		"parentid": '350000'
	}, {
		"id": '360100',
		"shortname": '南昌市',
		"parentid": '360000'
	}, {
		"id": '360200',
		"shortname": '景德镇市',
		"parentid": '360000'
	}, {
		"id": '360300',
		"shortname": '萍乡市',
		"parentid": '360000'
	}, {
		"id": '360400',
		"shortname": '九江市',
		"parentid": '360000'
	}, {
		"id": '360500',
		"shortname": '新余市',
		"parentid": '360000'
	}, {
		"id": '360600',
		"shortname": '鹰潭市',
		"parentid": '360000'
	}, {
		"id": '360700',
		"shortname": '赣州市',
		"parentid": '360000'
	}, {
		"id": '360800',
		"shortname": '吉安市',
		"parentid": '360000'
	}, {
		"id": '360900',
		"shortname": '宜春市',
		"parentid": '360000'
	}, {
		"id": '361000',
		"shortname": '抚州市',
		"parentid": '360000'
	}, {
		"id": '361100',
		"shortname": '上饶市',
		"parentid": '360000'
	}, {
		"id": '370100',
		"shortname": '济南市',
		"parentid": '370000'
	}, {
		"id": '370200',
		"shortname": '青岛市',
		"parentid": '370000'
	}, {
		"id": '370300',
		"shortname": '淄博市',
		"parentid": '370000'
	}, {
		"id": '370400',
		"shortname": '枣庄市',
		"parentid": '370000'
	}, {
		"id": '370500',
		"shortname": '东营市',
		"parentid": '370000'
	}, {
		"id": '370600',
		"shortname": '烟台市',
		"parentid": '370000'
	}, {
		"id": '370700',
		"shortname": '潍坊市',
		"parentid": '370000'
	}, {
		"id": '370800',
		"shortname": '济宁市',
		"parentid": '370000'
	}, {
		"id": '370900',
		"shortname": '泰安市',
		"parentid": '370000'
	}, {
		"id": '371000',
		"shortname": '威海市',
		"parentid": '370000'
	}, {
		"id": '371100',
		"shortname": '日照市',
		"parentid": '370000'
	}, {
		"id": '371200',
		"shortname": '莱芜市',
		"parentid": '370000'
	}, {
		"id": '371300',
		"shortname": '临沂市',
		"parentid": '370000'
	}, {
		"id": '371400',
		"shortname": '德州市',
		"parentid": '370000'
	}, {
		"id": '371500',
		"shortname": '聊城市',
		"parentid": '370000'
	}, {
		"id": '371600',
		"shortname": '滨州市',
		"parentid": '370000'
	}, {
		"id": '371700',
		"shortname": '菏泽市',
		"parentid": '370000'
	}, {
		"id": '410700',
		"shortname": '新乡市',
		"parentid": '410000'
	}, {
		"id": '410100',
		"shortname": '郑州市',
		"parentid": '410000'
	}, {
		"id": '410200',
		"shortname": '开封市',
		"parentid": '410000'
	}, {
		"id": '410300',
		"shortname": '洛阳市',
		"parentid": '410000'
	}, {
		"id": '410400',
		"shortname": '平顶山市',
		"parentid": '410000'
	}, {
		"id": '410500',
		"shortname": '安阳市',
		"parentid": '410000'
	}, {
		"id": '410600',
		"shortname": '鹤壁市',
		"parentid": '410000'
	}, {
		"id": '410900',
		"shortname": '濮阳市',
		"parentid": '410000'
	}, {
		"id": '411000',
		"shortname": '许昌市',
		"parentid": '410000'
	}, {
		"id": '411100',
		"shortname": '漯河市',
		"parentid": '410000'
	}, {
		"id": '411200',
		"shortname": '三门峡市',
		"parentid": '410000'
	}, {
		"id": '411300',
		"shortname": '南阳市',
		"parentid": '410000'
	}, {
		"id": '411400',
		"shortname": '商丘市',
		"parentid": '410000'
	}, {
		"id": '411500',
		"shortname": '信阳市',
		"parentid": '410000'
	}, {
		"id": '411600',
		"shortname": '周口市',
		"parentid": '410000'
	}, {
		"id": '411700',
		"shortname": '驻马店市',
		"parentid": '410000'
	}, {
		"id": '411800',
		"shortname": '济源市',
		"parentid": '410000'
	}, {
		"id": '410800',
		"shortname": '焦作市',
		"parentid": '410000'
	}, {
		"id": '420600',
		"shortname": '襄阳市',
		"parentid": '420000'
	}, {
		"id": '429000',
		"shortname": '省直辖县级行政区划',
		"parentid": '420000'
	}, {
		"id": '420100',
		"shortname": '武汉市',
		"parentid": '420000'
	}, {
		"id": '420200',
		"shortname": '黄石市',
		"parentid": '420000'
	}, {
		"id": '420300',
		"shortname": '十堰市',
		"parentid": '420000'
	}, {
		"id": '420500',
		"shortname": '宜昌市',
		"parentid": '420000'
	}, {
		"id": '420700',
		"shortname": '鄂州市',
		"parentid": '420000'
	}, {
		"id": '420800',
		"shortname": '荆门市',
		"parentid": '420000'
	}, {
		"id": '420900',
		"shortname": '孝感市',
		"parentid": '420000'
	}, {
		"id": '421000',
		"shortname": '荆州市',
		"parentid": '420000'
	}, {
		"id": '421100',
		"shortname": '黄冈市',
		"parentid": '420000'
	}, {
		"id": '421200',
		"shortname": '咸宁市',
		"parentid": '420000'
	}, {
		"id": '421300',
		"shortname": '随州市',
		"parentid": '420000'
	}, {
		"id": '422800',
		"shortname": '恩施土家族苗族自治州',
		"parentid": '420000'
	}, {
		"id": '430500',
		"shortname": '邵阳市',
		"parentid": '430000'
	}, {
		"id": '430600',
		"shortname": '岳阳市',
		"parentid": '430000'
	}, {
		"id": '430700',
		"shortname": '常德市',
		"parentid": '430000'
	}, {
		"id": '430800',
		"shortname": '张家界市',
		"parentid": '430000'
	}, {
		"id": '430900',
		"shortname": '益阳市',
		"parentid": '430000'
	}, {
		"id": '431000',
		"shortname": '郴州市',
		"parentid": '430000'
	}, {
		"id": '431100',
		"shortname": '永州市',
		"parentid": '430000'
	},
	{
		"id": '431200',
		"shortname": '怀化市',
		"parentid": '430000'
	}, {
		"id": '431300',
		"shortname": '娄底市',
		"parentid": '430000'
	}, {
		"id": '433100',
		"shortname": '湘西土家族苗族自治州',
		"parentid": '430000'
	}, {
		"id": '430100',
		"shortname": '长沙市',
		"parentid": '430000'
	}, {
		"id": '430200',
		"shortname": '株洲市',
		"parentid": '430000'
	}, {
		"id": '430300',
		"shortname": '湘潭市',
		"parentid": '430000'
	}, {
		"id": '430400',
		"shortname": '衡阳市',
		"parentid": '430000'
	}, {
		"id": '440100',
		"shortname": '广州市',
		"parentid": '440000'
	}, {
		"id": '440200',
		"shortname": '韶关市',
		"parentid": '440000'
	}, {
		"id": '440300',
		"shortname": '深圳市',
		"parentid": '440000'
	}, {
		"id": '440400',
		"shortname": '珠海市',
		"parentid": '440000'
	}, {
		"id": '440500',
		"shortname": '汕头市',
		"parentid": '440000'
	}, {
		"id": '440600',
		"shortname": '佛山市',
		"parentid": '440000'
	}, {
		"id": '440700',
		"shortname": '江门市',
		"parentid": '440000'
	}, {
		"id": '440800',
		"shortname": '湛江市',
		"parentid": '440000'
	}, {
		"id": '440900',
		"shortname": '茂名市',
		"parentid": '440000'
	}, {
		"id": '441200',
		"shortname": '肇庆市',
		"parentid": '440000'
	}, {
		"id": '441300',
		"shortname": '惠州市',
		"parentid": '440000'
	}, {
		"id": '441400',
		"shortname": '梅州市',
		"parentid": '440000'
	}, {
		"id": '441500',
		"shortname": '汕尾市',
		"parentid": '440000'
	}, {
		"id": '441600',
		"shortname": '河源市',
		"parentid": '440000'
	}, {
		"id": '441700',
		"shortname": '阳江市',
		"parentid": '440000'
	}, {
		"id": '441800',
		"shortname": '清远市',
		"parentid": '440000'
	}, {
		"id": '441900',
		"shortname": '东莞市',
		"parentid": '440000'
	}, {
		"id": '442000',
		"shortname": '中山市',
		"parentid": '440000'
	}, {
		"id": '445100',
		"shortname": '潮州市',
		"parentid": '440000'
	}, {
		"id": '445200',
		"shortname": '揭阳市',
		"parentid": '440000'
	}, {
		"id": '445300',
		"shortname": '云浮市',
		"parentid": '440000'
	}, {
		"id": '450100',
		"shortname": '南宁市',
		"parentid": '450000'
	}, {
		"id": '450200',
		"shortname": '柳州市',
		"parentid": '450000'
	}, {
		"id": '450300',
		"shortname": '桂林市',
		"parentid": '450000'
	}, {
		"id": '450400',
		"shortname": '梧州市',
		"parentid": '450000'
	}, {
		"id": '450500',
		"shortname": '北海市',
		"parentid": '450000'
	}, {
		"id": '450600',
		"shortname": '防城港市',
		"parentid": '450000'
	}, {
		"id": '450700',
		"shortname": '钦州市',
		"parentid": '450000'
	}, {
		"id": '450800',
		"shortname": '贵港市',
		"parentid": '450000'
	}, {
		"id": '450900',
		"shortname": '玉林市',
		"parentid": '450000'
	}, {
		"id": '451000',
		"shortname": '百色市',
		"parentid": '450000'
	}, {
		"id": '451100',
		"shortname": '贺州市',
		"parentid": '450000'
	}, {
		"id": '451200',
		"shortname": '河池市',
		"parentid": '450000'
	}, {
		"id": '451300',
		"shortname": '来宾市',
		"parentid": '450000'
	}, {
		"id": '451400',
		"shortname": '崇左市',
		"parentid": '450000'
	}, {
		"id": '460100',
		"shortname": '海口市',
		"parentid": '460000'
	}, {
		"id": '460200',
		"shortname": '三亚市',
		"parentid": '460000'
	}, {
		"id": '462000',
		"shortname": '洋浦经济开发区',
		"parentid": '460000'
	}, {
		"id": '462100',
		"shortname": '省农垦',
		"parentid": '460000'
	}, {
		"id": '469000',
		"shortname": '省直辖县级行政区划',
		"parentid": '460000'
	}, {
		"id": '509900',
		"shortname": '重庆市',
		"parentid": '500000'
	}, {
		"id": '511000',
		"shortname": '内江市',
		"parentid": '510000'
	}, {
		"id": '511100',
		"shortname": '乐山市',
		"parentid": '510000'
	}, {
		"id": '511300',
		"shortname": '南充市',
		"parentid": '510000'
	}, {
		"id": '511400',
		"shortname": '眉山市',
		"parentid": '510000'
	}, {
		"id": '511500',
		"shortname": '宜宾市',
		"parentid": '510000'
	}, {
		"id": '511600',
		"shortname": '广安市',
		"parentid": '510000'
	}, {
		"id": '511700',
		"shortname": '达州市',
		"parentid": '510000'
	}, {
		"id": '511800',
		"shortname": '雅安市',
		"parentid": '510000'
	}, {
		"id": '511900',
		"shortname": '巴中市',
		"parentid": '510000'
	}, {
		"id": '512000',
		"shortname": '资阳市',
		"parentid": '510000'
	}, {
		"id": '513200',
		"shortname": '阿坝藏族羌族自治州',
		"parentid": '510000'
	}, {
		"id": '513300',
		"shortname": '甘孜藏族自治州',
		"parentid": '510000'
	}, {
		"id": '513400',
		"shortname": '凉山彝族自治州',
		"parentid": '510000'
	}, {
		"id": '510100',
		"shortname": '成都市',
		"parentid": '510000'
	}, {
		"id": '510300',
		"shortname": '自贡市',
		"parentid": '510000'
	}, {
		"id": '510400',
		"shortname": '攀枝花市',
		"parentid": '510000'
	}, {
		"id": '510500',
		"shortname": '泸州市',
		"parentid": '510000'
	}, {
		"id": '510600',
		"shortname": '德阳市',
		"parentid": '510000'
	}, {
		"id": '510700',
		"shortname": '绵阳市',
		"parentid": '510000'
	}, {
		"id": '510800',
		"shortname": '广元市',
		"parentid": '510000'
	}, {
		"id": '510900',
		"shortname": '遂宁市',
		"parentid": '510000'
	}, {
		"id": '520100',
		"shortname": '贵阳市',
		"parentid": '520000'
	}, {
		"id": '520200',
		"shortname": '六盘水市',
		"parentid": '520000'
	}, {
		"id": '520300',
		"shortname": '遵义市',
		"parentid": '520000'
	}, {
		"id": '520400',
		"shortname": '安顺市',
		"parentid": '520000'
	}, {
		"id": '522200',
		"shortname": '铜仁地区',
		"parentid": '520000'
	}, {
		"id": '522300',
		"shortname": '黔西南布依族苗族自治州',
		"parentid": '520000'
	}, {
		"id": '522600',
		"shortname": '黔东南苗族侗族自治州',
		"parentid": '520000'
	}, {
		"id": '522700',
		"shortname": '黔南布依族苗族自治州',
		"parentid": '520000'
	}, {
		"id": '522400',
		"shortname": '毕节地区',
		"parentid": '520000'
	}, {
		"id": '532300',
		"shortname": '楚雄彝族自治州',
		"parentid": '530000'
	}, {
		"id": '530700',
		"shortname": '丽江市',
		"parentid": '530000'
	}, {
		"id": '530800',
		"shortname": '普洱市',
		"parentid": '530000'
	}, {
		"id": '530900',
		"shortname": '临沧市',
		"parentid": '530000'
	}, {
		"id": '530100',
		"shortname": '昆明市',
		"parentid": '530000'
	}, {
		"id": '530300',
		"shortname": '曲靖市',
		"parentid": '530000'
	}, {
		"id": '530400',
		"shortname": '玉溪市',
		"parentid": '530000'
	}, {
		"id": '530500',
		"shortname": '保山市',
		"parentid": '530000'
	}, {
		"id": '530600',
		"shortname": '昭通市',
		"parentid": '530000'
	}, {
		"id": '532500',
		"shortname": '红河哈尼族彝族自治州',
		"parentid": '530000'
	}, {
		"id": '532600',
		"shortname": '文山壮族苗族自治州',
		"parentid": '530000'
	}, {
		"id": '532800',
		"shortname": '西双版纳傣族自治州',
		"parentid": '530000'
	}, {
		"id": '532900',
		"shortname": '大理白族自治州',
		"parentid": '530000'
	}, {
		"id": '533100',
		"shortname": '德宏傣族景颇族自治州',
		"parentid": '530000'
	}, {
		"id": '533300',
		"shortname": '怒江傈僳族自治州',
		"parentid": '530000'
	}, {
		"id": '533400',
		"shortname": '迪庆藏族自治州',
		"parentid": '530000'
	}, {
		"id": '540100',
		"shortname": '拉萨市',
		"parentid": '540000'
	}, {
		"id": '542100',
		"shortname": '昌都地区',
		"parentid": '540000'
	}, {
		"id": '542200',
		"shortname": '山南地区',
		"parentid": '540000'
	}, {
		"id": '542300',
		"shortname": '日喀则地区',
		"parentid": '540000'
	}, {
		"id": '542400',
		"shortname": '那曲地区',
		"parentid": '540000'
	}, {
		"id": '542500',
		"shortname": '阿里地区',
		"parentid": '540000'
	}, {
		"id": '542600',
		"shortname": '林芝地区',
		"parentid": '540000'
	}, {
		"id": '610300',
		"shortname": '宝鸡市',
		"parentid": '610000'
	}, {
		"id": '610400',
		"shortname": '咸阳市',
		"parentid": '610000'
	}, {
		"id": '610500',
		"shortname": '渭南市',
		"parentid": '610000'
	}, {
		"id": '610600',
		"shortname": '延安市',
		"parentid": '610000'
	}, {
		"id": '610700',
		"shortname": '汉中市',
		"parentid": '610000'
	}, {
		"id": '610800',
		"shortname": '榆林市',
		"parentid": '610000'
	}, {
		"id": '610900',
		"shortname": '安康市',
		"parentid": '610000'
	}, {
		"id": '611000',
		"shortname": '商洛市',
		"parentid": '610000'
	}, {
		"id": '610100',
		"shortname": '西安市',
		"parentid": '610000'
	}, {
		"id": '610200',
		"shortname": '铜川市',
		"parentid": '610000'
	}, {
		"id": '611100',
		"shortname": '杨凌示范区',
		"parentid": '610000'
	}, {
		"id": '620100',
		"shortname": '兰州市',
		"parentid": '620000'
	}, {
		"id": '620200',
		"shortname": '嘉峪关市',
		"parentid": '620000'
	}, {
		"id": '620300',
		"shortname": '金昌市',
		"parentid": '620000'
	}, {
		"id": '620400',
		"shortname": '白银市',
		"parentid": '620000'
	}, {
		"id": '620500',
		"shortname": '天水市',
		"parentid": '620000'
	}, {
		"id": '620600',
		"shortname": '武威市',
		"parentid": '620000'
	}, {
		"id": '620700',
		"shortname": '张掖市',
		"parentid": '620000'
	}, {
		"id": '620800',
		"shortname": '平凉市',
		"parentid": '620000'
	}, {
		"id": '620900',
		"shortname": '酒泉市',
		"parentid": '620000'
	}, {
		"id": '621000',
		"shortname": '庆阳市',
		"parentid": '620000'
	}, {
		"id": '621100',
		"shortname": '定西市',
		"parentid": '620000'
	}, {
		"id": '621200',
		"shortname": '陇南市',
		"parentid": '620000'
	}, {
		"id": '622900',
		"shortname": '临夏回族自治州',
		"parentid": '620000'
	}, {
		"id": '623000',
		"shortname": '甘南藏族自治州',
		"parentid": '620000'
	}, {
		"id": '627000',
		"shortname": '甘肃矿区',
		"parentid": '620000'
	}, {
		"id": '632600',
		"shortname": '果洛藏族自治州',
		"parentid": '630000'
	}, {
		"id": '632700',
		"shortname": '玉树藏族自治州',
		"parentid": '630000'
	}, {
		"id": '632800',
		"shortname": '海西蒙古族藏族自治州',
		"parentid": '630000'
	}, {
		"id": '630100',
		"shortname": '西宁市',
		"parentid": '630000'
	}, {
		"id": '632100',
		"shortname": '海东地区',
		"parentid": '630000'
	}, {
		"id": '632200',
		"shortname": '海北藏族自治州',
		"parentid": '630000'
	}, {
		"id": '632300',
		"shortname": '黄南藏族自治州',
		"parentid": '630000'
	}, {
		"id": '632500',
		"shortname": '海南藏族自治州',
		"parentid": '630000'
	}, {
		"id": '640100',
		"shortname": '银川市',
		"parentid": '640000'
	}, {
		"id": '640200',
		"shortname": '石嘴山市',
		"parentid": '640000'
	}, {
		"id": '640300',
		"shortname": '吴忠市',
		"parentid": '640000'
	}, {
		"id": '640400',
		"shortname": '固原市',
		"parentid": '640000'
	}, {
		"id": '640500',
		"shortname": '中卫市',
		"parentid": '640000'
	}, {
		"id": '650100',
		"shortname": '乌鲁木齐市',
		"parentid": '650000'
	}, {
		"id": '650200',
		"shortname": '克拉玛依市',
		"parentid": '650000'
	}, {
		"id": '652100',
		"shortname": '吐鲁番地区',
		"parentid": '650000'
	}, {
		"id": '652200',
		"shortname": '哈密地区',
		"parentid": '650000'
	}, {
		"id": '652300',
		"shortname": '昌吉回族自治州',
		"parentid": '650000'
	}, {
		"id": '652700',
		"shortname": '博尔塔拉蒙古自治州',
		"parentid": '650000'
	}, {
		"id": '652800',
		"shortname": '巴音郭楞蒙古自治州',
		"parentid": '650000'
	}, {
		"id": '652900',
		"shortname": '阿克苏地区',
		"parentid": '650000'
	}, {
		"id": '653000',
		"shortname": '克孜勒苏柯尔克孜自治州',
		"parentid": '650000'
	}, {
		"id": '653100',
		"shortname": '喀什地区',
		"parentid": '650000'
	}, {
		"id": '653200',
		"shortname": '和田地区',
		"parentid": '650000'
	}, {
		"id": '654000',
		"shortname": '伊犁哈萨克自治州',
		"parentid": '650000'
	},
	{
		"id": '654200',
		"shortname": '塔城地区',
		"parentid": '650000'
	}, {
		"id": '654300',
		"shortname": '阿勒泰地区',
		"parentid": '650000'
	}
];

// 区县
var county = [{
		"id": '110101',
		"shortname": '东城区',
		"parentid": '119900'
	},
	{
		"id": '110102',
		"shortname": '西城区',
		"parentid": '119900'
	},
	{
		"id": '110103',
		"shortname": '崇文区',
		"parentid": '119900'
	},
	{
		"id": '110104',
		"shortname": '宣武区',
		"parentid": '119900'
	},
	{
		"id": '110105',
		"shortname": '朝阳区',
		"parentid": '119900'
	},
	{
		"id": '110106',
		"shortname": '丰台区',
		"parentid": '119900'
	},
	{
		"id": '110107',
		"shortname": '石景山区',
		"parentid": '119900'
	},
	{
		"id": '110108',
		"shortname": '海淀区',
		"parentid": '119900'
	},
	{
		"id": '110109',
		"shortname": '门头沟区',
		"parentid": '119900'
	},
	{
		"id": '110111',
		"shortname": '房山区',
		"parentid": '119900'
	},
	{
		"id": '110112',
		"shortname": '通州区',
		"parentid": '119900'
	},
	{
		"id": '110113',
		"shortname": '顺义区',
		"parentid": '119900'
	},
	{
		"id": '110114',
		"shortname": '昌平区',
		"parentid": '119900'
	},
	{
		"id": '110115',
		"shortname": '大兴区',
		"parentid": '119900'
	},
	{
		"id": '110116',
		"shortname": '怀柔区',
		"parentid": '119900'
	},
	{
		"id": '110117',
		"shortname": '平谷区',
		"parentid": '119900'
	},
	{
		"id": '110140',
		"shortname": '经济技术开发区',
		"parentid": '119900'
	},
	{
		"id": '110228',
		"shortname": '密云县',
		"parentid": '119900'
	},
	{
		"id": '110229',
		"shortname": '延庆县',
		"parentid": '119900'
	},
	{
		"id": '120141',
		"shortname": '保税区',
		"parentid": '129900'
	},
	{
		"id": '120142',
		"shortname": '科技园区',
		"parentid": '129900'
	},
	{
		"id": '120223',
		"shortname": '静海县',
		"parentid": '129900'
	},
	{
		"id": '120225',
		"shortname": '蓟县',
		"parentid": '129900'
	},
	{
		"id": '120114',
		"shortname": '武清区',
		"parentid": '129900'
	},
	{
		"id": '120115',
		"shortname": '宝坻区',
		"parentid": '129900'
	},
	{
		"id": '120140',
		"shortname": '开发区',
		"parentid": '129900'
	},
	{
		"id": '120101',
		"shortname": '和平区',
		"parentid": '129900'
	},
	{
		"id": '120102',
		"shortname": '河东区',
		"parentid": '129900'
	},
	{
		"id": '120103',
		"shortname": '河西区',
		"parentid": '129900'
	},
	{
		"id": '120104',
		"shortname": '南开区',
		"parentid": '129900'
	},
	{
		"id": '120105',
		"shortname": '河北区',
		"parentid": '129900'
	},
	{
		"id": '120106',
		"shortname": '红桥区',
		"parentid": '129900'
	},
	{
		"id": '120107',
		"shortname": '塘沽区',
		"parentid": '129900'
	},
	{
		"id": '120108',
		"shortname": '汉沽区',
		"parentid": '129900'
	},
	{
		"id": '120109',
		"shortname": '大港区',
		"parentid": '129900'
	},
	{
		"id": '120110',
		"shortname": '东丽区',
		"parentid": '129900'
	},
	{
		"id": '120111',
		"shortname": '西青区',
		"parentid": '129900'
	},
	{
		"id": '120112',
		"shortname": '津南区',
		"parentid": '129900'
	},
	{
		"id": '120113',
		"shortname": '北辰区',
		"parentid": '129900'
	},
	{
		"id": '120221',
		"shortname": '宁河县',
		"parentid": '129900'
	},
	{
		"id": '130103',
		"shortname": '桥东区',
		"parentid": '130100'
	},
	{
		"id": '130104',
		"shortname": '桥西区',
		"parentid": '130100'
	},
	{
		"id": '130105',
		"shortname": '新华区',
		"parentid": '130100'
	},
	{
		"id": '130107',
		"shortname": '井陉矿区',
		"parentid": '130100'
	},
	{
		"id": '130108',
		"shortname": '裕华区',
		"parentid": '130100'
	},
	{
		"id": '130121',
		"shortname": '井陉县',
		"parentid": '130100'
	},
	{
		"id": '130123',
		"shortname": '正定县',
		"parentid": '130100'
	},
	{
		"id": '130124',
		"shortname": '栾城县',
		"parentid": '130100'
	},
	{
		"id": '130125',
		"shortname": '行唐县',
		"parentid": '130100'
	},
	{
		"id": '130126',
		"shortname": '灵寿县',
		"parentid": '130100'
	},
	{
		"id": '130127',
		"shortname": '高邑县',
		"parentid": '130100'
	},
	{
		"id": '130128',
		"shortname": '深泽县',
		"parentid": '130100'
	},
	{
		"id": '130129',
		"shortname": '赞皇县',
		"parentid": '130100'
	},
	{
		"id": '130130',
		"shortname": '无极县',
		"parentid": '130100'
	},
	{
		"id": '130131',
		"shortname": '平山县',
		"parentid": '130100'
	},
	{
		"id": '130132',
		"shortname": '元氏县',
		"parentid": '130100'
	},
	{
		"id": '130133',
		"shortname": '赵县',
		"parentid": '130100'
	},
	{
		"id": '130140',
		"shortname": '开发区',
		"parentid": '130100'
	},
	{
		"id": '130141',
		"shortname": '正定新区',
		"parentid": '130100'
	},
	{
		"id": '130181',
		"shortname": '辛集市',
		"parentid": '130100'
	},
	{
		"id": '130182',
		"shortname": '藁城市',
		"parentid": '130100'
	},
	{
		"id": '130183',
		"shortname": '晋州市',
		"parentid": '130100'
	},
	{
		"id": '130184',
		"shortname": '新乐市',
		"parentid": '130100'
	},
	{
		"id": '130185',
		"shortname": '鹿泉市',
		"parentid": '130100'
	},
	{
		"id": '130102',
		"shortname": '长安区',
		"parentid": '130100'
	},
	{
		"id": '130202',
		"shortname": '路南区',
		"parentid": '130200'
	},
	{
		"id": '130203',
		"shortname": '路北区',
		"parentid": '130200'
	},
	{
		"id": '130204',
		"shortname": '古冶区',
		"parentid": '130200'
	},
	{
		"id": '130205',
		"shortname": '开平区',
		"parentid": '130200'
	},
	{
		"id": '130207',
		"shortname": '丰南区',
		"parentid": '130200'
	},
	{
		"id": '130208',
		"shortname": '丰润区',
		"parentid": '130200'
	},
	{
		"id": '130223',
		"shortname": '滦县',
		"parentid": '130200'
	},
	{
		"id": '130224',
		"shortname": '滦南县',
		"parentid": '130200'
	},
	{
		"id": '130225',
		"shortname": '乐亭县',
		"parentid": '130200'
	},
	{
		"id": '130227',
		"shortname": '迁西县',
		"parentid": '130200'
	},
	{
		"id": '130229',
		"shortname": '玉田县',
		"parentid": '130200'
	},
	{
		"id": '130230',
		"shortname": '唐海县',
		"parentid": '130200'
	},
	{
		"id": '130240',
		"shortname": '高新技术开发区',
		"parentid": '130200'
	},
	{
		"id": '130241',
		"shortname": '南堡开发区',
		"parentid": '130200'
	},
	{
		"id": '130242',
		"shortname": '海港开发区',
		"parentid": '130200'
	},
	{
		"id": '130243',
		"shortname": '芦台开发区',
		"parentid": '130200'
	},
	{
		"id": '130244',
		"shortname": '汉沽开发区',
		"parentid": '130200'
	},
	{
		"id": '130245',
		"shortname": '曹妃甸工业区',
		"parentid": '130200'
	},
	{
		"id": '130281',
		"shortname": '遵化市',
		"parentid": '130200'
	},
	{
		"id": '130283',
		"shortname": '迁安市',
		"parentid": '130200'
	},
	{
		"id": '130302',
		"shortname": '海港区',
		"parentid": '130300'
	},
	{
		"id": '130303',
		"shortname": '山海关区',
		"parentid": '130300'
	},
	{
		"id": '130304',
		"shortname": '北戴河区',
		"parentid": '130300'
	},
	{
		"id": '130321',
		"shortname": '青龙满族自治县',
		"parentid": '130300'
	},
	{
		"id": '130322',
		"shortname": '昌黎县',
		"parentid": '130300'
	},
	{
		"id": '130323',
		"shortname": '抚宁县',
		"parentid": '130300'
	},
	{
		"id": '130324',
		"shortname": '卢龙县',
		"parentid": '130300'
	},
	{
		"id": '130340',
		"shortname": '开发区',
		"parentid": '130300'
	},
	{
		"id": '130440',
		"shortname": '开发区',
		"parentid": '130400'
	},
	{
		"id": '130441',
		"shortname": '马头生态工业城',
		"parentid": '130400'
	},
	{
		"id": '130481',
		"shortname": '武安市',
		"parentid": '130400'
	},
	{
		"id": '130402',
		"shortname": '邯山区',
		"parentid": '130400'
	},
	{
		"id": '130403',
		"shortname": '丛台区',
		"parentid": '130400'
	},
	{
		"id": '130404',
		"shortname": '复兴区',
		"parentid": '130400'
	},
	{
		"id": '130406',
		"shortname": '峰峰矿区',
		"parentid": '130400'
	},
	{
		"id": '130421',
		"shortname": '邯郸县',
		"parentid": '130400'
	},
	{
		"id": '130423',
		"shortname": '临漳县',
		"parentid": '130400'
	},
	{
		"id": '130424',
		"shortname": '成安县',
		"parentid": '130400'
	},
	{
		"id": '130425',
		"shortname": '大名县',
		"parentid": '130400'
	},
	{
		"id": '130426',
		"shortname": '涉县',
		"parentid": '130400'
	},
	{
		"id": '130427',
		"shortname": '磁县',
		"parentid": '130400'
	},
	{
		"id": '130428',
		"shortname": '肥乡县',
		"parentid": '130400'
	},
	{
		"id": '130429',
		"shortname": '永年县',
		"parentid": '130400'
	},
	{
		"id": '130430',
		"shortname": '邱县',
		"parentid": '130400'
	},
	{
		"id": '130431',
		"shortname": '鸡泽县',
		"parentid": '130400'
	},
	{
		"id": '130432',
		"shortname": '广平县',
		"parentid": '130400'
	},
	{
		"id": '130433',
		"shortname": '馆陶县',
		"parentid": '130400'
	},
	{
		"id": '130434',
		"shortname": '魏县',
		"parentid": '130400'
	},
	{
		"id": '130435',
		"shortname": '曲周县',
		"parentid": '130400'
	},
	{
		"id": '130581',
		"shortname": '南宫市',
		"parentid": '130500'
	},
	{
		"id": '130582',
		"shortname": '沙河市',
		"parentid": '130500'
	},
	{
		"id": '130502',
		"shortname": '桥东区',
		"parentid": '130500'
	},
	{
		"id": '130503',
		"shortname": '桥西区',
		"parentid": '130500'
	},
	{
		"id": '130521',
		"shortname": '邢台县',
		"parentid": '130500'
	},
	{
		"id": '130522',
		"shortname": '临城县',
		"parentid": '130500'
	},
	{
		"id": '130523',
		"shortname": '内丘县',
		"parentid": '130500'
	},
	{
		"id": '130524',
		"shortname": '柏乡县',
		"parentid": '130500'
	},
	{
		"id": '130525',
		"shortname": '隆尧县',
		"parentid": '130500'
	},
	{
		"id": '130526',
		"shortname": '任县',
		"parentid": '130500'
	},
	{
		"id": '130527',
		"shortname": '南和县',
		"parentid": '130500'
	},
	{
		"id": '130528',
		"shortname": '宁晋县',
		"parentid": '130500'
	},
	{
		"id": '130529',
		"shortname": '巨鹿县',
		"parentid": '130500'
	},
	{
		"id": '130530',
		"shortname": '新河县',
		"parentid": '130500'
	},
	{
		"id": '130531',
		"shortname": '广宗县',
		"parentid": '130500'
	},
	{
		"id": '130532',
		"shortname": '平乡县',
		"parentid": '130500'
	},
	{
		"id": '130533',
		"shortname": '威县',
		"parentid": '130500'
	},
	{
		"id": '130534',
		"shortname": '清河县',
		"parentid": '130500'
	},
	{
		"id": '130535',
		"shortname": '临西县',
		"parentid": '130500'
	},
	{
		"id": '130540',
		"shortname": '高开区',
		"parentid": '130500'
	},
	{
		"id": '130541',
		"shortname": '大曹庄',
		"parentid": '130500'
	},
	{
		"id": '130602',
		"shortname": '竞秀区',
		"parentid": '130600'
	},
	{
		"id": '130604',
		"shortname": '南市区',
		"parentid": '130600'
	},
	{
		"id": '130621',
		"shortname": '满城县',
		"parentid": '130600'
	},
	{
		"id": '130622',
		"shortname": '清苑县',
		"parentid": '130600'
	},
	{
		"id": '130623',
		"shortname": '涞水县',
		"parentid": '130600'
	},
	{
		"id": '130624',
		"shortname": '阜平县',
		"parentid": '130600'
	},
	{
		"id": '130625',
		"shortname": '徐水县',
		"parentid": '130600'
	},
	{
		"id": '130626',
		"shortname": '定兴县',
		"parentid": '130600'
	},
	{
		"id": '130627',
		"shortname": '唐县',
		"parentid": '130600'
	},
	{
		"id": '130628',
		"shortname": '高阳县',
		"parentid": '130600'
	},
	{
		"id": '130629',
		"shortname": '容城县',
		"parentid": '130600'
	},
	{
		"id": '130630',
		"shortname": '涞源县',
		"parentid": '130600'
	},
	{
		"id": '130631',
		"shortname": '望都县',
		"parentid": '130600'
	},
	{
		"id": '130632',
		"shortname": '安新县',
		"parentid": '130600'
	},
	{
		"id": '130633',
		"shortname": '易县',
		"parentid": '130600'
	},
	{
		"id": '130634',
		"shortname": '曲阳县',
		"parentid": '130600'
	},
	{
		"id": '130635',
		"shortname": '蠡县',
		"parentid": '130600'
	},
	{
		"id": '130636',
		"shortname": '顺平县',
		"parentid": '130600'
	},
	{
		"id": '130637',
		"shortname": '博野县',
		"parentid": '130600'
	},
	{
		"id": '130638',
		"shortname": '雄县',
		"parentid": '130600'
	},
	{
		"id": '130640',
		"shortname": '温泉城经济区',
		"parentid": '130600'
	},
	{
		"id": '130641',
		"shortname": '高新区',
		"parentid": '130600'
	},
	{
		"id": '130681',
		"shortname": '涿州市',
		"parentid": '130600'
	},
	{
		"id": '130682',
		"shortname": '定州市',
		"parentid": '130600'
	},
	{
		"id": '130683',
		"shortname": '安国市',
		"parentid": '130600'
	},
	{
		"id": '130684',
		"shortname": '高碑店市',
		"parentid": '130600'
	},
	{
		"id": '130603',
		"shortname": '北市区',
		"parentid": '130600'
	},
	{
		"id": '130702',
		"shortname": '桥东区',
		"parentid": '130700'
	},
	{
		"id": '130703',
		"shortname": '桥西区',
		"parentid": '130700'
	},
	{
		"id": '130705',
		"shortname": '宣化区',
		"parentid": '130700'
	},
	{
		"id": '130706',
		"shortname": '下花园区',
		"parentid": '130700'
	},
	{
		"id": '130721',
		"shortname": '宣化县',
		"parentid": '130700'
	},
	{
		"id": '130722',
		"shortname": '张北县',
		"parentid": '130700'
	},
	{
		"id": '130723',
		"shortname": '康保县',
		"parentid": '130700'
	},
	{
		"id": '130724',
		"shortname": '沽源县',
		"parentid": '130700'
	},
	{
		"id": '130725',
		"shortname": '尚义县',
		"parentid": '130700'
	},
	{
		"id": '130726',
		"shortname": '蔚县',
		"parentid": '130700'
	},
	{
		"id": '130727',
		"shortname": '阳原县',
		"parentid": '130700'
	},
	{
		"id": '130728',
		"shortname": '怀安县',
		"parentid": '130700'
	},
	{
		"id": '130729',
		"shortname": '万全县',
		"parentid": '130700'
	},
	{
		"id": '130730',
		"shortname": '怀来县',
		"parentid": '130700'
	},
	{
		"id": '130731',
		"shortname": '涿鹿县',
		"parentid": '130700'
	},
	{
		"id": '130732',
		"shortname": '赤城县',
		"parentid": '130700'
	},
	{
		"id": '130733',
		"shortname": '崇礼县',
		"parentid": '130700'
	},
	{
		"id": '130740',
		"shortname": '高新区',
		"parentid": '130700'
	},
	{
		"id": '130741',
		"shortname": '察北管理区',
		"parentid": '130700'
	},
	{
		"id": '130742',
		"shortname": '塞北管理区',
		"parentid": '130700'
	},
	{
		"id": '130802',
		"shortname": '双桥区',
		"parentid": '130800'
	},
	{
		"id": '130803',
		"shortname": '双滦区',
		"parentid": '130800'
	},
	{
		"id": '130804',
		"shortname": '鹰手营子矿区',
		"parentid": '130800'
	},
	{
		"id": '130821',
		"shortname": '承德县',
		"parentid": '130800'
	},
	{
		"id": '130822',
		"shortname": '兴隆县',
		"parentid": '130800'
	},
	{
		"id": '130823',
		"shortname": '平泉县',
		"parentid": '130800'
	},
	{
		"id": '130824',
		"shortname": '滦平县',
		"parentid": '130800'
	},
	{
		"id": '130825',
		"shortname": '隆化县',
		"parentid": '130800'
	},
	{
		"id": '130826',
		"shortname": '丰宁满族自治县',
		"parentid": '130800'
	},
	{
		"id": '130827',
		"shortname": '宽城满族自治县',
		"parentid": '130800'
	},
	{
		"id": '130828',
		"shortname": '围场满族蒙古族自治县',
		"parentid": '130800'
	},
	{
		"id": '130941',
		"shortname": '沧州临港经济技术开发区',
		"parentid": '130900'
	},
	{
		"id": '130942',
		"shortname": '沧州市南大港管理区',
		"parentid": '130900'
	},
	{
		"id": '130943',
		"shortname": '沧州经济技术开发区',
		"parentid": '130900'
	},
	{
		"id": '130981',
		"shortname": '泊头市',
		"parentid": '130900'
	},
	{
		"id": '130982',
		"shortname": '任丘市',
		"parentid": '130900'
	},
	{
		"id": '130983',
		"shortname": '黄骅市',
		"parentid": '130900'
	},
	{
		"id": '130984',
		"shortname": '河间市',
		"parentid": '130900'
	},
	{
		"id": '130902',
		"shortname": '新华区',
		"parentid": '130900'
	},
	{
		"id": '130903',
		"shortname": '运河区',
		"parentid": '130900'
	},
	{
		"id": '130921',
		"shortname": '沧县',
		"parentid": '130900'
	},
	{
		"id": '130922',
		"shortname": '青县',
		"parentid": '130900'
	},
	{
		"id": '130923',
		"shortname": '东光县',
		"parentid": '130900'
	},
	{
		"id": '130924',
		"shortname": '海兴县',
		"parentid": '130900'
	},
	{
		"id": '130925',
		"shortname": '盐山县',
		"parentid": '130900'
	},
	{
		"id": '130926',
		"shortname": '肃宁县',
		"parentid": '130900'
	},
	{
		"id": '130927',
		"shortname": '南皮县',
		"parentid": '130900'
	},
	{
		"id": '130928',
		"shortname": '吴桥县',
		"parentid": '130900'
	},
	{
		"id": '130929',
		"shortname": '献县',
		"parentid": '130900'
	},
	{
		"id": '130930',
		"shortname": '孟村回族自治县',
		"parentid": '130900'
	},
	{
		"id": '130940',
		"shortname": '黄骅港开发区',
		"parentid": '130900'
	},
	{
		"id": '131002',
		"shortname": '安次区',
		"parentid": '131000'
	},
	{
		"id": '131003',
		"shortname": '广阳区',
		"parentid": '131000'
	},
	{
		"id": '131022',
		"shortname": '固安县',
		"parentid": '131000'
	},
	{
		"id": '131023',
		"shortname": '永清县',
		"parentid": '131000'
	},
	{
		"id": '131024',
		"shortname": '香河县',
		"parentid": '131000'
	},
	{
		"id": '131025',
		"shortname": '大城县',
		"parentid": '131000'
	},
	{
		"id": '131026',
		"shortname": '文安县',
		"parentid": '131000'
	},
	{
		"id": '131028',
		"shortname": '大厂回族自治县',
		"parentid": '131000'
	},
	{
		"id": '131040',
		"shortname": '开发区',
		"parentid": '131000'
	},
	{
		"id": '131081',
		"shortname": '霸州市',
		"parentid": '131000'
	},
	{
		"id": '131082',
		"shortname": '三河市',
		"parentid": '131000'
	},
	{
		"id": '131102',
		"shortname": '桃城区',
		"parentid": '131100'
	},
	{
		"id": '131121',
		"shortname": '枣强县',
		"parentid": '131100'
	},
	{
		"id": '131122',
		"shortname": '武邑县',
		"parentid": '131100'
	},
	{
		"id": '131123',
		"shortname": '武强县',
		"parentid": '131100'
	},
	{
		"id": '131124',
		"shortname": '饶阳县',
		"parentid": '131100'
	},
	{
		"id": '131125',
		"shortname": '安平县',
		"parentid": '131100'
	},
	{
		"id": '131126',
		"shortname": '故城县',
		"parentid": '131100'
	},
	{
		"id": '131127',
		"shortname": '景县',
		"parentid": '131100'
	},
	{
		"id": '131128',
		"shortname": '阜城县',
		"parentid": '131100'
	},
	{
		"id": '131140',
		"shortname": '开发区',
		"parentid": '131100'
	},
	{
		"id": '131181',
		"shortname": '冀州市',
		"parentid": '131100'
	},
	{
		"id": '131182',
		"shortname": '深州市',
		"parentid": '131100'
	},
	{
		"id": '140105',
		"shortname": '小店区',
		"parentid": '140100'
	},
	{
		"id": '140106',
		"shortname": '迎泽区',
		"parentid": '140100'
	},
	{
		"id": '140107',
		"shortname": '杏花岭区',
		"parentid": '140100'
	},
	{
		"id": '140108',
		"shortname": '尖草坪区',
		"parentid": '140100'
	},
	{
		"id": '140109',
		"shortname": '万柏林区',
		"parentid": '140100'
	},
	{
		"id": '140110',
		"shortname": '晋源区',
		"parentid": '140100'
	},
	{
		"id": '140122',
		"shortname": '阳曲县',
		"parentid": '140100'
	},
	{
		"id": '140123',
		"shortname": '娄烦县',
		"parentid": '140100'
	},
	{
		"id": '140181',
		"shortname": '古交市',
		"parentid": '140100'
	},
	{
		"id": '140121',
		"shortname": '清徐县',
		"parentid": '140100'
	},
	{
		"id": '140202',
		"shortname": '城区',
		"parentid": '140200'
	},
	{
		"id": '140203',
		"shortname": '矿区',
		"parentid": '140200'
	},
	{
		"id": '140211',
		"shortname": '南郊区',
		"parentid": '140200'
	},
	{
		"id": '140221',
		"shortname": '阳高县',
		"parentid": '140200'
	},
	{
		"id": '140222',
		"shortname": '天镇县',
		"parentid": '140200'
	},
	{
		"id": '140223',
		"shortname": '广灵县',
		"parentid": '140200'
	},
	{
		"id": '140224',
		"shortname": '灵丘县',
		"parentid": '140200'
	},
	{
		"id": '140226',
		"shortname": '左云县',
		"parentid": '140200'
	},
	{
		"id": '140227',
		"shortname": '大同县',
		"parentid": '140200'
	},
	{
		"id": '140240',
		"shortname": '开发区',
		"parentid": '140200'
	},
	{
		"id": '140212',
		"shortname": '新荣区',
		"parentid": '140200'
	},
	{
		"id": '140225',
		"shortname": '浑源县',
		"parentid": '140200'
	},
	{
		"id": '140302',
		"shortname": '城区',
		"parentid": '140300'
	},
	{
		"id": '140303',
		"shortname": '矿区',
		"parentid": '140300'
	},
	{
		"id": '140311',
		"shortname": '郊区',
		"parentid": '140300'
	},
	{
		"id": '140322',
		"shortname": '盂县',
		"parentid": '140300'
	},
	{
		"id": '140340',
		"shortname": '开发区',
		"parentid": '140300'
	},
	{
		"id": '140321',
		"shortname": '平定县',
		"parentid": '140300'
	},
	{
		"id": '140402',
		"shortname": '城区',
		"parentid": '140400'
	},
	{
		"id": '140411',
		"shortname": '郊区',
		"parentid": '140400'
	},
	{
		"id": '140421',
		"shortname": '长治县',
		"parentid": '140400'
	},
	{
		"id": '140423',
		"shortname": '襄垣县',
		"parentid": '140400'
	},
	{
		"id": '140424',
		"shortname": '屯留县',
		"parentid": '140400'
	},
	{
		"id": '140425',
		"shortname": '平顺县',
		"parentid": '140400'
	},
	{
		"id": '140426',
		"shortname": '黎城县',
		"parentid": '140400'
	},
	{
		"id": '140427',
		"shortname": '壶关县',
		"parentid": '140400'
	},
	{
		"id": '140428',
		"shortname": '长子县',
		"parentid": '140400'
	},
	{
		"id": '140429',
		"shortname": '武乡县',
		"parentid": '140400'
	},
	{
		"id": '140430',
		"shortname": '沁县',
		"parentid": '140400'
	},
	{
		"id": '140431',
		"shortname": '沁源县',
		"parentid": '140400'
	},
	{
		"id": '140440',
		"shortname": '开发区',
		"parentid": '140400'
	},
	{
		"id": '140481',
		"shortname": '潞城市',
		"parentid": '140400'
	},
	{
		"id": '140502',
		"shortname": '城区',
		"parentid": '140500'
	},
	{
		"id": '140521',
		"shortname": '沁水县',
		"parentid": '140500'
	},
	{
		"id": '140522',
		"shortname": '阳城县',
		"parentid": '140500'
	},
	{
		"id": '140524',
		"shortname": '陵川县',
		"parentid": '140500'
	},
	{
		"id": '140525',
		"shortname": '泽州县',
		"parentid": '140500'
	},
	{
		"id": '140581',
		"shortname": '高平市',
		"parentid": '140500'
	},
	{
		"id": '140602',
		"shortname": '朔城区',
		"parentid": '140600'
	},
	{
		"id": '140603',
		"shortname": '平鲁区',
		"parentid": '140600'
	},
	{
		"id": '140621',
		"shortname": '山阴县',
		"parentid": '140600'
	},
	{
		"id": '140622',
		"shortname": '应县',
		"parentid": '140600'
	},
	{
		"id": '140623',
		"shortname": '右玉县',
		"parentid": '140600'
	},
	{
		"id": '140624',
		"shortname": '怀仁县',
		"parentid": '140600'
	},
	{
		"id": '140702',
		"shortname": '榆次区',
		"parentid": '140700'
	},
	{
		"id": '140721',
		"shortname": '榆社县',
		"parentid": '140700'
	},
	{
		"id": '140722',
		"shortname": '左权县',
		"parentid": '140700'
	},
	{
		"id": '140723',
		"shortname": '和顺县',
		"parentid": '140700'
	},
	{
		"id": '140724',
		"shortname": '昔阳县',
		"parentid": '140700'
	},
	{
		"id": '140725',
		"shortname": '寿阳县',
		"parentid": '140700'
	},
	{
		"id": '140726',
		"shortname": '太谷县',
		"parentid": '140700'
	},
	{
		"id": '140727',
		"shortname": '祁县',
		"parentid": '140700'
	},
	{
		"id": '140728',
		"shortname": '平遥县',
		"parentid": '140700'
	},
	{
		"id": '140729',
		"shortname": '灵石县',
		"parentid": '140700'
	},
	{
		"id": '140740',
		"shortname": '榆次经济技术开发区',
		"parentid": '140700'
	},
	{
		"id": '140781',
		"shortname": '介休市',
		"parentid": '140700'
	},
	{
		"id": '140830',
		"shortname": '芮城县',
		"parentid": '140800'
	},
	{
		"id": '140881',
		"shortname": '永济市',
		"parentid": '140800'
	},
	{
		"id": '140882',
		"shortname": '河津市',
		"parentid": '140800'
	},
	{
		"id": '140802',
		"shortname": '盐湖区',
		"parentid": '140800'
	},
	{
		"id": '140821',
		"shortname": '临猗县',
		"parentid": '140800'
	},
	{
		"id": '140822',
		"shortname": '万荣县',
		"parentid": '140800'
	},
	{
		"id": '140823',
		"shortname": '闻喜县',
		"parentid": '140800'
	},
	{
		"id": '140824',
		"shortname": '稷山县',
		"parentid": '140800'
	},
	{
		"id": '140825',
		"shortname": '新绛县',
		"parentid": '140800'
	},
	{
		"id": '140826',
		"shortname": '绛县',
		"parentid": '140800'
	},
	{
		"id": '140827',
		"shortname": '垣曲县',
		"parentid": '140800'
	},
	{
		"id": '140828',
		"shortname": '夏县',
		"parentid": '140800'
	},
	{
		"id": '140829',
		"shortname": '平陆县',
		"parentid": '140800'
	},
	{
		"id": '140902',
		"shortname": '忻府区',
		"parentid": '140900'
	},
	{
		"id": '140921',
		"shortname": '定襄县',
		"parentid": '140900'
	},
	{
		"id": '140922',
		"shortname": '五台县',
		"parentid": '140900'
	},
	{
		"id": '140923',
		"shortname": '代县',
		"parentid": '140900'
	},
	{
		"id": '140924',
		"shortname": '繁峙县',
		"parentid": '140900'
	},
	{
		"id": '140925',
		"shortname": '宁武县',
		"parentid": '140900'
	},
	{
		"id": '140926',
		"shortname": '静乐县',
		"parentid": '140900'
	},
	{
		"id": '140927',
		"shortname": '神池县',
		"parentid": '140900'
	},
	{
		"id": '140928',
		"shortname": '五寨县',
		"parentid": '140900'
	},
	{
		"id": '140929',
		"shortname": '岢岚县',
		"parentid": '140900'
	},
	{
		"id": '140930',
		"shortname": '河曲县',
		"parentid": '140900'
	},
	{
		"id": '140931',
		"shortname": '保德县',
		"parentid": '140900'
	},
	{
		"id": '140932',
		"shortname": '偏关县',
		"parentid": '140900'
	},
	{
		"id": '140981',
		"shortname": '原平市',
		"parentid": '140900'
	},
	{
		"id": '141002',
		"shortname": '尧都区',
		"parentid": '141000'
	},
	{
		"id": '141021',
		"shortname": '曲沃县',
		"parentid": '141000'
	},
	{
		"id": '141022',
		"shortname": '翼城县',
		"parentid": '141000'
	},
	{
		"id": '141023',
		"shortname": '襄汾县',
		"parentid": '141000'
	},
	{
		"id": '141024',
		"shortname": '洪洞县',
		"parentid": '141000'
	},
	{
		"id": '141025',
		"shortname": '古县',
		"parentid": '141000'
	},
	{
		"id": '141027',
		"shortname": '浮山县',
		"parentid": '141000'
	},
	{
		"id": '141028',
		"shortname": '吉县',
		"parentid": '141000'
	},
	{
		"id": '141029',
		"shortname": '乡宁县',
		"parentid": '141000'
	},
	{
		"id": '141030',
		"shortname": '大宁县',
		"parentid": '141000'
	},
	{
		"id": '141031',
		"shortname": '隰县',
		"parentid": '141000'
	},
	{
		"id": '141032',
		"shortname": '永和县',
		"parentid": '141000'
	},
	{
		"id": '141033',
		"shortname": '蒲县',
		"parentid": '141000'
	},
	{
		"id": '141034',
		"shortname": '汾西县',
		"parentid": '141000'
	},
	{
		"id": '141081',
		"shortname": '侯马市',
		"parentid": '141000'
	},
	{
		"id": '141082',
		"shortname": '霍州市',
		"parentid": '141000'
	},
	{
		"id": '141026',
		"shortname": '安泽县',
		"parentid": '141000'
	},
	{
		"id": '141130',
		"shortname": '交口县',
		"parentid": '141100'
	},
	{
		"id": '141125',
		"shortname": '柳林县',
		"parentid": '141100'
	},
	{
		"id": '141126',
		"shortname": '石楼县',
		"parentid": '141100'
	},
	{
		"id": '141127',
		"shortname": '岚县',
		"parentid": '141100'
	},
	{
		"id": '141128',
		"shortname": '方山县',
		"parentid": '141100'
	},
	{
		"id": '141129',
		"shortname": '中阳县',
		"parentid": '141100'
	},
	{
		"id": '141181',
		"shortname": '孝义市',
		"parentid": '141100'
	},
	{
		"id": '141182',
		"shortname": '汾阳市',
		"parentid": '141100'
	},
	{
		"id": '141102',
		"shortname": '离石区',
		"parentid": '141100'
	},
	{
		"id": '141121',
		"shortname": '文水县',
		"parentid": '141100'
	},
	{
		"id": '141122',
		"shortname": '交城县',
		"parentid": '141100'
	},
	{
		"id": '141123',
		"shortname": '兴县',
		"parentid": '141100'
	},
	{
		"id": '141124',
		"shortname": '临县',
		"parentid": '141100'
	},
	{
		"id": '150102',
		"shortname": '新城区',
		"parentid": '150100'
	},
	{
		"id": '150103',
		"shortname": '回民区',
		"parentid": '150100'
	},
	{
		"id": '150104',
		"shortname": '玉泉区',
		"parentid": '150100'
	},
	{
		"id": '150105',
		"shortname": '赛罕区',
		"parentid": '150100'
	},
	{
		"id": '150121',
		"shortname": '土默特左旗',
		"parentid": '150100'
	},
	{
		"id": '150122',
		"shortname": '托克托县',
		"parentid": '150100'
	},
	{
		"id": '150123',
		"shortname": '和林格尔县',
		"parentid": '150100'
	},
	{
		"id": '150124',
		"shortname": '清水河县',
		"parentid": '150100'
	},
	{
		"id": '150125',
		"shortname": '武川县',
		"parentid": '150100'
	},
	{
		"id": '150202',
		"shortname": '东河区',
		"parentid": '150200'
	},
	{
		"id": '150203',
		"shortname": '昆都仑区',
		"parentid": '150200'
	},
	{
		"id": '150204',
		"shortname": '青山区',
		"parentid": '150200'
	},
	{
		"id": '150205',
		"shortname": '石拐区',
		"parentid": '150200'
	},
	{
		"id": '150206',
		"shortname": '白云鄂博矿区',
		"parentid": '150200'
	},
	{
		"id": '150207',
		"shortname": '九原区',
		"parentid": '150200'
	},
	{
		"id": '150221',
		"shortname": '土默特右旗',
		"parentid": '150200'
	},
	{
		"id": '150222',
		"shortname": '固阳县',
		"parentid": '150200'
	},
	{
		"id": '150223',
		"shortname": '达尔罕茂明安联合旗',
		"parentid": '150200'
	},
	{
		"id": '150240',
		"shortname": '稀土高新技术产业开发区',
		"parentid": '150200'
	},
	{
		"id": '150302',
		"shortname": '海勃湾区',
		"parentid": '150300'
	},
	{
		"id": '150303',
		"shortname": '海南区',
		"parentid": '150300'
	},
	{
		"id": '150304',
		"shortname": '乌达区',
		"parentid": '150300'
	},
	{
		"id": '150402',
		"shortname": '红山区',
		"parentid": '150400'
	},
	{
		"id": '150403',
		"shortname": '元宝山区',
		"parentid": '150400'
	},
	{
		"id": '150404',
		"shortname": '松山区',
		"parentid": '150400'
	},
	{
		"id": '150421',
		"shortname": '阿鲁科尔沁旗',
		"parentid": '150400'
	},
	{
		"id": '150422',
		"shortname": '巴林左旗',
		"parentid": '150400'
	},
	{
		"id": '150423',
		"shortname": '巴林右旗',
		"parentid": '150400'
	},
	{
		"id": '150424',
		"shortname": '林西县',
		"parentid": '150400'
	},
	{
		"id": '150425',
		"shortname": '克什克腾旗',
		"parentid": '150400'
	},
	{
		"id": '150426',
		"shortname": '翁牛特旗',
		"parentid": '150400'
	},
	{
		"id": '150428',
		"shortname": '喀喇沁旗',
		"parentid": '150400'
	},
	{
		"id": '150429',
		"shortname": '宁城县',
		"parentid": '150400'
	},
	{
		"id": '150430',
		"shortname": '敖汉旗',
		"parentid": '150400'
	},
	{
		"id": '150502',
		"shortname": '科尔沁区',
		"parentid": '150500'
	},
	{
		"id": '150521',
		"shortname": '科尔沁左翼中旗',
		"parentid": '150500'
	},
	{
		"id": '150522',
		"shortname": '科尔沁左翼后旗',
		"parentid": '150500'
	},
	{
		"id": '150523',
		"shortname": '开鲁县',
		"parentid": '150500'
	},
	{
		"id": '150524',
		"shortname": '库伦旗',
		"parentid": '150500'
	},
	{
		"id": '150525',
		"shortname": '奈曼旗',
		"parentid": '150500'
	},
	{
		"id": '150526',
		"shortname": '扎鲁特旗',
		"parentid": '150500'
	},
	{
		"id": '150581',
		"shortname": '霍林郭勒市',
		"parentid": '150500'
	},
	{
		"id": '150602',
		"shortname": '东胜区',
		"parentid": '150600'
	},
	{
		"id": '150621',
		"shortname": '达拉特旗',
		"parentid": '150600'
	},
	{
		"id": '150622',
		"shortname": '准格尔旗',
		"parentid": '150600'
	},
	{
		"id": '150623',
		"shortname": '鄂托克前旗',
		"parentid": '150600'
	},
	{
		"id": '150624',
		"shortname": '鄂托克旗',
		"parentid": '150600'
	},
	{
		"id": '150625',
		"shortname": '杭锦旗',
		"parentid": '150600'
	},
	{
		"id": '150626',
		"shortname": '乌审旗',
		"parentid": '150600'
	},
	{
		"id": '150627',
		"shortname": '伊金霍洛旗',
		"parentid": '150600'
	},
	{
		"id": '150640',
		"shortname": '康巴什新区',
		"parentid": '150600'
	},
	{
		"id": '150702',
		"shortname": '海拉尔区',
		"parentid": '150700'
	},
	{
		"id": '150721',
		"shortname": '阿荣旗',
		"parentid": '150700'
	},
	{
		"id": '150722',
		"shortname": '莫力达瓦达斡尔族自治旗',
		"parentid": '150700'
	},
	{
		"id": '150723',
		"shortname": '鄂伦春自治旗',
		"parentid": '150700'
	},
	{
		"id": '150724',
		"shortname": '鄂温克族自治旗',
		"parentid": '150700'
	},
	{
		"id": '150725',
		"shortname": '陈巴尔虎旗',
		"parentid": '150700'
	},
	{
		"id": '150726',
		"shortname": '新巴尔虎左旗',
		"parentid": '150700'
	},
	{
		"id": '150727',
		"shortname": '新巴尔虎右旗',
		"parentid": '150700'
	},
	{
		"id": '150740',
		"shortname": '海拉尔农牧场',
		"parentid": '150700'
	},
	{
		"id": '150741',
		"shortname": '大兴安岭农牧场',
		"parentid": '150700'
	},
	{
		"id": '150781',
		"shortname": '满洲里市',
		"parentid": '150700'
	},
	{
		"id": '150782',
		"shortname": '牙克石市',
		"parentid": '150700'
	},
	{
		"id": '150783',
		"shortname": '扎兰屯市',
		"parentid": '150700'
	},
	{
		"id": '150784',
		"shortname": '额尔古纳市',
		"parentid": '150700'
	},
	{
		"id": '150785',
		"shortname": '根河市',
		"parentid": '150700'
	},
	{
		"id": '150821',
		"shortname": '五原县',
		"parentid": '150800'
	},
	{
		"id": '150822',
		"shortname": '磴口县',
		"parentid": '150800'
	},
	{
		"id": '150823',
		"shortname": '乌拉特前旗',
		"parentid": '150800'
	},
	{
		"id": '150824',
		"shortname": '乌拉特中旗',
		"parentid": '150800'
	},
	{
		"id": '150825',
		"shortname": '乌拉特后旗',
		"parentid": '150800'
	},
	{
		"id": '150826',
		"shortname": '杭锦后旗',
		"parentid": '150800'
	},
	{
		"id": '150802',
		"shortname": '临河区',
		"parentid": '150800'
	},
	{
		"id": '150902',
		"shortname": '集宁区',
		"parentid": '150900'
	},
	{
		"id": '150921',
		"shortname": '卓资县',
		"parentid": '150900'
	},
	{
		"id": '150922',
		"shortname": '化德县',
		"parentid": '150900'
	},
	{
		"id": '150923',
		"shortname": '商都县',
		"parentid": '150900'
	},
	{
		"id": '150924',
		"shortname": '兴和县',
		"parentid": '150900'
	},
	{
		"id": '150925',
		"shortname": '凉城县',
		"parentid": '150900'
	},
	{
		"id": '150926',
		"shortname": '察哈尔右翼前旗',
		"parentid": '150900'
	},
	{
		"id": '150927',
		"shortname": '察哈尔右翼中旗',
		"parentid": '150900'
	},
	{
		"id": '150928',
		"shortname": '察哈尔右翼后旗',
		"parentid": '150900'
	},
	{
		"id": '150929',
		"shortname": '四子王旗',
		"parentid": '150900'
	},
	{
		"id": '150940',
		"shortname": '察哈尔工业园区',
		"parentid": '150900'
	},
	{
		"id": '150981',
		"shortname": '丰镇市',
		"parentid": '150900'
	},
	{
		"id": '152223',
		"shortname": '扎赉特旗',
		"parentid": '152200'
	},
	{
		"id": '152224',
		"shortname": '突泉县',
		"parentid": '152200'
	},
	{
		"id": '152201',
		"shortname": '乌兰浩特市',
		"parentid": '152200'
	},
	{
		"id": '152202',
		"shortname": '阿尔山市',
		"parentid": '152200'
	},
	{
		"id": '152221',
		"shortname": '科尔沁右翼前旗',
		"parentid": '152200'
	},
	{
		"id": '152222',
		"shortname": '科尔沁右翼中旗',
		"parentid": '152200'
	},
	{
		"id": '152501',
		"shortname": '二连浩特市',
		"parentid": '152500'
	},
	{
		"id": '152502',
		"shortname": '锡林浩特市',
		"parentid": '152500'
	},
	{
		"id": '152522',
		"shortname": '阿巴嘎旗',
		"parentid": '152500'
	},
	{
		"id": '152523',
		"shortname": '苏尼特左旗',
		"parentid": '152500'
	},
	{
		"id": '152524',
		"shortname": '苏尼特右旗',
		"parentid": '152500'
	},
	{
		"id": '152525',
		"shortname": '东乌珠穆沁旗',
		"parentid": '152500'
	},
	{
		"id": '152526',
		"shortname": '西乌珠穆沁旗',
		"parentid": '152500'
	},
	{
		"id": '152527',
		"shortname": '太仆寺旗',
		"parentid": '152500'
	},
	{
		"id": '152528',
		"shortname": '镶黄旗',
		"parentid": '152500'
	},
	{
		"id": '152529',
		"shortname": '正镶白旗',
		"parentid": '152500'
	},
	{
		"id": '152530',
		"shortname": '正蓝旗',
		"parentid": '152500'
	},
	{
		"id": '152531',
		"shortname": '多伦县',
		"parentid": '152500'
	},
	{
		"id": '152540',
		"shortname": '乌拉盖开发区',
		"parentid": '152500'
	},
	{
		"id": '152921',
		"shortname": '阿拉善左旗',
		"parentid": '152900'
	},
	{
		"id": '152922',
		"shortname": '阿拉善右旗',
		"parentid": '152900'
	},
	{
		"id": '152923',
		"shortname": '额济纳旗',
		"parentid": '152900'
	},
	{
		"id": '152940',
		"shortname": '阿拉善经济开发区',
		"parentid": '152900'
	},
	{
		"id": '210102',
		"shortname": '和平区',
		"parentid": '210100'
	},
	{
		"id": '210103',
		"shortname": '沈河区',
		"parentid": '210100'
	},
	{
		"id": '210104',
		"shortname": '大东区',
		"parentid": '210100'
	},
	{
		"id": '210105',
		"shortname": '皇姑区',
		"parentid": '210100'
	},
	{
		"id": '210106',
		"shortname": '铁西区',
		"parentid": '210100'
	},
	{
		"id": '210111',
		"shortname": '苏家屯区',
		"parentid": '210100'
	},
	{
		"id": '210113',
		"shortname": '沈北新区',
		"parentid": '210100'
	},
	{
		"id": '210114',
		"shortname": '于洪区',
		"parentid": '210100'
	},
	{
		"id": '210122',
		"shortname": '辽中县',
		"parentid": '210100'
	},
	{
		"id": '210123',
		"shortname": '康平县',
		"parentid": '210100'
	},
	{
		"id": '210124',
		"shortname": '法库县',
		"parentid": '210100'
	},
	{
		"id": '210140',
		"shortname": '经济技术开发区',
		"parentid": '210100'
	},
	{
		"id": '210141',
		"shortname": '浑南新区',
		"parentid": '210100'
	},
	{
		"id": '210142',
		"shortname": '棋盘山',
		"parentid": '210100'
	},
	{
		"id": '210143',
		"shortname": '蒲河新城',
		"parentid": '210100'
	},
	{
		"id": '210181',
		"shortname": '新民市',
		"parentid": '210100'
	},
	{
		"id": '210112',
		"shortname": '浑南区',
		"parentid": '210100'
	},
	{
		"id": '210202',
		"shortname": '中山区',
		"parentid": '210200'
	},
	{
		"id": '210203',
		"shortname": '西岗区',
		"parentid": '210200'
	},
	{
		"id": '210204',
		"shortname": '沙河口区',
		"parentid": '210200'
	},
	{
		"id": '210211',
		"shortname": '甘井子区',
		"parentid": '210200'
	},
	{
		"id": '210212',
		"shortname": '旅顺口区',
		"parentid": '210200'
	},
	{
		"id": '210213',
		"shortname": '金州区',
		"parentid": '210200'
	},
	{
		"id": '210224',
		"shortname": '长海县',
		"parentid": '210200'
	},
	{
		"id": '210240',
		"shortname": '开发区',
		"parentid": '210200'
	},
	{
		"id": '210241',
		"shortname": '保税区',
		"parentid": '210200'
	},
	{
		"id": '210242',
		"shortname": '长兴岛临港工业区',
		"parentid": '210200'
	},
	{
		"id": '210243',
		"shortname": '花园口经济区',
		"parentid": '210200'
	},
	{
		"id": '210281',
		"shortname": '瓦房店市',
		"parentid": '210200'
	},
	{
		"id": '210282',
		"shortname": '普兰店市',
		"parentid": '210200'
	},
	{
		"id": '210283',
		"shortname": '庄河市',
		"parentid": '210200'
	},
	{
		"id": '210302',
		"shortname": '铁东区',
		"parentid": '210300'
	},
	{
		"id": '210303',
		"shortname": '铁西区',
		"parentid": '210300'
	},
	{
		"id": '210304',
		"shortname": '立山区',
		"parentid": '210300'
	},
	{
		"id": '210311',
		"shortname": '千山区',
		"parentid": '210300'
	},
	{
		"id": '210321',
		"shortname": '台安县',
		"parentid": '210300'
	},
	{
		"id": '210323',
		"shortname": '岫岩满族自治县',
		"parentid": '210300'
	},
	{
		"id": '210381',
		"shortname": '海城市',
		"parentid": '210300'
	},
	{
		"id": '210402',
		"shortname": '新抚区',
		"parentid": '210400'
	},
	{
		"id": '210403',
		"shortname": '东洲区',
		"parentid": '210400'
	},
	{
		"id": '210404',
		"shortname": '望花区',
		"parentid": '210400'
	},
	{
		"id": '210411',
		"shortname": '顺城区',
		"parentid": '210400'
	},
	{
		"id": '210421',
		"shortname": '抚顺县',
		"parentid": '210400'
	},
	{
		"id": '210422',
		"shortname": '新宾满族自治县',
		"parentid": '210400'
	},
	{
		"id": '210423',
		"shortname": '清原满族自治县',
		"parentid": '210400'
	},
	{
		"id": '210440',
		"shortname": '抚顺经济开发区',
		"parentid": '210400'
	},
	{
		"id": '210502',
		"shortname": '平山区',
		"parentid": '210500'
	},
	{
		"id": '210503',
		"shortname": '溪湖区',
		"parentid": '210500'
	},
	{
		"id": '210504',
		"shortname": '明山区',
		"parentid": '210500'
	},
	{
		"id": '210505',
		"shortname": '南芬区',
		"parentid": '210500'
	},
	{
		"id": '210521',
		"shortname": '本溪满族自治县',
		"parentid": '210500'
	},
	{
		"id": '210522',
		"shortname": '桓仁满族自治县',
		"parentid": '210500'
	},
	{
		"id": '210602',
		"shortname": '元宝区',
		"parentid": '210600'
	},
	{
		"id": '210603',
		"shortname": '振兴区',
		"parentid": '210600'
	},
	{
		"id": '210604',
		"shortname": '振安区',
		"parentid": '210600'
	},
	{
		"id": '210624',
		"shortname": '宽甸满族自治县',
		"parentid": '210600'
	},
	{
		"id": '210681',
		"shortname": '东港市',
		"parentid": '210600'
	},
	{
		"id": '210682',
		"shortname": '凤城市',
		"parentid": '210600'
	},
	{
		"id": '210702',
		"shortname": '古塔区',
		"parentid": '210700'
	},
	{
		"id": '210703',
		"shortname": '凌河区',
		"parentid": '210700'
	},
	{
		"id": '210711',
		"shortname": '太和区',
		"parentid": '210700'
	},
	{
		"id": '210726',
		"shortname": '黑山县',
		"parentid": '210700'
	},
	{
		"id": '210727',
		"shortname": '义县',
		"parentid": '210700'
	},
	{
		"id": '210740',
		"shortname": '开发区',
		"parentid": '210700'
	},
	{
		"id": '210741',
		"shortname": '松山新区',
		"parentid": '210700'
	},
	{
		"id": '210742',
		"shortname": '锦州龙栖湾新区',
		"parentid": '210700'
	},
	{
		"id": '210781',
		"shortname": '凌海市',
		"parentid": '210700'
	},
	{
		"id": '210782',
		"shortname": '北镇市',
		"parentid": '210700'
	},
	{
		"id": '210802',
		"shortname": '站前区',
		"parentid": '210800'
	},
	{
		"id": '210803',
		"shortname": '西市区',
		"parentid": '210800'
	},
	{
		"id": '210804',
		"shortname": '鲅鱼圈区',
		"parentid": '210800'
	},
	{
		"id": '210811',
		"shortname": '老边区',
		"parentid": '210800'
	},
	{
		"id": '210840',
		"shortname": '建筑企业',
		"parentid": '210800'
	},
	{
		"id": '210881',
		"shortname": '盖州市',
		"parentid": '210800'
	},
	{
		"id": '210882',
		"shortname": '大石桥市',
		"parentid": '210800'
	},
	{
		"id": '210921',
		"shortname": '阜新蒙古族自治县',
		"parentid": '210900'
	},
	{
		"id": '210902',
		"shortname": '海州区',
		"parentid": '210900'
	},
	{
		"id": '210903',
		"shortname": '新邱区',
		"parentid": '210900'
	},
	{
		"id": '210904',
		"shortname": '太平区',
		"parentid": '210900'
	},
	{
		"id": '210905',
		"shortname": '清河门区',
		"parentid": '210900'
	},
	{
		"id": '210911',
		"shortname": '细河区',
		"parentid": '210900'
	},
	{
		"id": '210922',
		"shortname": '彰武县',
		"parentid": '210900'
	},
	{
		"id": '210940',
		"shortname": '开发区',
		"parentid": '210900'
	},
	{
		"id": '210941',
		"shortname": '矿区',
		"parentid": '210900'
	},
	{
		"id": '210942',
		"shortname": '高新区',
		"parentid": '210900'
	},
	{
		"id": '211002',
		"shortname": '白塔区',
		"parentid": '211000'
	},
	{
		"id": '211003',
		"shortname": '文圣区',
		"parentid": '211000'
	},
	{
		"id": '211004',
		"shortname": '宏伟区',
		"parentid": '211000'
	},
	{
		"id": '211005',
		"shortname": '弓长岭区',
		"parentid": '211000'
	},
	{
		"id": '211011',
		"shortname": '太子河区',
		"parentid": '211000'
	},
	{
		"id": '211021',
		"shortname": '辽阳县',
		"parentid": '211000'
	},
	{
		"id": '211081',
		"shortname": '灯塔市',
		"parentid": '211000'
	},
	{
		"id": '211102',
		"shortname": '双台子区',
		"parentid": '211100'
	},
	{
		"id": '211103',
		"shortname": '兴隆台区',
		"parentid": '211100'
	},
	{
		"id": '211121',
		"shortname": '大洼县',
		"parentid": '211100'
	},
	{
		"id": '211122',
		"shortname": '盘山县',
		"parentid": '211100'
	},
	{
		"id": '211202',
		"shortname": '银州区',
		"parentid": '211200'
	},
	{
		"id": '211204',
		"shortname": '清河区',
		"parentid": '211200'
	},
	{
		"id": '211221',
		"shortname": '铁岭县',
		"parentid": '211200'
	},
	{
		"id": '211223',
		"shortname": '西丰县',
		"parentid": '211200'
	},
	{
		"id": '211224',
		"shortname": '昌图县',
		"parentid": '211200'
	},
	{
		"id": '211281',
		"shortname": '调兵山市',
		"parentid": '211200'
	},
	{
		"id": '211282',
		"shortname": '开原市',
		"parentid": '211200'
	},
	{
		"id": '211302',
		"shortname": '双塔区',
		"parentid": '211300'
	},
	{
		"id": '211303',
		"shortname": '龙城区',
		"parentid": '211300'
	},
	{
		"id": '211321',
		"shortname": '朝阳县',
		"parentid": '211300'
	},
	{
		"id": '211322',
		"shortname": '建平县',
		"parentid": '211300'
	},
	{
		"id": '211324',
		"shortname": '喀喇沁左翼蒙古族自治县',
		"parentid": '211300'
	},
	{
		"id": '211340',
		"shortname": '朝阳经济技术开发区',
		"parentid": '211300'
	},
	{
		"id": '211381',
		"shortname": '北票市',
		"parentid": '211300'
	},
	{
		"id": '211382',
		"shortname": '凌源市',
		"parentid": '211300'
	},
	{
		"id": '211402',
		"shortname": '连山区',
		"parentid": '211400'
	},
	{
		"id": '211403',
		"shortname": '龙港区',
		"parentid": '211400'
	},
	{
		"id": '211404',
		"shortname": '南票区',
		"parentid": '211400'
	},
	{
		"id": '211421',
		"shortname": '绥中县',
		"parentid": '211400'
	},
	{
		"id": '211422',
		"shortname": '建昌县',
		"parentid": '211400'
	},
	{
		"id": '211481',
		"shortname": '兴城市',
		"parentid": '211400'
	},
	{
		"id": '220102',
		"shortname": '南关区',
		"parentid": '220100'
	},
	{
		"id": '220103',
		"shortname": '宽城区',
		"parentid": '220100'
	},
	{
		"id": '220104',
		"shortname": '朝阳区',
		"parentid": '220100'
	},
	{
		"id": '220105',
		"shortname": '二道区',
		"parentid": '220100'
	},
	{
		"id": '220106',
		"shortname": '绿园区',
		"parentid": '220100'
	},
	{
		"id": '220112',
		"shortname": '双阳区',
		"parentid": '220100'
	},
	{
		"id": '220122',
		"shortname": '农安县',
		"parentid": '220100'
	},
	{
		"id": '220140',
		"shortname": '开发区',
		"parentid": '220100'
	},
	{
		"id": '220181',
		"shortname": '九台市',
		"parentid": '220100'
	},
	{
		"id": '220183',
		"shortname": '德惠市',
		"parentid": '220100'
	},
	{
		"id": '220182',
		"shortname": '榆树市',
		"parentid": '220100'
	},
	{
		"id": '220202',
		"shortname": '昌邑区',
		"parentid": '220200'
	},
	{
		"id": '220203',
		"shortname": '龙潭区',
		"parentid": '220200'
	},
	{
		"id": '220204',
		"shortname": '船营区',
		"parentid": '220200'
	},
	{
		"id": '220211',
		"shortname": '丰满区',
		"parentid": '220200'
	},
	{
		"id": '220221',
		"shortname": '永吉县',
		"parentid": '220200'
	},
	{
		"id": '220282',
		"shortname": '桦甸市',
		"parentid": '220200'
	},
	{
		"id": '220283',
		"shortname": '舒兰市',
		"parentid": '220200'
	},
	{
		"id": '220284',
		"shortname": '磐石市',
		"parentid": '220200'
	},
	{
		"id": '220281',
		"shortname": '蛟河市',
		"parentid": '220200'
	},
	{
		"id": '220302',
		"shortname": '铁西区',
		"parentid": '220300'
	},
	{
		"id": '220303',
		"shortname": '铁东区',
		"parentid": '220300'
	},
	{
		"id": '220322',
		"shortname": '梨树县',
		"parentid": '220300'
	},
	{
		"id": '220381',
		"shortname": '公主岭市',
		"parentid": '220300'
	},
	{
		"id": '220382',
		"shortname": '双辽市',
		"parentid": '220300'
	},
	{
		"id": '220323',
		"shortname": '伊通满族自治县',
		"parentid": '220300'
	},
	{
		"id": '220402',
		"shortname": '龙山区',
		"parentid": '220400'
	},
	{
		"id": '220403',
		"shortname": '西安区',
		"parentid": '220400'
	},
	{
		"id": '220421',
		"shortname": '东丰县',
		"parentid": '220400'
	},
	{
		"id": '220422',
		"shortname": '东辽县',
		"parentid": '220400'
	},
	{
		"id": '220502',
		"shortname": '东昌区',
		"parentid": '220500'
	},
	{
		"id": '220521',
		"shortname": '通化县',
		"parentid": '220500'
	},
	{
		"id": '220523',
		"shortname": '辉南县',
		"parentid": '220500'
	},
	{
		"id": '220524',
		"shortname": '柳河县',
		"parentid": '220500'
	},
	{
		"id": '220581',
		"shortname": '梅河口市',
		"parentid": '220500'
	},
	{
		"id": '220582',
		"shortname": '集安市',
		"parentid": '220500'
	},
	{
		"id": '220503',
		"shortname": '二道江区',
		"parentid": '220500'
	},
	{
		"id": '220622',
		"shortname": '靖宇县',
		"parentid": '220600'
	},
	{
		"id": '220623',
		"shortname": '长白朝鲜族自治县',
		"parentid": '220600'
	},
	{
		"id": '220681',
		"shortname": '临江市',
		"parentid": '220600'
	},
	{
		"id": '220602',
		"shortname": '浑江区',
		"parentid": '220600'
	},
	{
		"id": '220605',
		"shortname": '江源区',
		"parentid": '220600'
	},
	{
		"id": '220621',
		"shortname": '抚松县',
		"parentid": '220600'
	},
	{
		"id": '220702',
		"shortname": '宁江区',
		"parentid": '220700'
	},
	{
		"id": '220721',
		"shortname": '前郭尔罗斯蒙古族自治县',
		"parentid": '220700'
	},
	{
		"id": '220722',
		"shortname": '长岭县',
		"parentid": '220700'
	},
	{
		"id": '220723',
		"shortname": '乾安县',
		"parentid": '220700'
	},
	{
		"id": '220724',
		"shortname": '扶余县',
		"parentid": '220700'
	},
	{
		"id": '220802',
		"shortname": '洮北区',
		"parentid": '220800'
	},
	{
		"id": '220821',
		"shortname": '镇赉县',
		"parentid": '220800'
	},
	{
		"id": '220822',
		"shortname": '通榆县',
		"parentid": '220800'
	},
	{
		"id": '220881',
		"shortname": '洮南市',
		"parentid": '220800'
	},
	{
		"id": '220882',
		"shortname": '大安市',
		"parentid": '220800'
	},
	{
		"id": '222401',
		"shortname": '延吉市',
		"parentid": '222400'
	},
	{
		"id": '222402',
		"shortname": '图们市',
		"parentid": '222400'
	},
	{
		"id": '222404',
		"shortname": '珲春市',
		"parentid": '222400'
	},
	{
		"id": '222405',
		"shortname": '龙井市',
		"parentid": '222400'
	},
	{
		"id": '222406',
		"shortname": '和龙市',
		"parentid": '222400'
	},
	{
		"id": '222424',
		"shortname": '汪清县',
		"parentid": '222400'
	},
	{
		"id": '222426',
		"shortname": '安图县',
		"parentid": '222400'
	},
	{
		"id": '222403',
		"shortname": '敦化市',
		"parentid": '222400'
	},
	{
		"id": '230102',
		"shortname": '道里区',
		"parentid": '230100'
	},
	{
		"id": '230103',
		"shortname": '南岗区',
		"parentid": '230100'
	},
	{
		"id": '230104',
		"shortname": '道外区',
		"parentid": '230100'
	},
	{
		"id": '230108',
		"shortname": '平房区',
		"parentid": '230100'
	},
	{
		"id": '230109',
		"shortname": '松北区',
		"parentid": '230100'
	},
	{
		"id": '230110',
		"shortname": '香坊区',
		"parentid": '230100'
	},
	{
		"id": '230111',
		"shortname": '呼兰区',
		"parentid": '230100'
	},
	{
		"id": '230112',
		"shortname": '阿城区',
		"parentid": '230100'
	},
	{
		"id": '230123',
		"shortname": '依兰县',
		"parentid": '230100'
	},
	{
		"id": '230124',
		"shortname": '方正县',
		"parentid": '230100'
	},
	{
		"id": '230125',
		"shortname": '宾县',
		"parentid": '230100'
	},
	{
		"id": '230126',
		"shortname": '巴彦县',
		"parentid": '230100'
	},
	{
		"id": '230127',
		"shortname": '木兰县',
		"parentid": '230100'
	},
	{
		"id": '230128',
		"shortname": '通河县',
		"parentid": '230100'
	},
	{
		"id": '230129',
		"shortname": '延寿县',
		"parentid": '230100'
	},
	{
		"id": '230182',
		"shortname": '双城市',
		"parentid": '230100'
	},
	{
		"id": '230183',
		"shortname": '尚志市',
		"parentid": '230100'
	},
	{
		"id": '230184',
		"shortname": '五常市',
		"parentid": '230100'
	},
	{
		"id": '230202',
		"shortname": '龙沙区',
		"parentid": '230200'
	},
	{
		"id": '230203',
		"shortname": '建华区',
		"parentid": '230200'
	},
	{
		"id": '230204',
		"shortname": '铁锋区',
		"parentid": '230200'
	},
	{
		"id": '230205',
		"shortname": '昂昂溪区',
		"parentid": '230200'
	},
	{
		"id": '230206',
		"shortname": '富拉尔基区',
		"parentid": '230200'
	},
	{
		"id": '230207',
		"shortname": '碾子山区',
		"parentid": '230200'
	},
	{
		"id": '230208',
		"shortname": '梅里斯达斡尔族区',
		"parentid": '230200'
	},
	{
		"id": '230221',
		"shortname": '龙江县',
		"parentid": '230200'
	},
	{
		"id": '230223',
		"shortname": '依安县',
		"parentid": '230200'
	},
	{
		"id": '230224',
		"shortname": '泰来县',
		"parentid": '230200'
	},
	{
		"id": '230225',
		"shortname": '甘南县',
		"parentid": '230200'
	},
	{
		"id": '230227',
		"shortname": '富裕县',
		"parentid": '230200'
	},
	{
		"id": '230229',
		"shortname": '克山县',
		"parentid": '230200'
	},
	{
		"id": '230230',
		"shortname": '克东县',
		"parentid": '230200'
	},
	{
		"id": '230231',
		"shortname": '拜泉县',
		"parentid": '230200'
	},
	{
		"id": '230281',
		"shortname": '讷河市',
		"parentid": '230200'
	},
	{
		"id": '230302',
		"shortname": '鸡冠区',
		"parentid": '230300'
	},
	{
		"id": '230303',
		"shortname": '恒山区',
		"parentid": '230300'
	},
	{
		"id": '230304',
		"shortname": '滴道区',
		"parentid": '230300'
	},
	{
		"id": '230305',
		"shortname": '梨树区',
		"parentid": '230300'
	},
	{
		"id": '230306',
		"shortname": '城子河区',
		"parentid": '230300'
	},
	{
		"id": '230307',
		"shortname": '麻山区',
		"parentid": '230300'
	},
	{
		"id": '230321',
		"shortname": '鸡东县',
		"parentid": '230300'
	},
	{
		"id": '230381',
		"shortname": '虎林市',
		"parentid": '230300'
	},
	{
		"id": '230382',
		"shortname": '密山市',
		"parentid": '230300'
	},
	{
		"id": '230402',
		"shortname": '向阳区',
		"parentid": '230400'
	},
	{
		"id": '230403',
		"shortname": '工农区',
		"parentid": '230400'
	},
	{
		"id": '230404',
		"shortname": '南山区',
		"parentid": '230400'
	},
	{
		"id": '230405',
		"shortname": '兴安区',
		"parentid": '230400'
	},
	{
		"id": '230406',
		"shortname": '东山区',
		"parentid": '230400'
	},
	{
		"id": '230407',
		"shortname": '兴山区',
		"parentid": '230400'
	},
	{
		"id": '230421',
		"shortname": '萝北县',
		"parentid": '230400'
	},
	{
		"id": '230422',
		"shortname": '绥滨县',
		"parentid": '230400'
	},
	{
		"id": '230502',
		"shortname": '尖山区',
		"parentid": '230500'
	},
	{
		"id": '230503',
		"shortname": '岭东区',
		"parentid": '230500'
	},
	{
		"id": '230505',
		"shortname": '四方台区',
		"parentid": '230500'
	},
	{
		"id": '230506',
		"shortname": '宝山区',
		"parentid": '230500'
	},
	{
		"id": '230521',
		"shortname": '集贤县',
		"parentid": '230500'
	},
	{
		"id": '230522',
		"shortname": '友谊县',
		"parentid": '230500'
	},
	{
		"id": '230523',
		"shortname": '宝清县',
		"parentid": '230500'
	},
	{
		"id": '230524',
		"shortname": '饶河县',
		"parentid": '230500'
	},
	{
		"id": '230622',
		"shortname": '肇源县',
		"parentid": '230600'
	},
	{
		"id": '230623',
		"shortname": '林甸县',
		"parentid": '230600'
	},
	{
		"id": '230624',
		"shortname": '杜尔伯特蒙古族自治县',
		"parentid": '230600'
	},
	{
		"id": '230602',
		"shortname": '萨尔图区',
		"parentid": '230600'
	},
	{
		"id": '230603',
		"shortname": '龙凤区',
		"parentid": '230600'
	},
	{
		"id": '230604',
		"shortname": '让胡路区',
		"parentid": '230600'
	},
	{
		"id": '230605',
		"shortname": '红岗区',
		"parentid": '230600'
	},
	{
		"id": '230606',
		"shortname": '大同区',
		"parentid": '230600'
	},
	{
		"id": '230621',
		"shortname": '肇州县',
		"parentid": '230600'
	},
	{
		"id": '230702',
		"shortname": '伊春区',
		"parentid": '230700'
	},
	{
		"id": '230703',
		"shortname": '南岔区',
		"parentid": '230700'
	},
	{
		"id": '230704',
		"shortname": '友好区',
		"parentid": '230700'
	},
	{
		"id": '230705',
		"shortname": '西林区',
		"parentid": '230700'
	},
	{
		"id": '230706',
		"shortname": '翠峦区',
		"parentid": '230700'
	},
	{
		"id": '230707',
		"shortname": '新青区',
		"parentid": '230700'
	},
	{
		"id": '230709',
		"shortname": '金山屯区',
		"parentid": '230700'
	},
	{
		"id": '230711',
		"shortname": '乌马河区',
		"parentid": '230700'
	},
	{
		"id": '230712',
		"shortname": '汤旺河区',
		"parentid": '230700'
	},
	{
		"id": '230713',
		"shortname": '带岭区',
		"parentid": '230700'
	},
	{
		"id": '230714',
		"shortname": '乌伊岭区',
		"parentid": '230700'
	},
	{
		"id": '230715',
		"shortname": '红星区',
		"parentid": '230700'
	},
	{
		"id": '230716',
		"shortname": '上甘岭区',
		"parentid": '230700'
	},
	{
		"id": '230722',
		"shortname": '嘉荫县',
		"parentid": '230700'
	},
	{
		"id": '230781',
		"shortname": '铁力市',
		"parentid": '230700'
	},
	{
		"id": '230708',
		"shortname": '美溪区',
		"parentid": '230700'
	},
	{
		"id": '230710',
		"shortname": '五营区',
		"parentid": '230700'
	},
	{
		"id": '230803',
		"shortname": '向阳区',
		"parentid": '230800'
	},
	{
		"id": '230804',
		"shortname": '前进区',
		"parentid": '230800'
	},
	{
		"id": '230805',
		"shortname": '东风区',
		"parentid": '230800'
	},
	{
		"id": '230811',
		"shortname": '郊区',
		"parentid": '230800'
	},
	{
		"id": '230822',
		"shortname": '桦南县',
		"parentid": '230800'
	},
	{
		"id": '230826',
		"shortname": '桦川县',
		"parentid": '230800'
	},
	{
		"id": '230828',
		"shortname": '汤原县',
		"parentid": '230800'
	},
	{
		"id": '230833',
		"shortname": '抚远县',
		"parentid": '230800'
	},
	{
		"id": '230881',
		"shortname": '同江市',
		"parentid": '230800'
	},
	{
		"id": '230882',
		"shortname": '富锦市',
		"parentid": '230800'
	},
	{
		"id": '230902',
		"shortname": '新兴区',
		"parentid": '230900'
	},
	{
		"id": '230903',
		"shortname": '桃山区',
		"parentid": '230900'
	},
	{
		"id": '230904',
		"shortname": '茄子河区',
		"parentid": '230900'
	},
	{
		"id": '230921',
		"shortname": '勃利县',
		"parentid": '230900'
	},
	{
		"id": '231002',
		"shortname": '东安区',
		"parentid": '231000'
	},
	{
		"id": '231003',
		"shortname": '阳明区',
		"parentid": '231000'
	},
	{
		"id": '231004',
		"shortname": '爱民区',
		"parentid": '231000'
	},
	{
		"id": '231005',
		"shortname": '西安区',
		"parentid": '231000'
	},
	{
		"id": '231024',
		"shortname": '东宁县',
		"parentid": '231000'
	},
	{
		"id": '231025',
		"shortname": '林口县',
		"parentid": '231000'
	},
	{
		"id": '231081',
		"shortname": '绥芬河市',
		"parentid": '231000'
	},
	{
		"id": '231083',
		"shortname": '海林市',
		"parentid": '231000'
	},
	{
		"id": '231084',
		"shortname": '宁安市',
		"parentid": '231000'
	},
	{
		"id": '231085',
		"shortname": '穆棱市',
		"parentid": '231000'
	},
	{
		"id": '231102',
		"shortname": '爱辉区',
		"parentid": '231100'
	},
	{
		"id": '231121',
		"shortname": '嫩江县',
		"parentid": '231100'
	},
	{
		"id": '231123',
		"shortname": '逊克县',
		"parentid": '231100'
	},
	{
		"id": '231124',
		"shortname": '孙吴县',
		"parentid": '231100'
	},
	{
		"id": '231181',
		"shortname": '北安市',
		"parentid": '231100'
	},
	{
		"id": '231182',
		"shortname": '五大连池市',
		"parentid": '231100'
	},
	{
		"id": '231202',
		"shortname": '北林区',
		"parentid": '231200'
	},
	{
		"id": '231221',
		"shortname": '望奎县',
		"parentid": '231200'
	},
	{
		"id": '231222',
		"shortname": '兰西县',
		"parentid": '231200'
	},
	{
		"id": '231223',
		"shortname": '青冈县',
		"parentid": '231200'
	},
	{
		"id": '231224',
		"shortname": '庆安县',
		"parentid": '231200'
	},
	{
		"id": '231225',
		"shortname": '明水县',
		"parentid": '231200'
	},
	{
		"id": '231226',
		"shortname": '绥棱县',
		"parentid": '231200'
	},
	{
		"id": '231281',
		"shortname": '安达市',
		"parentid": '231200'
	},
	{
		"id": '231282',
		"shortname": '肇东市',
		"parentid": '231200'
	},
	{
		"id": '231283',
		"shortname": '海伦市',
		"parentid": '231200'
	},
	{
		"id": '232701',
		"shortname": '加格达奇区',
		"parentid": '232700'
	},
	{
		"id": '232702',
		"shortname": '松岭区',
		"parentid": '232700'
	},
	{
		"id": '232703',
		"shortname": '新林区',
		"parentid": '232700'
	},
	{
		"id": '232704',
		"shortname": '呼中区',
		"parentid": '232700'
	},
	{
		"id": '232721',
		"shortname": '呼玛县',
		"parentid": '232700'
	},
	{
		"id": '232722',
		"shortname": '塔河县',
		"parentid": '232700'
	},
	{
		"id": '232723',
		"shortname": '漠河县',
		"parentid": '232700'
	},
	{
		"id": '232740',
		"shortname": '加格达奇林业局',
		"parentid": '232700'
	},
	{
		"id": '232741',
		"shortname": '十八站林业局',
		"parentid": '232700'
	},
	{
		"id": '232742',
		"shortname": '图强林业局',
		"parentid": '232700'
	},
	{
		"id": '232743',
		"shortname": '阿木尔林业局',
		"parentid": '232700'
	},
	{
		"id": '232744',
		"shortname": '韩家园林业局',
		"parentid": '232700'
	},
	{
		"id": '232745',
		"shortname": '林管局农工商联合',
		"parentid": '232700'
	},
	{
		"id": '232801',
		"shortname": '牡丹江森工地区',
		"parentid": '232800'
	},
	{
		"id": '232802',
		"shortname": '松花江森工地区',
		"parentid": '232800'
	},
	{
		"id": '232803',
		"shortname": '合江森工地区',
		"parentid": '232800'
	},
	{
		"id": '232901',
		"shortname": '农垦总局直属地区',
		"parentid": '232900'
	},
	{
		"id": '232902',
		"shortname": '农垦宝泉岭分局',
		"parentid": '232900'
	},
	{
		"id": '232903',
		"shortname": '农垦红兴隆分局',
		"parentid": '232900'
	},
	{
		"id": '232904',
		"shortname": '农垦建三江分局',
		"parentid": '232900'
	},
	{
		"id": '232905',
		"shortname": '农垦牡丹江分局',
		"parentid": '232900'
	},
	{
		"id": '232906',
		"shortname": '农垦北安分局',
		"parentid": '232900'
	},
	{
		"id": '232907',
		"shortname": '农垦九三分局',
		"parentid": '232900'
	},
	{
		"id": '232908',
		"shortname": '农垦齐齐哈尔分局',
		"parentid": '232900'
	},
	{
		"id": '232909',
		"shortname": '农垦绥化分局',
		"parentid": '232900'
	},
	{
		"id": '232910',
		"shortname": '农垦哈尔滨分局',
		"parentid": '232900'
	},
	{
		"id": '320102',
		"shortname": '玄武区',
		"parentid": '320100'
	},
	{
		"id": '320103',
		"shortname": '白下区',
		"parentid": '320100'
	},
	{
		"id": '320104',
		"shortname": '秦淮区',
		"parentid": '320100'
	},
	{
		"id": '320105',
		"shortname": '建邺区',
		"parentid": '320100'
	},
	{
		"id": '320106',
		"shortname": '鼓楼区',
		"parentid": '320100'
	},
	{
		"id": '320107',
		"shortname": '下关区',
		"parentid": '320100'
	},
	{
		"id": '320111',
		"shortname": '浦口区',
		"parentid": '320100'
	},
	{
		"id": '320113',
		"shortname": '栖霞区',
		"parentid": '320100'
	},
	{
		"id": '320114',
		"shortname": '雨花台区',
		"parentid": '320100'
	},
	{
		"id": '320116',
		"shortname": '六合区',
		"parentid": '320100'
	},
	{
		"id": '320124',
		"shortname": '溧水县',
		"parentid": '320100'
	},
	{
		"id": '320125',
		"shortname": '高淳县',
		"parentid": '320100'
	},
	{
		"id": '320115',
		"shortname": '江宁区',
		"parentid": '320100'
	},
	{
		"id": '320202',
		"shortname": '崇安区',
		"parentid": '320200'
	},
	{
		"id": '320203',
		"shortname": '南长区',
		"parentid": '320200'
	},
	{
		"id": '320204',
		"shortname": '北塘区',
		"parentid": '320200'
	},
	{
		"id": '320205',
		"shortname": '锡山区',
		"parentid": '320200'
	},
	{
		"id": '320211',
		"shortname": '滨湖区',
		"parentid": '320200'
	},
	{
		"id": '320281',
		"shortname": '江阴市',
		"parentid": '320200'
	},
	{
		"id": '320282',
		"shortname": '宜兴市',
		"parentid": '320200'
	},
	{
		"id": '320213',
		"shortname": '梁溪区',
		"parentid": '320200'
	},
	{
		"id": '320206',
		"shortname": '惠山区',
		"parentid": '320200'
	},
	{
		"id": '320302',
		"shortname": '鼓楼区',
		"parentid": '320300'
	},
	{
		"id": '320303',
		"shortname": '云龙区',
		"parentid": '320300'
	},
	{
		"id": '320304',
		"shortname": '九里区',
		"parentid": '320300'
	},
	{
		"id": '320305',
		"shortname": '贾汪区',
		"parentid": '320300'
	},
	{
		"id": '320311',
		"shortname": '泉山区',
		"parentid": '320300'
	},
	{
		"id": '320321',
		"shortname": '丰县',
		"parentid": '320300'
	},
	{
		"id": '320322',
		"shortname": '沛县',
		"parentid": '320300'
	},
	{
		"id": '320323',
		"shortname": '铜山县',
		"parentid": '320300'
	},
	{
		"id": '320324',
		"shortname": '睢宁县',
		"parentid": '320300'
	},
	{
		"id": '320381',
		"shortname": '新沂市',
		"parentid": '320300'
	},
	{
		"id": '320382',
		"shortname": '邳州市',
		"parentid": '320300'
	},
	{
		"id": '320402',
		"shortname": '天宁区',
		"parentid": '320400'
	},
	{
		"id": '320404',
		"shortname": '钟楼区',
		"parentid": '320400'
	},
	{
		"id": '320405',
		"shortname": '戚墅堰区',
		"parentid": '320400'
	},
	{
		"id": '320411',
		"shortname": '新北区',
		"parentid": '320400'
	},
	{
		"id": '320412',
		"shortname": '武进区',
		"parentid": '320400'
	},
	{
		"id": '320481',
		"shortname": '溧阳市',
		"parentid": '320400'
	},
	{
		"id": '320482',
		"shortname": '金坛市',
		"parentid": '320400'
	},
	{
		"id": '320502',
		"shortname": '沧浪区',
		"parentid": '320500'
	},
	{
		"id": '320503',
		"shortname": '平江区',
		"parentid": '320500'
	},
	{
		"id": '320504',
		"shortname": '金阊区',
		"parentid": '320500'
	},
	{
		"id": '320506',
		"shortname": '吴中区',
		"parentid": '320500'
	},
	{
		"id": '320507',
		"shortname": '相城区',
		"parentid": '320500'
	},
	{
		"id": '320508',
		"shortname": '姑苏区',
		"parentid": '320500'
	},
	{
		"id": '320540',
		"shortname": '苏州工业园区',
		"parentid": '320500'
	},
	{
		"id": '320581',
		"shortname": '常熟市',
		"parentid": '320500'
	},
	{
		"id": '320582',
		"shortname": '张家港市',
		"parentid": '320500'
	},
	{
		"id": '320583',
		"shortname": '昆山市',
		"parentid": '320500'
	},
	{
		"id": '320584',
		"shortname": '吴江市',
		"parentid": '320500'
	},
	{
		"id": '320585',
		"shortname": '太仓市',
		"parentid": '320500'
	},
	{
		"id": '320505',
		"shortname": '虎丘区',
		"parentid": '320500'
	},
	{
		"id": '320602',
		"shortname": '崇川区',
		"parentid": '320600'
	},
	{
		"id": '320611',
		"shortname": '港闸区',
		"parentid": '320600'
	},
	{
		"id": '320612',
		"shortname": '通州区',
		"parentid": '320600'
	},
	{
		"id": '320621',
		"shortname": '海安县',
		"parentid": '320600'
	},
	{
		"id": '320623',
		"shortname": '如东县',
		"parentid": '320600'
	},
	{
		"id": '320681',
		"shortname": '启东市',
		"parentid": '320600'
	},
	{
		"id": '320682',
		"shortname": '如皋市',
		"parentid": '320600'
	},
	{
		"id": '320684',
		"shortname": '海门市',
		"parentid": '320600'
	},
	{
		"id": '320703',
		"shortname": '连云区',
		"parentid": '320700'
	},
	{
		"id": '320705',
		"shortname": '新浦区',
		"parentid": '320700'
	},
	{
		"id": '320706',
		"shortname": '海州区',
		"parentid": '320700'
	},
	{
		"id": '320721',
		"shortname": '赣榆县',
		"parentid": '320700'
	},
	{
		"id": '320722',
		"shortname": '东海县',
		"parentid": '320700'
	},
	{
		"id": '320723',
		"shortname": '灌云县',
		"parentid": '320700'
	},
	{
		"id": '320724',
		"shortname": '灌南县',
		"parentid": '320700'
	},
	{
		"id": '320802',
		"shortname": '清河区',
		"parentid": '320800'
	},
	{
		"id": '320804',
		"shortname": '淮阴区',
		"parentid": '320800'
	},
	{
		"id": '320811',
		"shortname": '清浦区',
		"parentid": '320800'
	},
	{
		"id": '320826',
		"shortname": '涟水县',
		"parentid": '320800'
	},
	{
		"id": '320829',
		"shortname": '洪泽县',
		"parentid": '320800'
	},
	{
		"id": '320830',
		"shortname": '盱眙县',
		"parentid": '320800'
	},
	{
		"id": '320831',
		"shortname": '金湖县',
		"parentid": '320800'
	},
	{
		"id": '320840',
		"shortname": '淮安经济开发区',
		"parentid": '320800'
	},
	{
		"id": '320803',
		"shortname": '淮安区',
		"parentid": '320800'
	},
	{
		"id": '320902',
		"shortname": '亭湖区',
		"parentid": '320900'
	},
	{
		"id": '320903',
		"shortname": '盐都区',
		"parentid": '320900'
	},
	{
		"id": '320921',
		"shortname": '响水县',
		"parentid": '320900'
	},
	{
		"id": '320922',
		"shortname": '滨海县',
		"parentid": '320900'
	},
	{
		"id": '320923',
		"shortname": '阜宁县',
		"parentid": '320900'
	},
	{
		"id": '320924',
		"shortname": '射阳县',
		"parentid": '320900'
	},
	{
		"id": '320925',
		"shortname": '建湖县',
		"parentid": '320900'
	},
	{
		"id": '320940',
		"shortname": '经济开发区',
		"parentid": '320900'
	},
	{
		"id": '320981',
		"shortname": '东台市',
		"parentid": '320900'
	},
	{
		"id": '320982',
		"shortname": '大丰市',
		"parentid": '320900'
	},
	{
		"id": '321002',
		"shortname": '广陵区',
		"parentid": '321000'
	},
	{
		"id": '321003',
		"shortname": '邗江区',
		"parentid": '321000'
	},
	{
		"id": '321011',
		"shortname": '维扬区',
		"parentid": '321000'
	},
	{
		"id": '321023',
		"shortname": '宝应县',
		"parentid": '321000'
	},
	{
		"id": '321081',
		"shortname": '仪征市',
		"parentid": '321000'
	},
	{
		"id": '321084',
		"shortname": '高邮市',
		"parentid": '321000'
	},
	{
		"id": '321088',
		"shortname": '江都市',
		"parentid": '321000'
	},
	{
		"id": '321102',
		"shortname": '京口区',
		"parentid": '321100'
	},
	{
		"id": '321111',
		"shortname": '润州区',
		"parentid": '321100'
	},
	{
		"id": '321112',
		"shortname": '丹徒区',
		"parentid": '321100'
	},
	{
		"id": '321181',
		"shortname": '丹阳市',
		"parentid": '321100'
	},
	{
		"id": '321182',
		"shortname": '扬中市',
		"parentid": '321100'
	},
	{
		"id": '321183',
		"shortname": '句容市',
		"parentid": '321100'
	},
	{
		"id": '321202',
		"shortname": '海陵区',
		"parentid": '321200'
	},
	{
		"id": '321203',
		"shortname": '高港区',
		"parentid": '321200'
	},
	{
		"id": '321281',
		"shortname": '兴化市',
		"parentid": '321200'
	},
	{
		"id": '321282',
		"shortname": '靖江市',
		"parentid": '321200'
	},
	{
		"id": '321283',
		"shortname": '泰兴市',
		"parentid": '321200'
	},
	{
		"id": '321284',
		"shortname": '姜堰市',
		"parentid": '321200'
	},
	{
		"id": '321302',
		"shortname": '宿城区',
		"parentid": '321300'
	},
	{
		"id": '321311',
		"shortname": '宿豫区',
		"parentid": '321300'
	},
	{
		"id": '321322',
		"shortname": '沭阳县',
		"parentid": '321300'
	},
	{
		"id": '321323',
		"shortname": '泗阳县',
		"parentid": '321300'
	},
	{
		"id": '321324',
		"shortname": '泗洪县',
		"parentid": '321300'
	},
	{
		"id": '330122',
		"shortname": '桐庐县',
		"parentid": '330100'
	},
	{
		"id": '330127',
		"shortname": '淳安县',
		"parentid": '330100'
	},
	{
		"id": '330182',
		"shortname": '建德市',
		"parentid": '330100'
	},
	{
		"id": '330183',
		"shortname": '富阳市',
		"parentid": '330100'
	},
	{
		"id": '330102',
		"shortname": '上城区',
		"parentid": '330100'
	},
	{
		"id": '330103',
		"shortname": '下城区',
		"parentid": '330100'
	},
	{
		"id": '330104',
		"shortname": '江干区',
		"parentid": '330100'
	},
	{
		"id": '330105',
		"shortname": '拱墅区',
		"parentid": '330100'
	},
	{
		"id": '330106',
		"shortname": '西湖区',
		"parentid": '330100'
	},
	{
		"id": '330108',
		"shortname": '滨江区',
		"parentid": '330100'
	},
	{
		"id": '330110',
		"shortname": '余杭区',
		"parentid": '330100'
	},
	{
		"id": '330185',
		"shortname": '临安市',
		"parentid": '330100'
	},
	{
		"id": '330109',
		"shortname": '萧山区',
		"parentid": '330100'
	},
	{
		"id": '330203',
		"shortname": '海曙区',
		"parentid": '330200'
	},
	{
		"id": '330204',
		"shortname": '江东区',
		"parentid": '330200'
	},
	{
		"id": '330205',
		"shortname": '江北区',
		"parentid": '330200'
	},
	{
		"id": '330206',
		"shortname": '北仑区',
		"parentid": '330200'
	},
	{
		"id": '330211',
		"shortname": '镇海区',
		"parentid": '330200'
	},
	{
		"id": '330212',
		"shortname": '鄞州区',
		"parentid": '330200'
	},
	{
		"id": '330225',
		"shortname": '象山县',
		"parentid": '330200'
	},
	{
		"id": '330226',
		"shortname": '宁海县',
		"parentid": '330200'
	},
	{
		"id": '330240',
		"shortname": '东钱湖区',
		"parentid": '330200'
	},
	{
		"id": '330241',
		"shortname": '开发区',
		"parentid": '330200'
	},
	{
		"id": '330242',
		"shortname": '保税区',
		"parentid": '330200'
	},
	{
		"id": '330243',
		"shortname": '大榭开发区',
		"parentid": '330200'
	},
	{
		"id": '330244',
		"shortname": '科技院区     ',
		"parentid": '330200'
	},
	{
		"id": '330281',
		"shortname": '余姚市',
		"parentid": '330200'
	},
	{
		"id": '330282',
		"shortname": '慈溪市',
		"parentid": '330200'
	},
	{
		"id": '330283',
		"shortname": '奉化市',
		"parentid": '330200'
	},
	{
		"id": '330302',
		"shortname": '鹿城区',
		"parentid": '330300'
	},
	{
		"id": '330303',
		"shortname": '龙湾区',
		"parentid": '330300'
	},
	{
		"id": '330304',
		"shortname": '瓯海区',
		"parentid": '330300'
	},
	{
		"id": '330322',
		"shortname": '洞头县',
		"parentid": '330300'
	},
	{
		"id": '330324',
		"shortname": '永嘉县',
		"parentid": '330300'
	},
	{
		"id": '330326',
		"shortname": '平阳县',
		"parentid": '330300'
	},
	{
		"id": '330327',
		"shortname": '苍南县',
		"parentid": '330300'
	},
	{
		"id": '330328',
		"shortname": '文成县',
		"parentid": '330300'
	},
	{
		"id": '330340',
		"shortname": '开发区',
		"parentid": '330300'
	},
	{
		"id": '330381',
		"shortname": '瑞安市',
		"parentid": '330300'
	},
	{
		"id": '330382',
		"shortname": '乐清市',
		"parentid": '330300'
	},
	{
		"id": '330329',
		"shortname": '泰顺县',
		"parentid": '330300'
	},
	{
		"id": '330421',
		"shortname": '嘉善县',
		"parentid": '330400'
	},
	{
		"id": '330424',
		"shortname": '海盐县',
		"parentid": '330400'
	},
	{
		"id": '330481',
		"shortname": '海宁市',
		"parentid": '330400'
	},
	{
		"id": '330483',
		"shortname": '桐乡市',
		"parentid": '330400'
	},
	{
		"id": '330482',
		"shortname": '平湖市',
		"parentid": '330400'
	},
	{
		"id": '330521',
		"shortname": '德清县',
		"parentid": '330500'
	},
	{
		"id": '330522',
		"shortname": '长兴县',
		"parentid": '330500'
	},
	{
		"id": '330523',
		"shortname": '安吉县',
		"parentid": '330500'
	},
	{
		"id": '330621',
		"shortname": '绍兴县',
		"parentid": '330600'
	},
	{
		"id": '330624',
		"shortname": '新昌县',
		"parentid": '330600'
	},
	{
		"id": '330682',
		"shortname": '上虞市',
		"parentid": '330600'
	},
	{
		"id": '330683',
		"shortname": '嵊州市',
		"parentid": '330600'
	},
	{
		"id": '330681',
		"shortname": '诸暨市',
		"parentid": '330600'
	},
	{
		"id": '330723',
		"shortname": '武义县',
		"parentid": '330700'
	},
	{
		"id": '330726',
		"shortname": '浦江县',
		"parentid": '330700'
	},
	{
		"id": '330727',
		"shortname": '磐安县',
		"parentid": '330700'
	},
	{
		"id": '330781',
		"shortname": '兰溪市',
		"parentid": '330700'
	},
	{
		"id": '330783',
		"shortname": '东阳市',
		"parentid": '330700'
	},
	{
		"id": '330784',
		"shortname": '永康市',
		"parentid": '330700'
	},
	{
		"id": '330782',
		"shortname": '义乌市',
		"parentid": '330700'
	},
	{
		"id": '330802',
		"shortname": '柯城区',
		"parentid": '330800'
	},
	{
		"id": '330803',
		"shortname": '衢江区',
		"parentid": '330800'
	},
	{
		"id": '330822',
		"shortname": '常山县',
		"parentid": '330800'
	},
	{
		"id": '330824',
		"shortname": '开化县',
		"parentid": '330800'
	},
	{
		"id": '330825',
		"shortname": '龙游县',
		"parentid": '330800'
	},
	{
		"id": '330881',
		"shortname": '江山市',
		"parentid": '330800'
	},
	{
		"id": '330903',
		"shortname": '普陀区',
		"parentid": '330900'
	},
	{
		"id": '330921',
		"shortname": '岱山县',
		"parentid": '330900'
	},
	{
		"id": '330922',
		"shortname": '嵊泗县',
		"parentid": '330900'
	},
	{
		"id": '331002',
		"shortname": '椒江区',
		"parentid": '331000'
	},
	{
		"id": '331003',
		"shortname": '黄岩区',
		"parentid": '331000'
	},
	{
		"id": '331004',
		"shortname": '路桥区',
		"parentid": '331000'
	},
	{
		"id": '331021',
		"shortname": '玉环县',
		"parentid": '331000'
	},
	{
		"id": '331022',
		"shortname": '三门县',
		"parentid": '331000'
	},
	{
		"id": '331023',
		"shortname": '天台县',
		"parentid": '331000'
	},
	{
		"id": '331024',
		"shortname": '仙居县',
		"parentid": '331000'
	},
	{
		"id": '331081',
		"shortname": '温岭市',
		"parentid": '331000'
	},
	{
		"id": '331082',
		"shortname": '临海市',
		"parentid": '331000'
	},
	{
		"id": '331102',
		"shortname": '莲都区',
		"parentid": '331100'
	},
	{
		"id": '331121',
		"shortname": '青田县',
		"parentid": '331100'
	},
	{
		"id": '331122',
		"shortname": '缙云县',
		"parentid": '331100'
	},
	{
		"id": '331123',
		"shortname": '遂昌县',
		"parentid": '331100'
	},
	{
		"id": '331124',
		"shortname": '松阳县',
		"parentid": '331100'
	},
	{
		"id": '331125',
		"shortname": '云和县',
		"parentid": '331100'
	},
	{
		"id": '331126',
		"shortname": '庆元县',
		"parentid": '331100'
	},
	{
		"id": '331127',
		"shortname": '景宁畲族自治县',
		"parentid": '331100'
	},
	{
		"id": '331181',
		"shortname": '龙泉市',
		"parentid": '331100'
	},
	{
		"id": '340102',
		"shortname": '瑶海区',
		"parentid": '340100'
	},
	{
		"id": '340103',
		"shortname": '庐阳区',
		"parentid": '340100'
	},
	{
		"id": '340104',
		"shortname": '蜀山区',
		"parentid": '340100'
	},
	{
		"id": '340111',
		"shortname": '包河区',
		"parentid": '340100'
	},
	{
		"id": '340121',
		"shortname": '长丰县',
		"parentid": '340100'
	},
	{
		"id": '340122',
		"shortname": '肥东县',
		"parentid": '340100'
	},
	{
		"id": '340123',
		"shortname": '肥西县',
		"parentid": '340100'
	},
	{
		"id": '340202',
		"shortname": '镜湖区',
		"parentid": '340200'
	},
	{
		"id": '340203',
		"shortname": '弋江区',
		"parentid": '340200'
	},
	{
		"id": '340207',
		"shortname": '鸠江区',
		"parentid": '340200'
	},
	{
		"id": '340208',
		"shortname": '三山区',
		"parentid": '340200'
	},
	{
		"id": '340221',
		"shortname": '芜湖县',
		"parentid": '340200'
	},
	{
		"id": '340222',
		"shortname": '繁昌县',
		"parentid": '340200'
	},
	{
		"id": '340223',
		"shortname": '南陵县',
		"parentid": '340200'
	},
	{
		"id": '340240',
		"shortname": '芜湖经济技术开发区',
		"parentid": '340200'
	},
	{
		"id": '340321',
		"shortname": '怀远县',
		"parentid": '340300'
	},
	{
		"id": '340322',
		"shortname": '五河县',
		"parentid": '340300'
	},
	{
		"id": '340323',
		"shortname": '固镇县',
		"parentid": '340300'
	},
	{
		"id": '340421',
		"shortname": '凤台县',
		"parentid": '340400'
	},
	{
		"id": '340406',
		"shortname": '潘集区',
		"parentid": '340400'
	},
	{
		"id": '340521',
		"shortname": '当涂县',
		"parentid": '340500'
	},
	{
		"id": '340602',
		"shortname": '杜集区',
		"parentid": '340600'
	},
	{
		"id": '340604',
		"shortname": '烈山区',
		"parentid": '340600'
	},
	{
		"id": '340621',
		"shortname": '濉溪县',
		"parentid": '340600'
	},
	{
		"id": '340702',
		"shortname": '铜官山区',
		"parentid": '340700'
	},
	{
		"id": '340703',
		"shortname": '狮子山区',
		"parentid": '340700'
	},
	{
		"id": '340711',
		"shortname": '郊区',
		"parentid": '340700'
	},
	{
		"id": '340721',
		"shortname": '铜陵县',
		"parentid": '340700'
	},
	{
		"id": '340822',
		"shortname": '怀宁县',
		"parentid": '340800'
	},
	{
		"id": '340823',
		"shortname": '枞阳县',
		"parentid": '340800'
	},
	{
		"id": '340824',
		"shortname": '潜山县',
		"parentid": '340800'
	},
	{
		"id": '340825',
		"shortname": '太湖县',
		"parentid": '340800'
	},
	{
		"id": '340826',
		"shortname": '宿松县',
		"parentid": '340800'
	},
	{
		"id": '340827',
		"shortname": '望江县',
		"parentid": '340800'
	},
	{
		"id": '340828',
		"shortname": '岳西县',
		"parentid": '340800'
	},
	{
		"id": '340881',
		"shortname": '桐城市',
		"parentid": '340800'
	},
	{
		"id": '341002',
		"shortname": '屯溪区',
		"parentid": '341000'
	},
	{
		"id": '341003',
		"shortname": '黄山区',
		"parentid": '341000'
	},
	{
		"id": '341004',
		"shortname": '徽州区',
		"parentid": '341000'
	},
	{
		"id": '341021',
		"shortname": '歙县',
		"parentid": '341000'
	},
	{
		"id": '341022',
		"shortname": '休宁县',
		"parentid": '341000'
	},
	{
		"id": '341023',
		"shortname": '黟县',
		"parentid": '341000'
	},
	{
		"id": '341024',
		"shortname": '祁门县',
		"parentid": '341000'
	},
	{
		"id": '341102',
		"shortname": '琅琊区',
		"parentid": '341100'
	},
	{
		"id": '341122',
		"shortname": '来安县',
		"parentid": '341100'
	},
	{
		"id": '341124',
		"shortname": '全椒县',
		"parentid": '341100'
	},
	{
		"id": '341125',
		"shortname": '定远县',
		"parentid": '341100'
	},
	{
		"id": '341126',
		"shortname": '凤阳县',
		"parentid": '341100'
	},
	{
		"id": '341181',
		"shortname": '天长市',
		"parentid": '341100'
	},
	{
		"id": '341182',
		"shortname": '明光市',
		"parentid": '341100'
	},
	{
		"id": '341221',
		"shortname": '临泉县',
		"parentid": '341200'
	},
	{
		"id": '341222',
		"shortname": '太和县',
		"parentid": '341200'
	},
	{
		"id": '341225',
		"shortname": '阜南县',
		"parentid": '341200'
	},
	{
		"id": '341226',
		"shortname": '颍上县',
		"parentid": '341200'
	},
	{
		"id": '341282',
		"shortname": '界首市',
		"parentid": '341200'
	},
	{
		"id": '341302',
		"shortname": '埇桥区',
		"parentid": '341300'
	},
	{
		"id": '341321',
		"shortname": '砀山县',
		"parentid": '341300'
	},
	{
		"id": '341322',
		"shortname": '萧县',
		"parentid": '341300'
	},
	{
		"id": '341323',
		"shortname": '灵璧县',
		"parentid": '341300'
	},
	{
		"id": '341324',
		"shortname": '泗县',
		"parentid": '341300'
	},
	{
		"id": '341402',
		"shortname": '居巢区',
		"parentid": '341400'
	},
	{
		"id": '341421',
		"shortname": '庐江县',
		"parentid": '341400'
	},
	{
		"id": '341422',
		"shortname": '无为县',
		"parentid": '341400'
	},
	{
		"id": '341423',
		"shortname": '含山县',
		"parentid": '341400'
	},
	{
		"id": '341424',
		"shortname": '和县',
		"parentid": '341400'
	},
	{
		"id": '341502',
		"shortname": '金安区',
		"parentid": '341500'
	},
	{
		"id": '341503',
		"shortname": '裕安区',
		"parentid": '341500'
	},
	{
		"id": '341521',
		"shortname": '寿县',
		"parentid": '341500'
	},
	{
		"id": '341522',
		"shortname": '霍邱县',
		"parentid": '341500'
	},
	{
		"id": '341523',
		"shortname": '舒城县',
		"parentid": '341500'
	},
	{
		"id": '341524',
		"shortname": '金寨县',
		"parentid": '341500'
	},
	{
		"id": '341525',
		"shortname": '霍山县',
		"parentid": '341500'
	},
	{
		"id": '341540',
		"shortname": '叶集',
		"parentid": '341500'
	},
	{
		"id": '341621',
		"shortname": '涡阳县',
		"parentid": '341600'
	},
	{
		"id": '341622',
		"shortname": '蒙城县',
		"parentid": '341600'
	},
	{
		"id": '341623',
		"shortname": '利辛县',
		"parentid": '341600'
	},
	{
		"id": '341702',
		"shortname": '贵池区',
		"parentid": '341700'
	},
	{
		"id": '341721',
		"shortname": '东至县',
		"parentid": '341700'
	},
	{
		"id": '341722',
		"shortname": '石台县',
		"parentid": '341700'
	},
	{
		"id": '341723',
		"shortname": '青阳县',
		"parentid": '341700'
	},
	{
		"id": '341740',
		"shortname": '九华山风景区',
		"parentid": '341700'
	},
	{
		"id": '341802',
		"shortname": '宣州区',
		"parentid": '341800'
	},
	{
		"id": '341821',
		"shortname": '郎溪县',
		"parentid": '341800'
	},
	{
		"id": '341822',
		"shortname": '广德县',
		"parentid": '341800'
	},
	{
		"id": '341823',
		"shortname": '泾县',
		"parentid": '341800'
	},
	{
		"id": '341824',
		"shortname": '绩溪县',
		"parentid": '341800'
	},
	{
		"id": '341825',
		"shortname": '旌德县',
		"parentid": '341800'
	},
	{
		"id": '341881',
		"shortname": '宁国市',
		"parentid": '341800'
	},
	{
		"id": '350105',
		"shortname": '马尾区',
		"parentid": '350100'
	},
	{
		"id": '350102',
		"shortname": '鼓楼区',
		"parentid": '350100'
	},
	{
		"id": '350103',
		"shortname": '台江区',
		"parentid": '350100'
	},
	{
		"id": '350104',
		"shortname": '仓山区',
		"parentid": '350100'
	},
	{
		"id": '350111',
		"shortname": '晋安区',
		"parentid": '350100'
	},
	{
		"id": '350121',
		"shortname": '闽侯县',
		"parentid": '350100'
	},
	{
		"id": '350122',
		"shortname": '连江县',
		"parentid": '350100'
	},
	{
		"id": '350123',
		"shortname": '罗源县',
		"parentid": '350100'
	},
	{
		"id": '350124',
		"shortname": '闽清县',
		"parentid": '350100'
	},
	{
		"id": '350125',
		"shortname": '永泰县',
		"parentid": '350100'
	},
	{
		"id": '350128',
		"shortname": '平潭县',
		"parentid": '350100'
	},
	{
		"id": '350181',
		"shortname": '福清市',
		"parentid": '350100'
	},
	{
		"id": '350182',
		"shortname": '长乐市',
		"parentid": '350100'
	},
	{
		"id": '350203',
		"shortname": '思明区',
		"parentid": '350200'
	},
	{
		"id": '350205',
		"shortname": '海沧区',
		"parentid": '350200'
	},
	{
		"id": '350206',
		"shortname": '湖里区',
		"parentid": '350200'
	},
	{
		"id": '350211',
		"shortname": '集美区',
		"parentid": '350200'
	},
	{
		"id": '350212',
		"shortname": '同安区',
		"parentid": '350200'
	},
	{
		"id": '350213',
		"shortname": '翔安区',
		"parentid": '350200'
	},
	{
		"id": '350302',
		"shortname": '城厢区',
		"parentid": '350300'
	},
	{
		"id": '350303',
		"shortname": '涵江区',
		"parentid": '350300'
	},
	{
		"id": '350304',
		"shortname": '荔城区',
		"parentid": '350300'
	},
	{
		"id": '350305',
		"shortname": '秀屿区',
		"parentid": '350300'
	},
	{
		"id": '350322',
		"shortname": '仙游县',
		"parentid": '350300'
	},
	{
		"id": '350340',
		"shortname": '湄洲岛',
		"parentid": '350300'
	},
	{
		"id": '350341',
		"shortname": '湄洲湾北岸',
		"parentid": '350300'
	},
	{
		"id": '350429',
		"shortname": '泰宁县',
		"parentid": '350400'
	},
	{
		"id": '350430',
		"shortname": '建宁县',
		"parentid": '350400'
	},
	{
		"id": '350481',
		"shortname": '永安市',
		"parentid": '350400'
	},
	{
		"id": '350402',
		"shortname": '梅列区',
		"parentid": '350400'
	},
	{
		"id": '350403',
		"shortname": '三元区',
		"parentid": '350400'
	},
	{
		"id": '350421',
		"shortname": '明溪县',
		"parentid": '350400'
	},
	{
		"id": '350423',
		"shortname": '清流县',
		"parentid": '350400'
	},
	{
		"id": '350424',
		"shortname": '宁化县',
		"parentid": '350400'
	},
	{
		"id": '350425',
		"shortname": '大田县',
		"parentid": '350400'
	},
	{
		"id": '350426',
		"shortname": '尤溪县',
		"parentid": '350400'
	},
	{
		"id": '350427',
		"shortname": '沙县',
		"parentid": '350400'
	},
	{
		"id": '350428',
		"shortname": '将乐县',
		"parentid": '350400'
	},
	{
		"id": '350502',
		"shortname": '鲤城区',
		"parentid": '350500'
	},
	{
		"id": '350503',
		"shortname": '丰泽区',
		"parentid": '350500'
	},
	{
		"id": '350504',
		"shortname": '洛江区',
		"parentid": '350500'
	},
	{
		"id": '350505',
		"shortname": '泉港区',
		"parentid": '350500'
	},
	{
		"id": '350521',
		"shortname": '惠安县',
		"parentid": '350500'
	},
	{
		"id": '350524',
		"shortname": '安溪县',
		"parentid": '350500'
	},
	{
		"id": '350525',
		"shortname": '永春县',
		"parentid": '350500'
	},
	{
		"id": '350526',
		"shortname": '德化县',
		"parentid": '350500'
	},
	{
		"id": '350527',
		"shortname": '金门县',
		"parentid": '350500'
	},
	{
		"id": '350581',
		"shortname": '石狮市',
		"parentid": '350500'
	},
	{
		"id": '350582',
		"shortname": '晋江市',
		"parentid": '350500'
	},
	{
		"id": '350583',
		"shortname": '南安市',
		"parentid": '350500'
	},
	{
		"id": '350602',
		"shortname": '芗城区',
		"parentid": '350600'
	},
	{
		"id": '350603',
		"shortname": '龙文区',
		"parentid": '350600'
	},
	{
		"id": '350622',
		"shortname": '云霄县',
		"parentid": '350600'
	},
	{
		"id": '350623',
		"shortname": '漳浦县',
		"parentid": '350600'
	},
	{
		"id": '350624',
		"shortname": '诏安县',
		"parentid": '350600'
	},
	{
		"id": '350625',
		"shortname": '长泰县',
		"parentid": '350600'
	},
	{
		"id": '350626',
		"shortname": '东山县',
		"parentid": '350600'
	},
	{
		"id": '350627',
		"shortname": '南靖县',
		"parentid": '350600'
	},
	{
		"id": '350628',
		"shortname": '平和县',
		"parentid": '350600'
	},
	{
		"id": '350629',
		"shortname": '华安县',
		"parentid": '350600'
	},
	{
		"id": '350640',
		"shortname": '常山开发区',
		"parentid": '350600'
	},
	{
		"id": '350681',
		"shortname": '龙海市',
		"parentid": '350600'
	},
	{
		"id": '350781',
		"shortname": '邵武市',
		"parentid": '350700'
	},
	{
		"id": '350782',
		"shortname": '武夷山市',
		"parentid": '350700'
	},
	{
		"id": '350783',
		"shortname": '建瓯市',
		"parentid": '350700'
	},
	{
		"id": '350784',
		"shortname": '建阳市',
		"parentid": '350700'
	},
	{
		"id": '350702',
		"shortname": '延平区',
		"parentid": '350700'
	},
	{
		"id": '350721',
		"shortname": '顺昌县',
		"parentid": '350700'
	},
	{
		"id": '350722',
		"shortname": '浦城县',
		"parentid": '350700'
	},
	{
		"id": '350723',
		"shortname": '光泽县',
		"parentid": '350700'
	},
	{
		"id": '350724',
		"shortname": '松溪县',
		"parentid": '350700'
	},
	{
		"id": '350725',
		"shortname": '政和县',
		"parentid": '350700'
	},
	{
		"id": '350802',
		"shortname": '新罗区',
		"parentid": '350800'
	},
	{
		"id": '350821',
		"shortname": '长汀县',
		"parentid": '350800'
	},
	{
		"id": '350822',
		"shortname": '永定县',
		"parentid": '350800'
	},
	{
		"id": '350823',
		"shortname": '上杭县',
		"parentid": '350800'
	},
	{
		"id": '350824',
		"shortname": '武平县',
		"parentid": '350800'
	},
	{
		"id": '350825',
		"shortname": '连城县',
		"parentid": '350800'
	},
	{
		"id": '350881',
		"shortname": '漳平市',
		"parentid": '350800'
	},
	{
		"id": '350902',
		"shortname": '蕉城区',
		"parentid": '350900'
	},
	{
		"id": '350921',
		"shortname": '霞浦县',
		"parentid": '350900'
	},
	{
		"id": '350922',
		"shortname": '古田县',
		"parentid": '350900'
	},
	{
		"id": '350923',
		"shortname": '屏南县',
		"parentid": '350900'
	},
	{
		"id": '350924',
		"shortname": '寿宁县',
		"parentid": '350900'
	},
	{
		"id": '350925',
		"shortname": '周宁县',
		"parentid": '350900'
	},
	{
		"id": '350926',
		"shortname": '柘荣县',
		"parentid": '350900'
	},
	{
		"id": '350981',
		"shortname": '福安市',
		"parentid": '350900'
	},
	{
		"id": '350982',
		"shortname": '福鼎市',
		"parentid": '350900'
	},
	{
		"id": '360112',
		"shortname": '新建区',
		"parentid": '360100'
	},
	{
		"id": '360102',
		"shortname": '东湖区',
		"parentid": '360100'
	},
	{
		"id": '360103',
		"shortname": '西湖区',
		"parentid": '360100'
	},
	{
		"id": '360104',
		"shortname": '青云谱区',
		"parentid": '360100'
	},
	{
		"id": '360105',
		"shortname": '湾里区',
		"parentid": '360100'
	},
	{
		"id": '360106',
		"shortname": '红谷滩新区',
		"parentid": '360100'
	},
	{
		"id": '360111',
		"shortname": '青山湖区',
		"parentid": '360100'
	},
	{
		"id": '360113',
		"shortname": '高新区',
		"parentid": '360100'
	},
	{
		"id": '360121',
		"shortname": '南昌县',
		"parentid": '360100'
	},
	{
		"id": '360122',
		"shortname": '新建县',
		"parentid": '360100'
	},
	{
		"id": '360123',
		"shortname": '安义县',
		"parentid": '360100'
	},
	{
		"id": '360124',
		"shortname": '进贤县',
		"parentid": '360100'
	},
	{
		"id": '360150',
		"shortname": '英雄开发区',
		"parentid": '360100'
	},
	{
		"id": '360151',
		"shortname": '桑海开发区',
		"parentid": '360100'
	},
	{
		"id": '360202',
		"shortname": '昌江区',
		"parentid": '360200'
	},
	{
		"id": '360203',
		"shortname": '珠山区',
		"parentid": '360200'
	},
	{
		"id": '360222',
		"shortname": '浮梁县',
		"parentid": '360200'
	},
	{
		"id": '360281',
		"shortname": '乐平市',
		"parentid": '360200'
	},
	{
		"id": '360302',
		"shortname": '安源区',
		"parentid": '360300'
	},
	{
		"id": '360313',
		"shortname": '湘东区',
		"parentid": '360300'
	},
	{
		"id": '360321',
		"shortname": '莲花县',
		"parentid": '360300'
	},
	{
		"id": '360322',
		"shortname": '上栗县',
		"parentid": '360300'
	},
	{
		"id": '360323',
		"shortname": '芦溪县',
		"parentid": '360300'
	},
	{
		"id": '360340',
		"shortname": '萍乡经济开发区',
		"parentid": '360300'
	},
	{
		"id": '360402',
		"shortname": '濂溪区',
		"parentid": '360400'
	},
	{
		"id": '360403',
		"shortname": '浔阳区',
		"parentid": '360400'
	},
	{
		"id": '360421',
		"shortname": '九江县',
		"parentid": '360400'
	},
	{
		"id": '360423',
		"shortname": '武宁县',
		"parentid": '360400'
	},
	{
		"id": '360424',
		"shortname": '修水县',
		"parentid": '360400'
	},
	{
		"id": '360425',
		"shortname": '永修县',
		"parentid": '360400'
	},
	{
		"id": '360426',
		"shortname": '德安县',
		"parentid": '360400'
	},
	{
		"id": '360427',
		"shortname": '星子县',
		"parentid": '360400'
	},
	{
		"id": '360428',
		"shortname": '都昌县',
		"parentid": '360400'
	},
	{
		"id": '360429',
		"shortname": '湖口县',
		"parentid": '360400'
	},
	{
		"id": '360430',
		"shortname": '彭泽县',
		"parentid": '360400'
	},
	{
		"id": '360440',
		"shortname": '开发区',
		"parentid": '360400'
	},
	{
		"id": '360441',
		"shortname": '庐山局',
		"parentid": '360400'
	},
	{
		"id": '360442',
		"shortname": '共青城开放开发区',
		"parentid": '360400'
	},
	{
		"id": '360481',
		"shortname": '瑞昌市',
		"parentid": '360400'
	},
	{
		"id": '360502',
		"shortname": '渝水区',
		"parentid": '360500'
	},
	{
		"id": '360521',
		"shortname": '分宜县',
		"parentid": '360500'
	},
	{
		"id": '360540',
		"shortname": '仙女湖区',
		"parentid": '360500'
	},
	{
		"id": '360541',
		"shortname": '新余高新技术产业园区',
		"parentid": '360500'
	},
	{
		"id": '360542',
		"shortname": '孔目江生态经济区',
		"parentid": '360500'
	},
	{
		"id": '360602',
		"shortname": '月湖区',
		"parentid": '360600'
	},
	{
		"id": '360622',
		"shortname": '余江县',
		"parentid": '360600'
	},
	{
		"id": '360681',
		"shortname": '贵溪市',
		"parentid": '360600'
	},
	{
		"id": '360721',
		"shortname": '赣县',
		"parentid": '360700'
	},
	{
		"id": '360722',
		"shortname": '信丰县',
		"parentid": '360700'
	},
	{
		"id": '360723',
		"shortname": '大余县',
		"parentid": '360700'
	},
	{
		"id": '360724',
		"shortname": '上犹县',
		"parentid": '360700'
	},
	{
		"id": '360725',
		"shortname": '崇义县',
		"parentid": '360700'
	},
	{
		"id": '360726',
		"shortname": '安远县',
		"parentid": '360700'
	},
	{
		"id": '360727',
		"shortname": '龙南县',
		"parentid": '360700'
	},
	{
		"id": '360728',
		"shortname": '定南县',
		"parentid": '360700'
	},
	{
		"id": '360729',
		"shortname": '全南县',
		"parentid": '360700'
	},
	{
		"id": '360730',
		"shortname": '宁都县',
		"parentid": '360700'
	},
	{
		"id": '360731',
		"shortname": '于都县',
		"parentid": '360700'
	},
	{
		"id": '360732',
		"shortname": '兴国县',
		"parentid": '360700'
	},
	{
		"id": '360733',
		"shortname": '会昌县',
		"parentid": '360700'
	},
	{
		"id": '360734',
		"shortname": '寻乌县',
		"parentid": '360700'
	},
	{
		"id": '360735',
		"shortname": '石城县',
		"parentid": '360700'
	},
	{
		"id": '360781',
		"shortname": '瑞金市',
		"parentid": '360700'
	},
	{
		"id": '360782',
		"shortname": '南康市',
		"parentid": '360700'
	},
	{
		"id": '360702',
		"shortname": '章贡区',
		"parentid": '360700'
	},
	{
		"id": '360802',
		"shortname": '吉州区',
		"parentid": '360800'
	},
	{
		"id": '360803',
		"shortname": '青原区',
		"parentid": '360800'
	},
	{
		"id": '360821',
		"shortname": '吉安县',
		"parentid": '360800'
	},
	{
		"id": '360822',
		"shortname": '吉水县',
		"parentid": '360800'
	},
	{
		"id": '360823',
		"shortname": '峡江县',
		"parentid": '360800'
	},
	{
		"id": '360824',
		"shortname": '新干县',
		"parentid": '360800'
	},
	{
		"id": '360825',
		"shortname": '永丰县',
		"parentid": '360800'
	},
	{
		"id": '360826',
		"shortname": '泰和县',
		"parentid": '360800'
	},
	{
		"id": '360827',
		"shortname": '遂川县',
		"parentid": '360800'
	},
	{
		"id": '360828',
		"shortname": '万安县',
		"parentid": '360800'
	},
	{
		"id": '360829',
		"shortname": '安福县',
		"parentid": '360800'
	},
	{
		"id": '360830',
		"shortname": '永新县',
		"parentid": '360800'
	},
	{
		"id": '360881',
		"shortname": '井冈山市',
		"parentid": '360800'
	},
	{
		"id": '360902',
		"shortname": '袁州区',
		"parentid": '360900'
	},
	{
		"id": '360921',
		"shortname": '奉新县',
		"parentid": '360900'
	},
	{
		"id": '360922',
		"shortname": '万载县',
		"parentid": '360900'
	},
	{
		"id": '360923',
		"shortname": '上高县',
		"parentid": '360900'
	},
	{
		"id": '360924',
		"shortname": '宜丰县',
		"parentid": '360900'
	},
	{
		"id": '360925',
		"shortname": '靖安县',
		"parentid": '360900'
	},
	{
		"id": '360926',
		"shortname": '铜鼓县',
		"parentid": '360900'
	},
	{
		"id": '360981',
		"shortname": '丰城市',
		"parentid": '360900'
	},
	{
		"id": '360982',
		"shortname": '樟树市',
		"parentid": '360900'
	},
	{
		"id": '360983',
		"shortname": '高安市',
		"parentid": '360900'
	},
	{
		"id": '361021',
		"shortname": '南城县',
		"parentid": '361000'
	},
	{
		"id": '361022',
		"shortname": '黎川县',
		"parentid": '361000'
	},
	{
		"id": '361023',
		"shortname": '南丰县',
		"parentid": '361000'
	},
	{
		"id": '361024',
		"shortname": '崇仁县',
		"parentid": '361000'
	},
	{
		"id": '361025',
		"shortname": '乐安县',
		"parentid": '361000'
	},
	{
		"id": '361026',
		"shortname": '宜黄县',
		"parentid": '361000'
	},
	{
		"id": '361027',
		"shortname": '金溪县',
		"parentid": '361000'
	},
	{
		"id": '361028',
		"shortname": '资溪县',
		"parentid": '361000'
	},
	{
		"id": '361029',
		"shortname": '东乡县',
		"parentid": '361000'
	},
	{
		"id": '361030',
		"shortname": '广昌县',
		"parentid": '361000'
	},
	{
		"id": '361040',
		"shortname": '金巢区',
		"parentid": '361000'
	},
	{
		"id": '361002',
		"shortname": '临川区',
		"parentid": '361000'
	},
	{
		"id": '361128',
		"shortname": '鄱阳县',
		"parentid": '361100'
	},
	{
		"id": '361102',
		"shortname": '信州区',
		"parentid": '361100'
	},
	{
		"id": '361121',
		"shortname": '上饶县',
		"parentid": '361100'
	},
	{
		"id": '361122',
		"shortname": '广丰县',
		"parentid": '361100'
	},
	{
		"id": '361123',
		"shortname": '玉山县',
		"parentid": '361100'
	},
	{
		"id": '361124',
		"shortname": '铅山县',
		"parentid": '361100'
	},
	{
		"id": '361125',
		"shortname": '横峰县',
		"parentid": '361100'
	},
	{
		"id": '361126',
		"shortname": '弋阳县',
		"parentid": '361100'
	},
	{
		"id": '361127',
		"shortname": '余干县',
		"parentid": '361100'
	},
	{
		"id": '361129',
		"shortname": '万年县',
		"parentid": '361100'
	},
	{
		"id": '361130',
		"shortname": '婺源县',
		"parentid": '361100'
	},
	{
		"id": '361181',
		"shortname": '德兴市',
		"parentid": '361100'
	},
	{
		"id": '370102',
		"shortname": '历下区',
		"parentid": '370100'
	},
	{
		"id": '370103',
		"shortname": '市中区',
		"parentid": '370100'
	},
	{
		"id": '370104',
		"shortname": '槐荫区',
		"parentid": '370100'
	},
	{
		"id": '370105',
		"shortname": '天桥区',
		"parentid": '370100'
	},
	{
		"id": '370112',
		"shortname": '历城区',
		"parentid": '370100'
	},
	{
		"id": '370113',
		"shortname": '长清区',
		"parentid": '370100'
	},
	{
		"id": '370124',
		"shortname": '平阴县',
		"parentid": '370100'
	},
	{
		"id": '370125',
		"shortname": '济阳县',
		"parentid": '370100'
	},
	{
		"id": '370126',
		"shortname": '商河县',
		"parentid": '370100'
	},
	{
		"id": '370140',
		"shortname": '济南高新技术产业开发区',
		"parentid": '370100'
	},
	{
		"id": '370181',
		"shortname": '章丘市',
		"parentid": '370100'
	},
	{
		"id": '370202',
		"shortname": '市南区',
		"parentid": '370200'
	},
	{
		"id": '370203',
		"shortname": '市北区',
		"parentid": '370200'
	},
	{
		"id": '370205',
		"shortname": '四方区',
		"parentid": '370200'
	},
	{
		"id": '370211',
		"shortname": '黄岛区',
		"parentid": '370200'
	},
	{
		"id": '370212',
		"shortname": '崂山区',
		"parentid": '370200'
	},
	{
		"id": '370213',
		"shortname": '李沧区',
		"parentid": '370200'
	},
	{
		"id": '370214',
		"shortname": '城阳区',
		"parentid": '370200'
	},
	{
		"id": '370281',
		"shortname": '胶州市',
		"parentid": '370200'
	},
	{
		"id": '370282',
		"shortname": '即墨市',
		"parentid": '370200'
	},
	{
		"id": '370283',
		"shortname": '平度市',
		"parentid": '370200'
	},
	{
		"id": '370284',
		"shortname": '胶南市',
		"parentid": '370200'
	},
	{
		"id": '370285',
		"shortname": '莱西市',
		"parentid": '370200'
	},
	{
		"id": '370240',
		"shortname": '保税区',
		"parentid": '370200'
	},
	{
		"id": '370302',
		"shortname": '淄川区',
		"parentid": '370300'
	},
	{
		"id": '370304',
		"shortname": '博山区',
		"parentid": '370300'
	},
	{
		"id": '370305',
		"shortname": '临淄区',
		"parentid": '370300'
	},
	{
		"id": '370306',
		"shortname": '周村区',
		"parentid": '370300'
	},
	{
		"id": '370321',
		"shortname": '桓台县',
		"parentid": '370300'
	},
	{
		"id": '370322',
		"shortname": '高青县',
		"parentid": '370300'
	},
	{
		"id": '370323',
		"shortname": '沂源县',
		"parentid": '370300'
	},
	{
		"id": '370340',
		"shortname": '高新区',
		"parentid": '370300'
	},
	{
		"id": '370303',
		"shortname": '张店区',
		"parentid": '370300'
	},
	{
		"id": '370402',
		"shortname": '市中区',
		"parentid": '370400'
	},
	{
		"id": '370403',
		"shortname": '薛城区',
		"parentid": '370400'
	},
	{
		"id": '370404',
		"shortname": '峄城区',
		"parentid": '370400'
	},
	{
		"id": '370406',
		"shortname": '山亭区',
		"parentid": '370400'
	},
	{
		"id": '370481',
		"shortname": '滕州市',
		"parentid": '370400'
	},
	{
		"id": '370405',
		"shortname": '台儿庄区',
		"parentid": '370400'
	},
	{
		"id": '370502',
		"shortname": '东营区',
		"parentid": '370500'
	},
	{
		"id": '370503',
		"shortname": '河口区',
		"parentid": '370500'
	},
	{
		"id": '370521',
		"shortname": '垦利县',
		"parentid": '370500'
	},
	{
		"id": '370522',
		"shortname": '利津县',
		"parentid": '370500'
	},
	{
		"id": '370523',
		"shortname": '广饶县',
		"parentid": '370500'
	},
	{
		"id": '370611',
		"shortname": '福山区',
		"parentid": '370600'
	},
	{
		"id": '370612',
		"shortname": '牟平区',
		"parentid": '370600'
	},
	{
		"id": '370613',
		"shortname": '莱山区',
		"parentid": '370600'
	},
	{
		"id": '370634',
		"shortname": '长岛县',
		"parentid": '370600'
	},
	{
		"id": '370640',
		"shortname": '开发区',
		"parentid": '370600'
	},
	{
		"id": '370641',
		"shortname": '高新区',
		"parentid": '370600'
	},
	{
		"id": '370681',
		"shortname": '龙口市',
		"parentid": '370600'
	},
	{
		"id": '370682',
		"shortname": '莱阳市',
		"parentid": '370600'
	},
	{
		"id": '370683',
		"shortname": '莱州市',
		"parentid": '370600'
	},
	{
		"id": '370684',
		"shortname": '蓬莱市',
		"parentid": '370600'
	},
	{
		"id": '370685',
		"shortname": '招远市',
		"parentid": '370600'
	},
	{
		"id": '370686',
		"shortname": '栖霞市',
		"parentid": '370600'
	},
	{
		"id": '370687',
		"shortname": '海阳市',
		"parentid": '370600'
	},
	{
		"id": '370602',
		"shortname": '芝罘区',
		"parentid": '370600'
	},
	{
		"id": '370704',
		"shortname": '坊子区',
		"parentid": '370700'
	},
	{
		"id": '370705',
		"shortname": '奎文区',
		"parentid": '370700'
	},
	{
		"id": '370724',
		"shortname": '临朐县',
		"parentid": '370700'
	},
	{
		"id": '370725',
		"shortname": '昌乐县',
		"parentid": '370700'
	},
	{
		"id": '370740',
		"shortname": '潍坊滨海经济开发区',
		"parentid": '370700'
	},
	{
		"id": '370781',
		"shortname": '青州市',
		"parentid": '370700'
	},
	{
		"id": '370782',
		"shortname": '诸城市',
		"parentid": '370700'
	},
	{
		"id": '370783',
		"shortname": '寿光市',
		"parentid": '370700'
	},
	{
		"id": '370784',
		"shortname": '安丘市',
		"parentid": '370700'
	},
	{
		"id": '370785',
		"shortname": '高密市',
		"parentid": '370700'
	},
	{
		"id": '370786',
		"shortname": '昌邑市',
		"parentid": '370700'
	},
	{
		"id": '370702',
		"shortname": '潍城区',
		"parentid": '370700'
	},
	{
		"id": '370703',
		"shortname": '寒亭区',
		"parentid": '370700'
	},
	{
		"id": '370802',
		"shortname": '市中区',
		"parentid": '370800'
	},
	{
		"id": '370811',
		"shortname": '任城区',
		"parentid": '370800'
	},
	{
		"id": '370826',
		"shortname": '微山县',
		"parentid": '370800'
	},
	{
		"id": '370827',
		"shortname": '鱼台县',
		"parentid": '370800'
	},
	{
		"id": '370828',
		"shortname": '金乡县',
		"parentid": '370800'
	},
	{
		"id": '370829',
		"shortname": '嘉祥县',
		"parentid": '370800'
	},
	{
		"id": '370830',
		"shortname": '汶上县',
		"parentid": '370800'
	},
	{
		"id": '370831',
		"shortname": '泗水县',
		"parentid": '370800'
	},
	{
		"id": '370832',
		"shortname": '梁山县',
		"parentid": '370800'
	},
	{
		"id": '370881',
		"shortname": '曲阜市',
		"parentid": '370800'
	},
	{
		"id": '370882',
		"shortname": '兖州市',
		"parentid": '370800'
	},
	{
		"id": '370883',
		"shortname": '邹城市',
		"parentid": '370800'
	},
	{
		"id": '370902',
		"shortname": '泰山区',
		"parentid": '370900'
	},
	{
		"id": '370911',
		"shortname": '岱岳区',
		"parentid": '370900'
	},
	{
		"id": '370921',
		"shortname": '宁阳县',
		"parentid": '370900'
	},
	{
		"id": '370923',
		"shortname": '东平县',
		"parentid": '370900'
	},
	{
		"id": '370982',
		"shortname": '新泰市',
		"parentid": '370900'
	},
	{
		"id": '370983',
		"shortname": '肥城市',
		"parentid": '370900'
	},
	{
		"id": '371002',
		"shortname": '环翠区',
		"parentid": '371000'
	},
	{
		"id": '371040',
		"shortname": '高技术产业开发区',
		"parentid": '371000'
	},
	{
		"id": '371041',
		"shortname": '经济技术开发区',
		"parentid": '371000'
	},
	{
		"id": '371081',
		"shortname": '文登市',
		"parentid": '371000'
	},
	{
		"id": '371082',
		"shortname": '荣成市',
		"parentid": '371000'
	},
	{
		"id": '371083',
		"shortname": '乳山市',
		"parentid": '371000'
	},
	{
		"id": '371102',
		"shortname": '东港区',
		"parentid": '371100'
	},
	{
		"id": '371103',
		"shortname": '岚山区',
		"parentid": '371100'
	},
	{
		"id": '371121',
		"shortname": '五莲县',
		"parentid": '371100'
	},
	{
		"id": '371122',
		"shortname": '莒县',
		"parentid": '371100'
	},
	{
		"id": '371140',
		"shortname": '经济开发区',
		"parentid": '371100'
	},
	{
		"id": '371141',
		"shortname": '山海天旅游度假区',
		"parentid": '371100'
	},
	{
		"id": '371202',
		"shortname": '莱城区',
		"parentid": '371200'
	},
	{
		"id": '371203',
		"shortname": '钢城区',
		"parentid": '371200'
	},
	{
		"id": '371324',
		"shortname": '兰陵县',
		"parentid": '371300'
	},
	{
		"id": '371302',
		"shortname": '兰山区',
		"parentid": '371300'
	},
	{
		"id": '371311',
		"shortname": '罗庄区',
		"parentid": '371300'
	},
	{
		"id": '371312',
		"shortname": '河东区',
		"parentid": '371300'
	},
	{
		"id": '371321',
		"shortname": '沂南县',
		"parentid": '371300'
	},
	{
		"id": '371322',
		"shortname": '郯城县',
		"parentid": '371300'
	},
	{
		"id": '371323',
		"shortname": '沂水县',
		"parentid": '371300'
	},
	{
		"id": '371325',
		"shortname": '费县',
		"parentid": '371300'
	},
	{
		"id": '371326',
		"shortname": '平邑县',
		"parentid": '371300'
	},
	{
		"id": '371327',
		"shortname": '莒南县',
		"parentid": '371300'
	},
	{
		"id": '371328',
		"shortname": '蒙阴县',
		"parentid": '371300'
	},
	{
		"id": '371329',
		"shortname": '临沭县',
		"parentid": '371300'
	},
	{
		"id": '371402',
		"shortname": '德城区',
		"parentid": '371400'
	},
	{
		"id": '371421',
		"shortname": '陵县',
		"parentid": '371400'
	},
	{
		"id": '371422',
		"shortname": '宁津县',
		"parentid": '371400'
	},
	{
		"id": '371423',
		"shortname": '庆云县',
		"parentid": '371400'
	},
	{
		"id": '371424',
		"shortname": '临邑县',
		"parentid": '371400'
	},
	{
		"id": '371425',
		"shortname": '齐河县',
		"parentid": '371400'
	},
	{
		"id": '371426',
		"shortname": '平原县',
		"parentid": '371400'
	},
	{
		"id": '371427',
		"shortname": '夏津县',
		"parentid": '371400'
	},
	{
		"id": '371428',
		"shortname": '武城县',
		"parentid": '371400'
	},
	{
		"id": '371481',
		"shortname": '乐陵市',
		"parentid": '371400'
	},
	{
		"id": '371482',
		"shortname": '禹城市',
		"parentid": '371400'
	},
	{
		"id": '371502',
		"shortname": '东昌府区',
		"parentid": '371500'
	},
	{
		"id": '371521',
		"shortname": '阳谷县',
		"parentid": '371500'
	},
	{
		"id": '371522',
		"shortname": '莘县',
		"parentid": '371500'
	},
	{
		"id": '371523',
		"shortname": '茌平县',
		"parentid": '371500'
	},
	{
		"id": '371524',
		"shortname": '东阿县',
		"parentid": '371500'
	},
	{
		"id": '371525',
		"shortname": '冠县',
		"parentid": '371500'
	},
	{
		"id": '371526',
		"shortname": '高唐县',
		"parentid": '371500'
	},
	{
		"id": '371581',
		"shortname": '临清市',
		"parentid": '371500'
	},
	{
		"id": '371602',
		"shortname": '滨城区',
		"parentid": '371600'
	},
	{
		"id": '371621',
		"shortname": '惠民县',
		"parentid": '371600'
	},
	{
		"id": '371622',
		"shortname": '阳信县',
		"parentid": '371600'
	},
	{
		"id": '371623',
		"shortname": '无棣县',
		"parentid": '371600'
	},
	{
		"id": '371624',
		"shortname": '沾化县',
		"parentid": '371600'
	},
	{
		"id": '371625',
		"shortname": '博兴县',
		"parentid": '371600'
	},
	{
		"id": '371626',
		"shortname": '邹平县',
		"parentid": '371600'
	},
	{
		"id": '371640',
		"shortname": '开发区',
		"parentid": '371600'
	},
	{
		"id": '371722',
		"shortname": '单县',
		"parentid": '371700'
	},
	{
		"id": '371723',
		"shortname": '成武县',
		"parentid": '371700'
	},
	{
		"id": '371724',
		"shortname": '巨野县',
		"parentid": '371700'
	},
	{
		"id": '371725',
		"shortname": '郓城县',
		"parentid": '371700'
	},
	{
		"id": '371726',
		"shortname": '鄄城县',
		"parentid": '371700'
	},
	{
		"id": '371727',
		"shortname": '定陶县',
		"parentid": '371700'
	},
	{
		"id": '371728',
		"shortname": '东明县',
		"parentid": '371700'
	},
	{
		"id": '371702',
		"shortname": '牡丹区',
		"parentid": '371700'
	},
	{
		"id": '371721',
		"shortname": '曹县',
		"parentid": '371700'
	},
	{
		"id": '410102',
		"shortname": '中原区',
		"parentid": '410100'
	},
	{
		"id": '410103',
		"shortname": '二七区',
		"parentid": '410100'
	},
	{
		"id": '410104',
		"shortname": '管城回族区',
		"parentid": '410100'
	},
	{
		"id": '410105',
		"shortname": '金水区',
		"parentid": '410100'
	},
	{
		"id": '410106',
		"shortname": '上街区',
		"parentid": '410100'
	},
	{
		"id": '410108',
		"shortname": '惠济区',
		"parentid": '410100'
	},
	{
		"id": '410122',
		"shortname": '中牟县',
		"parentid": '410100'
	},
	{
		"id": '410181',
		"shortname": '巩义市',
		"parentid": '410100'
	},
	{
		"id": '410182',
		"shortname": '荥阳市',
		"parentid": '410100'
	},
	{
		"id": '410183',
		"shortname": '新密市',
		"parentid": '410100'
	},
	{
		"id": '410184',
		"shortname": '新郑市',
		"parentid": '410100'
	},
	{
		"id": '410185',
		"shortname": '登封市',
		"parentid": '410100'
	},
	{
		"id": '410202',
		"shortname": '龙亭区',
		"parentid": '410200'
	},
	{
		"id": '410203',
		"shortname": '顺河回族区',
		"parentid": '410200'
	},
	{
		"id": '410204',
		"shortname": '鼓楼区',
		"parentid": '410200'
	},
	{
		"id": '410205',
		"shortname": '禹王台区',
		"parentid": '410200'
	},
	{
		"id": '410211',
		"shortname": '金明区',
		"parentid": '410200'
	},
	{
		"id": '410221',
		"shortname": '杞县',
		"parentid": '410200'
	},
	{
		"id": '410222',
		"shortname": '通许县',
		"parentid": '410200'
	},
	{
		"id": '410223',
		"shortname": '尉氏县',
		"parentid": '410200'
	},
	{
		"id": '410224',
		"shortname": '开封县',
		"parentid": '410200'
	},
	{
		"id": '410225',
		"shortname": '兰考县',
		"parentid": '410200'
	},
	{
		"id": '410302',
		"shortname": '老城区',
		"parentid": '410300'
	},
	{
		"id": '410303',
		"shortname": '西工区',
		"parentid": '410300'
	},
	{
		"id": '410304',
		"shortname": '瀍河回族区',
		"parentid": '410300'
	},
	{
		"id": '410305',
		"shortname": '涧西区',
		"parentid": '410300'
	},
	{
		"id": '410306',
		"shortname": '吉利区',
		"parentid": '410300'
	},
	{
		"id": '410311',
		"shortname": '洛龙区',
		"parentid": '410300'
	},
	{
		"id": '410322',
		"shortname": '孟津县',
		"parentid": '410300'
	},
	{
		"id": '410323',
		"shortname": '新安县',
		"parentid": '410300'
	},
	{
		"id": '410324',
		"shortname": '栾川县',
		"parentid": '410300'
	},
	{
		"id": '410325',
		"shortname": '嵩县',
		"parentid": '410300'
	},
	{
		"id": '410326',
		"shortname": '汝阳县',
		"parentid": '410300'
	},
	{
		"id": '410327',
		"shortname": '宜阳县',
		"parentid": '410300'
	},
	{
		"id": '410328',
		"shortname": '洛宁县',
		"parentid": '410300'
	},
	{
		"id": '410329',
		"shortname": '伊川县',
		"parentid": '410300'
	},
	{
		"id": '410340',
		"shortname": '高新技术开发区',
		"parentid": '410300'
	},
	{
		"id": '410381',
		"shortname": '偃师市',
		"parentid": '410300'
	},
	{
		"id": '410402',
		"shortname": '新华区',
		"parentid": '410400'
	},
	{
		"id": '410403',
		"shortname": '卫东区',
		"parentid": '410400'
	},
	{
		"id": '410404',
		"shortname": '石龙区',
		"parentid": '410400'
	},
	{
		"id": '410411',
		"shortname": '湛河区',
		"parentid": '410400'
	},
	{
		"id": '410421',
		"shortname": '宝丰县',
		"parentid": '410400'
	},
	{
		"id": '410422',
		"shortname": '叶县',
		"parentid": '410400'
	},
	{
		"id": '410423',
		"shortname": '鲁山县',
		"parentid": '410400'
	},
	{
		"id": '410425',
		"shortname": '郏县',
		"parentid": '410400'
	},
	{
		"id": '410481',
		"shortname": '舞钢市',
		"parentid": '410400'
	},
	{
		"id": '410482',
		"shortname": '汝州市',
		"parentid": '410400'
	},
	{
		"id": '410502',
		"shortname": '文峰区',
		"parentid": '410500'
	},
	{
		"id": '410503',
		"shortname": '北关区',
		"parentid": '410500'
	},
	{
		"id": '410505',
		"shortname": '殷都区',
		"parentid": '410500'
	},
	{
		"id": '410506',
		"shortname": '龙安区',
		"parentid": '410500'
	},
	{
		"id": '410522',
		"shortname": '安阳县',
		"parentid": '410500'
	},
	{
		"id": '410523',
		"shortname": '汤阴县',
		"parentid": '410500'
	},
	{
		"id": '410526',
		"shortname": '滑县',
		"parentid": '410500'
	},
	{
		"id": '410527',
		"shortname": '内黄县',
		"parentid": '410500'
	},
	{
		"id": '410540',
		"shortname": '开发区',
		"parentid": '410500'
	},
	{
		"id": '410581',
		"shortname": '林州市',
		"parentid": '410500'
	},
	{
		"id": '410602',
		"shortname": '鹤山区',
		"parentid": '410600'
	},
	{
		"id": '410603',
		"shortname": '山城区',
		"parentid": '410600'
	},
	{
		"id": '410611',
		"shortname": '淇滨区',
		"parentid": '410600'
	},
	{
		"id": '410621',
		"shortname": '浚县',
		"parentid": '410600'
	},
	{
		"id": '410622',
		"shortname": '淇县',
		"parentid": '410600'
	},
	{
		"id": '410640',
		"shortname": '开发区',
		"parentid": '410600'
	},
	{
		"id": '410702',
		"shortname": '红旗区',
		"parentid": '410700'
	},
	{
		"id": '410703',
		"shortname": '卫滨区',
		"parentid": '410700'
	},
	{
		"id": '410704',
		"shortname": '凤泉区',
		"parentid": '410700'
	},
	{
		"id": '410711',
		"shortname": '牧野区',
		"parentid": '410700'
	},
	{
		"id": '410721',
		"shortname": '新乡县',
		"parentid": '410700'
	},
	{
		"id": '410724',
		"shortname": '获嘉县',
		"parentid": '410700'
	},
	{
		"id": '410725',
		"shortname": '原阳县',
		"parentid": '410700'
	},
	{
		"id": '410726',
		"shortname": '延津县',
		"parentid": '410700'
	},
	{
		"id": '410727',
		"shortname": '封丘县',
		"parentid": '410700'
	},
	{
		"id": '410728',
		"shortname": '长垣县',
		"parentid": '410700'
	},
	{
		"id": '410740',
		"shortname": '开发区',
		"parentid": '410700'
	},
	{
		"id": '410781',
		"shortname": '卫辉市',
		"parentid": '410700'
	},
	{
		"id": '410782',
		"shortname": '辉县市',
		"parentid": '410700'
	},
	{
		"id": '410802',
		"shortname": '解放区',
		"parentid": '410800'
	},
	{
		"id": '410803',
		"shortname": '中站区',
		"parentid": '410800'
	},
	{
		"id": '410804',
		"shortname": '马村区',
		"parentid": '410800'
	},
	{
		"id": '410811',
		"shortname": '山阳区',
		"parentid": '410800'
	},
	{
		"id": '410821',
		"shortname": '修武县',
		"parentid": '410800'
	},
	{
		"id": '410822',
		"shortname": '博爱县',
		"parentid": '410800'
	},
	{
		"id": '410825',
		"shortname": '温县',
		"parentid": '410800'
	},
	{
		"id": '410840',
		"shortname": '高新区',
		"parentid": '410800'
	},
	{
		"id": '410882',
		"shortname": '沁阳市',
		"parentid": '410800'
	},
	{
		"id": '410883',
		"shortname": '孟州市',
		"parentid": '410800'
	},
	{
		"id": '410823',
		"shortname": '武陟县',
		"parentid": '410800'
	},
	{
		"id": '410902',
		"shortname": '华龙区',
		"parentid": '410900'
	},
	{
		"id": '410922',
		"shortname": '清丰县',
		"parentid": '410900'
	},
	{
		"id": '410923',
		"shortname": '南乐县',
		"parentid": '410900'
	},
	{
		"id": '410926',
		"shortname": '范县',
		"parentid": '410900'
	},
	{
		"id": '410927',
		"shortname": '台前县',
		"parentid": '410900'
	},
	{
		"id": '410928',
		"shortname": '濮阳县',
		"parentid": '410900'
	},
	{
		"id": '410940',
		"shortname": '高新区',
		"parentid": '410900'
	},
	{
		"id": '411002',
		"shortname": '魏都区',
		"parentid": '411000'
	},
	{
		"id": '411023',
		"shortname": '许昌县',
		"parentid": '411000'
	},
	{
		"id": '411024',
		"shortname": '鄢陵县',
		"parentid": '411000'
	},
	{
		"id": '411025',
		"shortname": '襄城县',
		"parentid": '411000'
	},
	{
		"id": '411081',
		"shortname": '禹州市',
		"parentid": '411000'
	},
	{
		"id": '411082',
		"shortname": '长葛市',
		"parentid": '411000'
	},
	{
		"id": '411102',
		"shortname": '源汇区',
		"parentid": '411100'
	},
	{
		"id": '411103',
		"shortname": '郾城区',
		"parentid": '411100'
	},
	{
		"id": '411104',
		"shortname": '召陵区',
		"parentid": '411100'
	},
	{
		"id": '411121',
		"shortname": '舞阳县',
		"parentid": '411100'
	},
	{
		"id": '411122',
		"shortname": '临颍县',
		"parentid": '411100'
	},
	{
		"id": '411202',
		"shortname": '湖滨区',
		"parentid": '411200'
	},
	{
		"id": '411221',
		"shortname": '渑池县',
		"parentid": '411200'
	},
	{
		"id": '411222',
		"shortname": '陕县',
		"parentid": '411200'
	},
	{
		"id": '411224',
		"shortname": '卢氏县',
		"parentid": '411200'
	},
	{
		"id": '411281',
		"shortname": '义马市',
		"parentid": '411200'
	},
	{
		"id": '411282',
		"shortname": '灵宝市',
		"parentid": '411200'
	},
	{
		"id": '411302',
		"shortname": '宛城区',
		"parentid": '411300'
	},
	{
		"id": '411303',
		"shortname": '卧龙区',
		"parentid": '411300'
	},
	{
		"id": '411321',
		"shortname": '南召县',
		"parentid": '411300'
	},
	{
		"id": '411322',
		"shortname": '方城县',
		"parentid": '411300'
	},
	{
		"id": '411323',
		"shortname": '西峡县',
		"parentid": '411300'
	},
	{
		"id": '411324',
		"shortname": '镇平县',
		"parentid": '411300'
	},
	{
		"id": '411325',
		"shortname": '内乡县',
		"parentid": '411300'
	},
	{
		"id": '411326',
		"shortname": '淅川县',
		"parentid": '411300'
	},
	{
		"id": '411327',
		"shortname": '社旗县',
		"parentid": '411300'
	},
	{
		"id": '411328',
		"shortname": '唐河县',
		"parentid": '411300'
	},
	{
		"id": '411329',
		"shortname": '新野县',
		"parentid": '411300'
	},
	{
		"id": '411330',
		"shortname": '桐柏县',
		"parentid": '411300'
	},
	{
		"id": '411381',
		"shortname": '邓州市',
		"parentid": '411300'
	},
	{
		"id": '411402',
		"shortname": '梁园区',
		"parentid": '411400'
	},
	{
		"id": '411403',
		"shortname": '睢阳区',
		"parentid": '411400'
	},
	{
		"id": '411421',
		"shortname": '民权县',
		"parentid": '411400'
	},
	{
		"id": '411422',
		"shortname": '睢县',
		"parentid": '411400'
	},
	{
		"id": '411423',
		"shortname": '宁陵县',
		"parentid": '411400'
	},
	{
		"id": '411424',
		"shortname": '柘城县',
		"parentid": '411400'
	},
	{
		"id": '411425',
		"shortname": '虞城县',
		"parentid": '411400'
	},
	{
		"id": '411426',
		"shortname": '夏邑县',
		"parentid": '411400'
	},
	{
		"id": '411440',
		"shortname": '开发区',
		"parentid": '411400'
	},
	{
		"id": '411481',
		"shortname": '永城市',
		"parentid": '411400'
	},
	{
		"id": '411502',
		"shortname": '浉河区',
		"parentid": '411500'
	},
	{
		"id": '411503',
		"shortname": '平桥区',
		"parentid": '411500'
	},
	{
		"id": '411521',
		"shortname": '罗山县',
		"parentid": '411500'
	},
	{
		"id": '411522',
		"shortname": '光山县',
		"parentid": '411500'
	},
	{
		"id": '411523',
		"shortname": '新县',
		"parentid": '411500'
	},
	{
		"id": '411524',
		"shortname": '商城县',
		"parentid": '411500'
	},
	{
		"id": '411525',
		"shortname": '固始县',
		"parentid": '411500'
	},
	{
		"id": '411526',
		"shortname": '潢川县',
		"parentid": '411500'
	},
	{
		"id": '411527',
		"shortname": '淮滨县',
		"parentid": '411500'
	},
	{
		"id": '411528',
		"shortname": '息县',
		"parentid": '411500'
	},
	{
		"id": '411540',
		"shortname": '南湖湾风景区',
		"parentid": '411500'
	},
	{
		"id": '411541',
		"shortname": '鸡公山管理区',
		"parentid": '411500'
	},
	{
		"id": '411542',
		"shortname": '上天梯非金属矿管理区',
		"parentid": '411500'
	},
	{
		"id": '411543',
		"shortname": '工业城',
		"parentid": '411500'
	},
	{
		"id": '411544',
		"shortname": '羊山新区',
		"parentid": '411500'
	},
	{
		"id": '411545',
		"shortname": '潢川经济技术开发区',
		"parentid": '411500'
	},
	{
		"id": '411602',
		"shortname": '川汇区',
		"parentid": '411600'
	},
	{
		"id": '411621',
		"shortname": '扶沟县',
		"parentid": '411600'
	},
	{
		"id": '411622',
		"shortname": '西华县',
		"parentid": '411600'
	},
	{
		"id": '411623',
		"shortname": '商水县',
		"parentid": '411600'
	},
	{
		"id": '411624',
		"shortname": '沈丘县',
		"parentid": '411600'
	},
	{
		"id": '411625',
		"shortname": '郸城县',
		"parentid": '411600'
	},
	{
		"id": '411626',
		"shortname": '淮阳县',
		"parentid": '411600'
	},
	{
		"id": '411627',
		"shortname": '太康县',
		"parentid": '411600'
	},
	{
		"id": '411640',
		"shortname": '黄泛区',
		"parentid": '411600'
	},
	{
		"id": '411681',
		"shortname": '项城市',
		"parentid": '411600'
	},
	{
		"id": '411628',
		"shortname": '鹿邑县',
		"parentid": '411600'
	},
	{
		"id": '411702',
		"shortname": '驿城区',
		"parentid": '411700'
	},
	{
		"id": '411721',
		"shortname": '西平县',
		"parentid": '411700'
	},
	{
		"id": '411722',
		"shortname": '上蔡县',
		"parentid": '411700'
	},
	{
		"id": '411723',
		"shortname": '平舆县',
		"parentid": '411700'
	},
	{
		"id": '411724',
		"shortname": '正阳县',
		"parentid": '411700'
	},
	{
		"id": '411725',
		"shortname": '确山县',
		"parentid": '411700'
	},
	{
		"id": '411726',
		"shortname": '泌阳县',
		"parentid": '411700'
	},
	{
		"id": '411727',
		"shortname": '汝南县',
		"parentid": '411700'
	},
	{
		"id": '411728',
		"shortname": '遂平县',
		"parentid": '411700'
	},
	{
		"id": '411729',
		"shortname": '新蔡县',
		"parentid": '411700'
	},
	{
		"id": '411740',
		"shortname": '高新区',
		"parentid": '411700'
	},
	{
		"id": '420112',
		"shortname": '东西湖区',
		"parentid": '420100'
	},
	{
		"id": '420113',
		"shortname": '汉南区',
		"parentid": '420100'
	},
	{
		"id": '420114',
		"shortname": '蔡甸区',
		"parentid": '420100'
	},
	{
		"id": '420115',
		"shortname": '江夏区',
		"parentid": '420100'
	},
	{
		"id": '420116',
		"shortname": '黄陂区',
		"parentid": '420100'
	},
	{
		"id": '420117',
		"shortname": '新洲区',
		"parentid": '420100'
	},
	{
		"id": '420140',
		"shortname": '东湖高新开发区',
		"parentid": '420100'
	},
	{
		"id": '420141',
		"shortname": '经济开发区',
		"parentid": '420100'
	},
	{
		"id": '420102',
		"shortname": '江岸区',
		"parentid": '420100'
	},
	{
		"id": '420103',
		"shortname": '江汉区',
		"parentid": '420100'
	},
	{
		"id": '420104',
		"shortname": '硚口区',
		"parentid": '420100'
	},
	{
		"id": '420105',
		"shortname": '汉阳区',
		"parentid": '420100'
	},
	{
		"id": '420106',
		"shortname": '武昌区',
		"parentid": '420100'
	},
	{
		"id": '420107',
		"shortname": '青山区',
		"parentid": '420100'
	},
	{
		"id": '420111',
		"shortname": '洪山区',
		"parentid": '420100'
	},
	{
		"id": '420202',
		"shortname": '黄石港区',
		"parentid": '420200'
	},
	{
		"id": '420203',
		"shortname": '西塞山区',
		"parentid": '420200'
	},
	{
		"id": '420204',
		"shortname": '下陆区',
		"parentid": '420200'
	},
	{
		"id": '420205',
		"shortname": '铁山区',
		"parentid": '420200'
	},
	{
		"id": '420222',
		"shortname": '阳新县',
		"parentid": '420200'
	},
	{
		"id": '420281',
		"shortname": '大冶市',
		"parentid": '420200'
	},
	{
		"id": '420302',
		"shortname": '茅箭区',
		"parentid": '420300'
	},
	{
		"id": '420303',
		"shortname": '张湾区',
		"parentid": '420300'
	},
	{
		"id": '420321',
		"shortname": '郧县',
		"parentid": '420300'
	},
	{
		"id": '420322',
		"shortname": '郧西县',
		"parentid": '420300'
	},
	{
		"id": '420323',
		"shortname": '竹山县',
		"parentid": '420300'
	},
	{
		"id": '420324',
		"shortname": '竹溪县',
		"parentid": '420300'
	},
	{
		"id": '420325',
		"shortname": '房县',
		"parentid": '420300'
	},
	{
		"id": '420340',
		"shortname": '武当山特区',
		"parentid": '420300'
	},
	{
		"id": '420381',
		"shortname": '丹江口市',
		"parentid": '420300'
	},
	{
		"id": '420502',
		"shortname": '西陵区',
		"parentid": '420500'
	},
	{
		"id": '420503',
		"shortname": '伍家岗区',
		"parentid": '420500'
	},
	{
		"id": '420504',
		"shortname": '点军区',
		"parentid": '420500'
	},
	{
		"id": '420505',
		"shortname": '猇亭区',
		"parentid": '420500'
	},
	{
		"id": '420506',
		"shortname": '夷陵区',
		"parentid": '420500'
	},
	{
		"id": '420525',
		"shortname": '远安县',
		"parentid": '420500'
	},
	{
		"id": '420526',
		"shortname": '兴山县',
		"parentid": '420500'
	},
	{
		"id": '420527',
		"shortname": '秭归县',
		"parentid": '420500'
	},
	{
		"id": '420528',
		"shortname": '长阳土家族自治县',
		"parentid": '420500'
	},
	{
		"id": '420529',
		"shortname": '五峰土家族自治县',
		"parentid": '420500'
	},
	{
		"id": '420540',
		"shortname": '开发区',
		"parentid": '420500'
	},
	{
		"id": '420581',
		"shortname": '宜都市',
		"parentid": '420500'
	},
	{
		"id": '420583',
		"shortname": '枝江市',
		"parentid": '420500'
	},
	{
		"id": '420582',
		"shortname": '当阳市',
		"parentid": '420500'
	},
	{
		"id": '420607',
		"shortname": '襄州区',
		"parentid": '420600'
	},
	{
		"id": '420602',
		"shortname": '襄城区',
		"parentid": '420600'
	},
	{
		"id": '420606',
		"shortname": '樊城区',
		"parentid": '420600'
	},
	{
		"id": '420624',
		"shortname": '南漳县',
		"parentid": '420600'
	},
	{
		"id": '420625',
		"shortname": '谷城县',
		"parentid": '420600'
	},
	{
		"id": '420626',
		"shortname": '保康县',
		"parentid": '420600'
	},
	{
		"id": '420682',
		"shortname": '老河口市',
		"parentid": '420600'
	},
	{
		"id": '420683',
		"shortname": '枣阳市',
		"parentid": '420600'
	},
	{
		"id": '420684',
		"shortname": '宜城市',
		"parentid": '420600'
	},
	{
		"id": '420640',
		"shortname": '高新技术开发区',
		"parentid": '420600'
	},
	{
		"id": '420702',
		"shortname": '梁子湖区',
		"parentid": '420700'
	},
	{
		"id": '420703',
		"shortname": '华容区',
		"parentid": '420700'
	},
	{
		"id": '420704',
		"shortname": '鄂城区',
		"parentid": '420700'
	},
	{
		"id": '420740',
		"shortname": '葛店开发区',
		"parentid": '420700'
	},
	{
		"id": '420741',
		"shortname": '长港农场',
		"parentid": '420700'
	},
	{
		"id": '420802',
		"shortname": '东宝区',
		"parentid": '420800'
	},
	{
		"id": '420804',
		"shortname": '掇刀区',
		"parentid": '420800'
	},
	{
		"id": '420821',
		"shortname": '京山县',
		"parentid": '420800'
	},
	{
		"id": '420822',
		"shortname": '沙洋县',
		"parentid": '420800'
	},
	{
		"id": '420840',
		"shortname": '屈家岭管理区',
		"parentid": '420800'
	},
	{
		"id": '420881',
		"shortname": '钟祥市',
		"parentid": '420800'
	},
	{
		"id": '420902',
		"shortname": '孝南区',
		"parentid": '420900'
	},
	{
		"id": '420921',
		"shortname": '孝昌县',
		"parentid": '420900'
	},
	{
		"id": '420922',
		"shortname": '大悟县',
		"parentid": '420900'
	},
	{
		"id": '420923',
		"shortname": '云梦县',
		"parentid": '420900'
	},
	{
		"id": '420981',
		"shortname": '应城市',
		"parentid": '420900'
	},
	{
		"id": '420982',
		"shortname": '安陆市',
		"parentid": '420900'
	},
	{
		"id": '420984',
		"shortname": '汉川市',
		"parentid": '420900'
	},
	{
		"id": '421002',
		"shortname": '沙市区',
		"parentid": '421000'
	},
	{
		"id": '421003',
		"shortname": '荆州区',
		"parentid": '421000'
	},
	{
		"id": '421022',
		"shortname": '公安县',
		"parentid": '421000'
	},
	{
		"id": '421023',
		"shortname": '监利县',
		"parentid": '421000'
	},
	{
		"id": '421024',
		"shortname": '江陵县',
		"parentid": '421000'
	},
	{
		"id": '421081',
		"shortname": '石首市',
		"parentid": '421000'
	},
	{
		"id": '421083',
		"shortname": '洪湖市',
		"parentid": '421000'
	},
	{
		"id": '421087',
		"shortname": '松滋市',
		"parentid": '421000'
	},
	{
		"id": '421102',
		"shortname": '黄州区',
		"parentid": '421100'
	},
	{
		"id": '421121',
		"shortname": '团风县',
		"parentid": '421100'
	},
	{
		"id": '421122',
		"shortname": '红安县',
		"parentid": '421100'
	},
	{
		"id": '421123',
		"shortname": '罗田县',
		"parentid": '421100'
	},
	{
		"id": '421124',
		"shortname": '英山县',
		"parentid": '421100'
	},
	{
		"id": '421125',
		"shortname": '浠水县',
		"parentid": '421100'
	},
	{
		"id": '421126',
		"shortname": '蕲春县',
		"parentid": '421100'
	},
	{
		"id": '421127',
		"shortname": '黄梅县',
		"parentid": '421100'
	},
	{
		"id": '421181',
		"shortname": '麻城市',
		"parentid": '421100'
	},
	{
		"id": '421182',
		"shortname": '武穴市',
		"parentid": '421100'
	},
	{
		"id": '421202',
		"shortname": '咸安区',
		"parentid": '421200'
	},
	{
		"id": '421221',
		"shortname": '嘉鱼县',
		"parentid": '421200'
	},
	{
		"id": '421222',
		"shortname": '通城县',
		"parentid": '421200'
	},
	{
		"id": '421223',
		"shortname": '崇阳县',
		"parentid": '421200'
	},
	{
		"id": '421224',
		"shortname": '通山县',
		"parentid": '421200'
	},
	{
		"id": '421281',
		"shortname": '赤壁市',
		"parentid": '421200'
	},
	{
		"id": '421302',
		"shortname": '曾都区',
		"parentid": '421300'
	},
	{
		"id": '421321',
		"shortname": '随县',
		"parentid": '421300'
	},
	{
		"id": '421381',
		"shortname": '广水市',
		"parentid": '421300'
	},
	{
		"id": '422801',
		"shortname": '恩施市',
		"parentid": '422800'
	},
	{
		"id": '422802',
		"shortname": '利川市',
		"parentid": '422800'
	},
	{
		"id": '422822',
		"shortname": '建始县',
		"parentid": '422800'
	},
	{
		"id": '422823',
		"shortname": '巴东县',
		"parentid": '422800'
	},
	{
		"id": '422825',
		"shortname": '宣恩县',
		"parentid": '422800'
	},
	{
		"id": '422826',
		"shortname": '咸丰县',
		"parentid": '422800'
	},
	{
		"id": '422827',
		"shortname": '来凤县',
		"parentid": '422800'
	},
	{
		"id": '422828',
		"shortname": '鹤峰县',
		"parentid": '422800'
	},
	{
		"id": '429004',
		"shortname": '仙桃市',
		"parentid": '429000'
	},
	{
		"id": '429005',
		"shortname": '潜江市',
		"parentid": '429000'
	},
	{
		"id": '429006',
		"shortname": '天门市',
		"parentid": '429000'
	},
	{
		"id": '429021',
		"shortname": '神农架林区',
		"parentid": '429000'
	},
	{
		"id": '430102',
		"shortname": '芙蓉区',
		"parentid": '430100'
	},
	{
		"id": '430103',
		"shortname": '天心区',
		"parentid": '430100'
	},
	{
		"id": '430104',
		"shortname": '岳麓区',
		"parentid": '430100'
	},
	{
		"id": '430105',
		"shortname": '开福区',
		"parentid": '430100'
	},
	{
		"id": '430111',
		"shortname": '雨花区',
		"parentid": '430100'
	},
	{
		"id": '430121',
		"shortname": '长沙县',
		"parentid": '430100'
	},
	{
		"id": '430122',
		"shortname": '望城县',
		"parentid": '430100'
	},
	{
		"id": '430124',
		"shortname": '宁乡县',
		"parentid": '430100'
	},
	{
		"id": '430181',
		"shortname": '浏阳市',
		"parentid": '430100'
	},
	{
		"id": '430202',
		"shortname": '荷塘区',
		"parentid": '430200'
	},
	{
		"id": '430203',
		"shortname": '芦淞区',
		"parentid": '430200'
	},
	{
		"id": '430204',
		"shortname": '石峰区',
		"parentid": '430200'
	},
	{
		"id": '430211',
		"shortname": '天元区',
		"parentid": '430200'
	},
	{
		"id": '430221',
		"shortname": '株洲县',
		"parentid": '430200'
	},
	{
		"id": '430223',
		"shortname": '攸县',
		"parentid": '430200'
	},
	{
		"id": '430224',
		"shortname": '茶陵县',
		"parentid": '430200'
	},
	{
		"id": '430225',
		"shortname": '炎陵县',
		"parentid": '430200'
	},
	{
		"id": '430240',
		"shortname": '云龙示范区',
		"parentid": '430200'
	},
	{
		"id": '430281',
		"shortname": '醴陵市',
		"parentid": '430200'
	},
	{
		"id": '430302',
		"shortname": '雨湖区',
		"parentid": '430300'
	},
	{
		"id": '430304',
		"shortname": '岳塘区',
		"parentid": '430300'
	},
	{
		"id": '430321',
		"shortname": '湘潭县',
		"parentid": '430300'
	},
	{
		"id": '430340',
		"shortname": '高新区',
		"parentid": '430300'
	},
	{
		"id": '430381',
		"shortname": '湘乡市',
		"parentid": '430300'
	},
	{
		"id": '430382',
		"shortname": '韶山市',
		"parentid": '430300'
	},
	{
		"id": '430405',
		"shortname": '珠晖区',
		"parentid": '430400'
	},
	{
		"id": '430406',
		"shortname": '雁峰区',
		"parentid": '430400'
	},
	{
		"id": '430407',
		"shortname": '石鼓区',
		"parentid": '430400'
	},
	{
		"id": '430408',
		"shortname": '蒸湘区',
		"parentid": '430400'
	},
	{
		"id": '430412',
		"shortname": '南岳区',
		"parentid": '430400'
	},
	{
		"id": '430421',
		"shortname": '衡阳县',
		"parentid": '430400'
	},
	{
		"id": '430422',
		"shortname": '衡南县',
		"parentid": '430400'
	},
	{
		"id": '430423',
		"shortname": '衡山县',
		"parentid": '430400'
	},
	{
		"id": '430424',
		"shortname": '衡东县',
		"parentid": '430400'
	},
	{
		"id": '430426',
		"shortname": '祁东县',
		"parentid": '430400'
	},
	{
		"id": '430481',
		"shortname": '耒阳市',
		"parentid": '430400'
	},
	{
		"id": '430482',
		"shortname": '常宁市',
		"parentid": '430400'
	},
	{
		"id": '430502',
		"shortname": '双清区',
		"parentid": '430500'
	},
	{
		"id": '430503',
		"shortname": '大祥区',
		"parentid": '430500'
	},
	{
		"id": '430511',
		"shortname": '北塔区',
		"parentid": '430500'
	},
	{
		"id": '430521',
		"shortname": '邵东县',
		"parentid": '430500'
	},
	{
		"id": '430522',
		"shortname": '新邵县',
		"parentid": '430500'
	},
	{
		"id": '430523',
		"shortname": '邵阳县',
		"parentid": '430500'
	},
	{
		"id": '430524',
		"shortname": '隆回县',
		"parentid": '430500'
	},
	{
		"id": '430525',
		"shortname": '洞口县',
		"parentid": '430500'
	},
	{
		"id": '430527',
		"shortname": '绥宁县',
		"parentid": '430500'
	},
	{
		"id": '430528',
		"shortname": '新宁县',
		"parentid": '430500'
	},
	{
		"id": '430529',
		"shortname": '城步苗族自治县',
		"parentid": '430500'
	},
	{
		"id": '430581',
		"shortname": '武冈市',
		"parentid": '430500'
	},
	{
		"id": '430602',
		"shortname": '岳阳楼区',
		"parentid": '430600'
	},
	{
		"id": '430603',
		"shortname": '云溪区',
		"parentid": '430600'
	},
	{
		"id": '430611',
		"shortname": '君山区',
		"parentid": '430600'
	},
	{
		"id": '430621',
		"shortname": '岳阳县',
		"parentid": '430600'
	},
	{
		"id": '430623',
		"shortname": '华容县',
		"parentid": '430600'
	},
	{
		"id": '430624',
		"shortname": '湘阴县',
		"parentid": '430600'
	},
	{
		"id": '430626',
		"shortname": '平江县',
		"parentid": '430600'
	},
	{
		"id": '430640',
		"shortname": '开发区',
		"parentid": '430600'
	},
	{
		"id": '430641',
		"shortname": '屈原区',
		"parentid": '430600'
	},
	{
		"id": '430681',
		"shortname": '汨罗市',
		"parentid": '430600'
	},
	{
		"id": '430682',
		"shortname": '临湘市',
		"parentid": '430600'
	},
	{
		"id": '430702',
		"shortname": '武陵区',
		"parentid": '430700'
	},
	{
		"id": '430721',
		"shortname": '安乡县',
		"parentid": '430700'
	},
	{
		"id": '430722',
		"shortname": '汉寿县',
		"parentid": '430700'
	},
	{
		"id": '430723',
		"shortname": '澧县',
		"parentid": '430700'
	},
	{
		"id": '430724',
		"shortname": '临澧县',
		"parentid": '430700'
	},
	{
		"id": '430725',
		"shortname": '桃源县',
		"parentid": '430700'
	},
	{
		"id": '430726',
		"shortname": '石门县',
		"parentid": '430700'
	},
	{
		"id": '430741',
		"shortname": '西湖区',
		"parentid": '430700'
	},
	{
		"id": '430781',
		"shortname": '津市市',
		"parentid": '430700'
	},
	{
		"id": '430703',
		"shortname": '鼎城区',
		"parentid": '430700'
	},
	{
		"id": '430740',
		"shortname": '洞庭湖区',
		"parentid": '430700'
	},
	{
		"id": '430802',
		"shortname": '永定区',
		"parentid": '430800'
	},
	{
		"id": '430811',
		"shortname": '武陵源区',
		"parentid": '430800'
	},
	{
		"id": '430821',
		"shortname": '慈利县',
		"parentid": '430800'
	},
	{
		"id": '430822',
		"shortname": '桑植县',
		"parentid": '430800'
	},
	{
		"id": '430903',
		"shortname": '赫山区',
		"parentid": '430900'
	},
	{
		"id": '430921',
		"shortname": '南县',
		"parentid": '430900'
	},
	{
		"id": '430922',
		"shortname": '桃江县',
		"parentid": '430900'
	},
	{
		"id": '430923',
		"shortname": '安化县',
		"parentid": '430900'
	},
	{
		"id": '430940',
		"shortname": '大通湖区',
		"parentid": '430900'
	},
	{
		"id": '430981',
		"shortname": '沅江市',
		"parentid": '430900'
	},
	{
		"id": '430902',
		"shortname": '资阳区',
		"parentid": '430900'
	},
	{
		"id": '431024',
		"shortname": '嘉禾县',
		"parentid": '431000'
	},
	{
		"id": '431025',
		"shortname": '临武县',
		"parentid": '431000'
	},
	{
		"id": '431026',
		"shortname": '汝城县',
		"parentid": '431000'
	},
	{
		"id": '431028',
		"shortname": '安仁县',
		"parentid": '431000'
	},
	{
		"id": '431081',
		"shortname": '资兴市',
		"parentid": '431000'
	},
	{
		"id": '431002',
		"shortname": '北湖区',
		"parentid": '431000'
	},
	{
		"id": '431003',
		"shortname": '苏仙区',
		"parentid": '431000'
	},
	{
		"id": '431021',
		"shortname": '桂阳县',
		"parentid": '431000'
	},
	{
		"id": '431022',
		"shortname": '宜章县',
		"parentid": '431000'
	},
	{
		"id": '431023',
		"shortname": '永兴县',
		"parentid": '431000'
	},
	{
		"id": '431027',
		"shortname": '桂东县',
		"parentid": '431000'
	},
	{
		"id": '431125',
		"shortname": '江永县',
		"parentid": '431100'
	},
	{
		"id": '431126',
		"shortname": '宁远县',
		"parentid": '431100'
	},
	{
		"id": '431127',
		"shortname": '蓝山县',
		"parentid": '431100'
	},
	{
		"id": '431128',
		"shortname": '新田县',
		"parentid": '431100'
	},
	{
		"id": '431129',
		"shortname": '江华瑶族自治县',
		"parentid": '431100'
	},
	{
		"id": '431140',
		"shortname": '回龙圩区',
		"parentid": '431100'
	},
	{
		"id": '431102',
		"shortname": '零陵区',
		"parentid": '431100'
	},
	{
		"id": '431103',
		"shortname": '冷水滩区',
		"parentid": '431100'
	},
	{
		"id": '431121',
		"shortname": '祁阳县',
		"parentid": '431100'
	},
	{
		"id": '431122',
		"shortname": '东安县',
		"parentid": '431100'
	},
	{
		"id": '431124',
		"shortname": '道县',
		"parentid": '431100'
	},
	{
		"id": '431123',
		"shortname": '双牌县',
		"parentid": '431100'
	},
	{
		"id": '431202',
		"shortname": '鹤城区',
		"parentid": '431200'
	},
	{
		"id": '431221',
		"shortname": '中方县',
		"parentid": '431200'
	},
	{
		"id": '431222',
		"shortname": '沅陵县',
		"parentid": '431200'
	},
	{
		"id": '431223',
		"shortname": '辰溪县',
		"parentid": '431200'
	},
	{
		"id": '431224',
		"shortname": '溆浦县',
		"parentid": '431200'
	},
	{
		"id": '431225',
		"shortname": '会同县',
		"parentid": '431200'
	},
	{
		"id": '431226',
		"shortname": '麻阳苗族自治县',
		"parentid": '431200'
	},
	{
		"id": '431227',
		"shortname": '新晃侗族自治县',
		"parentid": '431200'
	},
	{
		"id": '431228',
		"shortname": '芷江侗族自治县',
		"parentid": '431200'
	},
	{
		"id": '431229',
		"shortname": '靖州苗族侗族自治县',
		"parentid": '431200'
	},
	{
		"id": '431230',
		"shortname": '通道侗族自治县',
		"parentid": '431200'
	},
	{
		"id": '431240',
		"shortname": '洪江区',
		"parentid": '431200'
	},
	{
		"id": '431281',
		"shortname": '洪江市',
		"parentid": '431200'
	},
	{
		"id": '431302',
		"shortname": '娄星区',
		"parentid": '431300'
	},
	{
		"id": '431321',
		"shortname": '双峰县',
		"parentid": '431300'
	},
	{
		"id": '431322',
		"shortname": '新化县',
		"parentid": '431300'
	},
	{
		"id": '431381',
		"shortname": '冷水江市',
		"parentid": '431300'
	},
	{
		"id": '431382',
		"shortname": '涟源市',
		"parentid": '431300'
	},
	{
		"id": '433101',
		"shortname": '吉首市',
		"parentid": '433100'
	},
	{
		"id": '433122',
		"shortname": '泸溪县',
		"parentid": '433100'
	},
	{
		"id": '433123',
		"shortname": '凤凰县',
		"parentid": '433100'
	},
	{
		"id": '433124',
		"shortname": '花垣县',
		"parentid": '433100'
	},
	{
		"id": '433125',
		"shortname": '保靖县',
		"parentid": '433100'
	},
	{
		"id": '433126',
		"shortname": '古丈县',
		"parentid": '433100'
	},
	{
		"id": '433127',
		"shortname": '永顺县',
		"parentid": '433100'
	},
	{
		"id": '433130',
		"shortname": '龙山县',
		"parentid": '433100'
	},
	{
		"id": '440103',
		"shortname": '荔湾区',
		"parentid": '440100'
	},
	{
		"id": '440104',
		"shortname": '越秀区',
		"parentid": '440100'
	},
	{
		"id": '440105',
		"shortname": '海珠区',
		"parentid": '440100'
	},
	{
		"id": '440106',
		"shortname": '天河区',
		"parentid": '440100'
	},
	{
		"id": '440111',
		"shortname": '白云区',
		"parentid": '440100'
	},
	{
		"id": '440112',
		"shortname": '黄埔区',
		"parentid": '440100'
	},
	{
		"id": '440113',
		"shortname": '番禺区',
		"parentid": '440100'
	},
	{
		"id": '440114',
		"shortname": '花都区',
		"parentid": '440100'
	},
	{
		"id": '440115',
		"shortname": '南沙区',
		"parentid": '440100'
	},
	{
		"id": '440116',
		"shortname": '萝岗区',
		"parentid": '440100'
	},
	{
		"id": '440183',
		"shortname": '增城市',
		"parentid": '440100'
	},
	{
		"id": '440184',
		"shortname": '从化市',
		"parentid": '440100'
	},
	{
		"id": '440203',
		"shortname": '武江区',
		"parentid": '440200'
	},
	{
		"id": '440204',
		"shortname": '浈江区',
		"parentid": '440200'
	},
	{
		"id": '440222',
		"shortname": '始兴县',
		"parentid": '440200'
	},
	{
		"id": '440224',
		"shortname": '仁化县',
		"parentid": '440200'
	},
	{
		"id": '440229',
		"shortname": '翁源县',
		"parentid": '440200'
	},
	{
		"id": '440232',
		"shortname": '乳源瑶族自治县',
		"parentid": '440200'
	},
	{
		"id": '440233',
		"shortname": '新丰县',
		"parentid": '440200'
	},
	{
		"id": '440281',
		"shortname": '乐昌市',
		"parentid": '440200'
	},
	{
		"id": '440205',
		"shortname": '曲江区',
		"parentid": '440200'
	},
	{
		"id": '440282',
		"shortname": '南雄市',
		"parentid": '440200'
	},
	{
		"id": '440304',
		"shortname": '福田区',
		"parentid": '440300'
	},
	{
		"id": '440507',
		"shortname": '龙湖区',
		"parentid": '440500'
	},
	{
		"id": '440511',
		"shortname": '金平区',
		"parentid": '440500'
	},
	{
		"id": '440512',
		"shortname": '濠江区',
		"parentid": '440500'
	},
	{
		"id": '440513',
		"shortname": '潮阳区',
		"parentid": '440500'
	},
	{
		"id": '440514',
		"shortname": '潮南区',
		"parentid": '440500'
	},
	{
		"id": '440515',
		"shortname": '澄海区',
		"parentid": '440500'
	},
	{
		"id": '440523',
		"shortname": '南澳县',
		"parentid": '440500'
	},
	{
		"id": '440604',
		"shortname": '禅城区',
		"parentid": '440600'
	},
	{
		"id": '440605',
		"shortname": '南海区',
		"parentid": '440600'
	},
	{
		"id": '440606',
		"shortname": '顺德区',
		"parentid": '440600'
	},
	{
		"id": '440607',
		"shortname": '三水区',
		"parentid": '440600'
	},
	{
		"id": '440608',
		"shortname": '高明区',
		"parentid": '440600'
	},
	{
		"id": '440703',
		"shortname": '蓬江区',
		"parentid": '440700'
	},
	{
		"id": '440704',
		"shortname": '江海区',
		"parentid": '440700'
	},
	{
		"id": '440781',
		"shortname": '台山市',
		"parentid": '440700'
	},
	{
		"id": '440783',
		"shortname": '开平市',
		"parentid": '440700'
	},
	{
		"id": '440784',
		"shortname": '鹤山市',
		"parentid": '440700'
	},
	{
		"id": '440785',
		"shortname": '恩平市',
		"parentid": '440700'
	},
	{
		"id": '440705',
		"shortname": '新会区',
		"parentid": '440700'
	},
	{
		"id": '440802',
		"shortname": '赤坎区',
		"parentid": '440800'
	},
	{
		"id": '440803',
		"shortname": '霞山区',
		"parentid": '440800'
	},
	{
		"id": '440804',
		"shortname": '坡头区',
		"parentid": '440800'
	},
	{
		"id": '440811',
		"shortname": '麻章区',
		"parentid": '440800'
	},
	{
		"id": '440823',
		"shortname": '遂溪县',
		"parentid": '440800'
	},
	{
		"id": '440825',
		"shortname": '徐闻县',
		"parentid": '440800'
	},
	{
		"id": '440881',
		"shortname": '廉江市',
		"parentid": '440800'
	},
	{
		"id": '440882',
		"shortname": '雷州市',
		"parentid": '440800'
	},
	{
		"id": '440883',
		"shortname": '吴川市',
		"parentid": '440800'
	},
	{
		"id": '440902',
		"shortname": '茂南区',
		"parentid": '440900'
	},
	{
		"id": '440903',
		"shortname": '茂港区',
		"parentid": '440900'
	},
	{
		"id": '440923',
		"shortname": '电白县',
		"parentid": '440900'
	},
	{
		"id": '440981',
		"shortname": '高州市',
		"parentid": '440900'
	},
	{
		"id": '440982',
		"shortname": '化州市',
		"parentid": '440900'
	},
	{
		"id": '440983',
		"shortname": '信宜市',
		"parentid": '440900'
	},
	{
		"id": '441202',
		"shortname": '端州区',
		"parentid": '441200'
	},
	{
		"id": '441203',
		"shortname": '鼎湖区',
		"parentid": '441200'
	},
	{
		"id": '441223',
		"shortname": '广宁县',
		"parentid": '441200'
	},
	{
		"id": '441224',
		"shortname": '怀集县',
		"parentid": '441200'
	},
	{
		"id": '441225',
		"shortname": '封开县',
		"parentid": '441200'
	},
	{
		"id": '441226',
		"shortname": '德庆县',
		"parentid": '441200'
	},
	{
		"id": '441240',
		"shortname": '高新区',
		"parentid": '441200'
	},
	{
		"id": '441283',
		"shortname": '高要市',
		"parentid": '441200'
	},
	{
		"id": '441284',
		"shortname": '四会市',
		"parentid": '441200'
	},
	{
		"id": '441302',
		"shortname": '惠城区',
		"parentid": '441300'
	},
	{
		"id": '441303',
		"shortname": '惠阳区',
		"parentid": '441300'
	},
	{
		"id": '441322',
		"shortname": '博罗县',
		"parentid": '441300'
	},
	{
		"id": '441323',
		"shortname": '惠东县',
		"parentid": '441300'
	},
	{
		"id": '441324',
		"shortname": '龙门县',
		"parentid": '441300'
	},
	{
		"id": '441340',
		"shortname": '大亚湾经济开发区',
		"parentid": '441300'
	},
	{
		"id": '441402',
		"shortname": '梅江区',
		"parentid": '441400'
	},
	{
		"id": '441421',
		"shortname": '梅县',
		"parentid": '441400'
	},
	{
		"id": '441422',
		"shortname": '大埔县',
		"parentid": '441400'
	},
	{
		"id": '441423',
		"shortname": '丰顺县',
		"parentid": '441400'
	},
	{
		"id": '441424',
		"shortname": '五华县',
		"parentid": '441400'
	},
	{
		"id": '441426',
		"shortname": '平远县',
		"parentid": '441400'
	},
	{
		"id": '441427',
		"shortname": '蕉岭县',
		"parentid": '441400'
	},
	{
		"id": '441481',
		"shortname": '兴宁市',
		"parentid": '441400'
	},
	{
		"id": '441502',
		"shortname": '城区',
		"parentid": '441500'
	},
	{
		"id": '441521',
		"shortname": '海丰县',
		"parentid": '441500'
	},
	{
		"id": '441523',
		"shortname": '陆河县',
		"parentid": '441500'
	},
	{
		"id": '441540',
		"shortname": '红海湾',
		"parentid": '441500'
	},
	{
		"id": '441541',
		"shortname": '农垦',
		"parentid": '441500'
	},
	{
		"id": '441542',
		"shortname": '华侨管理区',
		"parentid": '441500'
	},
	{
		"id": '441580',
		"shortname": '陆丰市',
		"parentid": '441500'
	},
	{
		"id": '441602',
		"shortname": '源城区',
		"parentid": '441600'
	},
	{
		"id": '441621',
		"shortname": '紫金县',
		"parentid": '441600'
	},
	{
		"id": '441622',
		"shortname": '龙川县',
		"parentid": '441600'
	},
	{
		"id": '441623',
		"shortname": '连平县',
		"parentid": '441600'
	},
	{
		"id": '441624',
		"shortname": '和平县',
		"parentid": '441600'
	},
	{
		"id": '441625',
		"shortname": '东源县',
		"parentid": '441600'
	},
	{
		"id": '441702',
		"shortname": '江城区',
		"parentid": '441700'
	},
	{
		"id": '441721',
		"shortname": '阳西县',
		"parentid": '441700'
	},
	{
		"id": '441723',
		"shortname": '阳东县',
		"parentid": '441700'
	},
	{
		"id": '441740',
		"shortname": '岗侨区',
		"parentid": '441700'
	},
	{
		"id": '441741',
		"shortname": '农垦',
		"parentid": '441700'
	},
	{
		"id": '441742',
		"shortname": '海陵区',
		"parentid": '441700'
	},
	{
		"id": '441780',
		"shortname": '阳春市',
		"parentid": '441700'
	},
	{
		"id": '441802',
		"shortname": '清城区',
		"parentid": '441800'
	},
	{
		"id": '441821',
		"shortname": '佛冈县',
		"parentid": '441800'
	},
	{
		"id": '441825',
		"shortname": '连山壮族瑶族自治县',
		"parentid": '441800'
	},
	{
		"id": '441826',
		"shortname": '连南瑶族自治县',
		"parentid": '441800'
	},
	{
		"id": '441827',
		"shortname": '清新县',
		"parentid": '441800'
	},
	{
		"id": '441881',
		"shortname": '英德市',
		"parentid": '441800'
	},
	{
		"id": '441882',
		"shortname": '连州市',
		"parentid": '441800'
	},
	{
		"id": '441823',
		"shortname": '阳山县',
		"parentid": '441800'
	},
	{
		"id": '445102',
		"shortname": '湘桥区',
		"parentid": '445100'
	},
	{
		"id": '445122',
		"shortname": '饶平县',
		"parentid": '445100'
	},
	{
		"id": '445121',
		"shortname": '潮安县',
		"parentid": '445100'
	},
	{
		"id": '445202',
		"shortname": '榕城区',
		"parentid": '445200'
	},
	{
		"id": '445221',
		"shortname": '揭东县',
		"parentid": '445200'
	},
	{
		"id": '445222',
		"shortname": '揭西县',
		"parentid": '445200'
	},
	{
		"id": '445224',
		"shortname": '惠来县',
		"parentid": '445200'
	},
	{
		"id": '445240',
		"shortname": '东山区',
		"parentid": '445200'
	},
	{
		"id": '445241',
		"shortname": '实验区',
		"parentid": '445200'
	},
	{
		"id": '445242',
		"shortname": '大南山区',
		"parentid": '445200'
	},
	{
		"id": '445243',
		"shortname": '普侨区',
		"parentid": '445200'
	},
	{
		"id": '445281',
		"shortname": '普宁市',
		"parentid": '445200'
	},
	{
		"id": '445302',
		"shortname": '云城区',
		"parentid": '445300'
	},
	{
		"id": '445321',
		"shortname": '新兴县',
		"parentid": '445300'
	},
	{
		"id": '445322',
		"shortname": '郁南县',
		"parentid": '445300'
	},
	{
		"id": '445323',
		"shortname": '云安县',
		"parentid": '445300'
	},
	{
		"id": '445381',
		"shortname": '罗定市',
		"parentid": '445300'
	},
	{
		"id": '450102',
		"shortname": '兴宁区',
		"parentid": '450100'
	},
	{
		"id": '450103',
		"shortname": '青秀区',
		"parentid": '450100'
	},
	{
		"id": '450105',
		"shortname": '江南区',
		"parentid": '450100'
	},
	{
		"id": '450107',
		"shortname": '西乡塘区',
		"parentid": '450100'
	},
	{
		"id": '450108',
		"shortname": '良庆区',
		"parentid": '450100'
	},
	{
		"id": '450109',
		"shortname": '邕宁区',
		"parentid": '450100'
	},
	{
		"id": '450122',
		"shortname": '武鸣县',
		"parentid": '450100'
	},
	{
		"id": '450123',
		"shortname": '隆安县',
		"parentid": '450100'
	},
	{
		"id": '450124',
		"shortname": '马山县',
		"parentid": '450100'
	},
	{
		"id": '450125',
		"shortname": '上林县',
		"parentid": '450100'
	},
	{
		"id": '450126',
		"shortname": '宾阳县',
		"parentid": '450100'
	},
	{
		"id": '450127',
		"shortname": '横县',
		"parentid": '450100'
	},
	{
		"id": '450202',
		"shortname": '城中区',
		"parentid": '450200'
	},
	{
		"id": '450203',
		"shortname": '鱼峰区',
		"parentid": '450200'
	},
	{
		"id": '450204',
		"shortname": '柳南区',
		"parentid": '450200'
	},
	{
		"id": '450205',
		"shortname": '柳北区',
		"parentid": '450200'
	},
	{
		"id": '450221',
		"shortname": '柳江县',
		"parentid": '450200'
	},
	{
		"id": '450222',
		"shortname": '柳城县',
		"parentid": '450200'
	},
	{
		"id": '450223',
		"shortname": '鹿寨县',
		"parentid": '450200'
	},
	{
		"id": '450224',
		"shortname": '融安县',
		"parentid": '450200'
	},
	{
		"id": '450225',
		"shortname": '融水苗族自治县',
		"parentid": '450200'
	},
	{
		"id": '450226',
		"shortname": '三江侗族自治县',
		"parentid": '450200'
	},
	{
		"id": '450331',
		"shortname": '荔浦县',
		"parentid": '450300'
	},
	{
		"id": '450302',
		"shortname": '秀峰区',
		"parentid": '450300'
	},
	{
		"id": '450303',
		"shortname": '叠彩区',
		"parentid": '450300'
	},
	{
		"id": '450304',
		"shortname": '象山区',
		"parentid": '450300'
	},
	{
		"id": '450305',
		"shortname": '七星区',
		"parentid": '450300'
	},
	{
		"id": '450311',
		"shortname": '雁山区',
		"parentid": '450300'
	},
	{
		"id": '450321',
		"shortname": '阳朔县',
		"parentid": '450300'
	},
	{
		"id": '450322',
		"shortname": '临桂县',
		"parentid": '450300'
	},
	{
		"id": '450323',
		"shortname": '灵川县',
		"parentid": '450300'
	},
	{
		"id": '450324',
		"shortname": '全州县',
		"parentid": '450300'
	},
	{
		"id": '450325',
		"shortname": '兴安县',
		"parentid": '450300'
	},
	{
		"id": '450326',
		"shortname": '永福县',
		"parentid": '450300'
	},
	{
		"id": '450327',
		"shortname": '灌阳县',
		"parentid": '450300'
	},
	{
		"id": '450328',
		"shortname": '龙胜各族自治县',
		"parentid": '450300'
	},
	{
		"id": '450329',
		"shortname": '资源县',
		"parentid": '450300'
	},
	{
		"id": '450330',
		"shortname": '平乐县',
		"parentid": '450300'
	},
	{
		"id": '450332',
		"shortname": '恭城瑶族自治县',
		"parentid": '450300'
	},
	{
		"id": '450481',
		"shortname": '岑溪市',
		"parentid": '450400'
	},
	{
		"id": '450403',
		"shortname": '万秀区',
		"parentid": '450400'
	},
	{
		"id": '450404',
		"shortname": '蝶山区',
		"parentid": '450400'
	},
	{
		"id": '450405',
		"shortname": '长洲区',
		"parentid": '450400'
	},
	{
		"id": '450421',
		"shortname": '苍梧县',
		"parentid": '450400'
	},
	{
		"id": '450422',
		"shortname": '藤县',
		"parentid": '450400'
	},
	{
		"id": '450423',
		"shortname": '蒙山县',
		"parentid": '450400'
	},
	{
		"id": '450502',
		"shortname": '海城区',
		"parentid": '450500'
	},
	{
		"id": '450503',
		"shortname": '银海区',
		"parentid": '450500'
	},
	{
		"id": '450512',
		"shortname": '铁山港区',
		"parentid": '450500'
	},
	{
		"id": '450521',
		"shortname": '合浦县',
		"parentid": '450500'
	},
	{
		"id": '450602',
		"shortname": '港口区',
		"parentid": '450600'
	},
	{
		"id": '450603',
		"shortname": '防城区',
		"parentid": '450600'
	},
	{
		"id": '450621',
		"shortname": '上思县',
		"parentid": '450600'
	},
	{
		"id": '450681',
		"shortname": '东兴市',
		"parentid": '450600'
	},
	{
		"id": '450702',
		"shortname": '钦南区',
		"parentid": '450700'
	},
	{
		"id": '450703',
		"shortname": '钦北区',
		"parentid": '450700'
	},
	{
		"id": '450721',
		"shortname": '灵山县',
		"parentid": '450700'
	},
	{
		"id": '450722',
		"shortname": '浦北县',
		"parentid": '450700'
	},
	{
		"id": '450802',
		"shortname": '港北区',
		"parentid": '450800'
	},
	{
		"id": '450803',
		"shortname": '港南区',
		"parentid": '450800'
	},
	{
		"id": '450804',
		"shortname": '覃塘区',
		"parentid": '450800'
	},
	{
		"id": '450821',
		"shortname": '平南县',
		"parentid": '450800'
	},
	{
		"id": '450881',
		"shortname": '桂平市',
		"parentid": '450800'
	},
	{
		"id": '450921',
		"shortname": '容县',
		"parentid": '450900'
	},
	{
		"id": '450922',
		"shortname": '陆川县',
		"parentid": '450900'
	},
	{
		"id": '450923',
		"shortname": '博白县',
		"parentid": '450900'
	},
	{
		"id": '450924',
		"shortname": '兴业县',
		"parentid": '450900'
	},
	{
		"id": '450981',
		"shortname": '北流市',
		"parentid": '450900'
	},
	{
		"id": '450902',
		"shortname": '玉州区',
		"parentid": '450900'
	},
	{
		"id": '451021',
		"shortname": '田阳县',
		"parentid": '451000'
	},
	{
		"id": '451022',
		"shortname": '田东县',
		"parentid": '451000'
	},
	{
		"id": '451023',
		"shortname": '平果县',
		"parentid": '451000'
	},
	{
		"id": '451024',
		"shortname": '德保县',
		"parentid": '451000'
	},
	{
		"id": '451025',
		"shortname": '靖西县',
		"parentid": '451000'
	},
	{
		"id": '451026',
		"shortname": '那坡县',
		"parentid": '451000'
	},
	{
		"id": '451027',
		"shortname": '凌云县',
		"parentid": '451000'
	},
	{
		"id": '451029',
		"shortname": '田林县',
		"parentid": '451000'
	},
	{
		"id": '451030',
		"shortname": '西林县',
		"parentid": '451000'
	},
	{
		"id": '451031',
		"shortname": '隆林各族自治县',
		"parentid": '451000'
	},
	{
		"id": '451002',
		"shortname": '右江区',
		"parentid": '451000'
	},
	{
		"id": '451028',
		"shortname": '乐业县',
		"parentid": '451000'
	},
	{
		"id": '451102',
		"shortname": '八步区',
		"parentid": '451100'
	},
	{
		"id": '451121',
		"shortname": '昭平县',
		"parentid": '451100'
	},
	{
		"id": '451122',
		"shortname": '钟山县',
		"parentid": '451100'
	},
	{
		"id": '451123',
		"shortname": '富川瑶族自治县',
		"parentid": '451100'
	},
	{
		"id": '451221',
		"shortname": '南丹县',
		"parentid": '451200'
	},
	{
		"id": '451222',
		"shortname": '天峨县',
		"parentid": '451200'
	},
	{
		"id": '451223',
		"shortname": '凤山县',
		"parentid": '451200'
	},
	{
		"id": '451224',
		"shortname": '东兰县',
		"parentid": '451200'
	},
	{
		"id": '451225',
		"shortname": '罗城仫佬族自治县',
		"parentid": '451200'
	},
	{
		"id": '451226',
		"shortname": '环江毛南族自治县',
		"parentid": '451200'
	},
	{
		"id": '451227',
		"shortname": '巴马瑶族自治县',
		"parentid": '451200'
	},
	{
		"id": '451228',
		"shortname": '都安瑶族自治县',
		"parentid": '451200'
	},
	{
		"id": '451229',
		"shortname": '大化瑶族自治县',
		"parentid": '451200'
	},
	{
		"id": '451281',
		"shortname": '宜州市',
		"parentid": '451200'
	},
	{
		"id": '451202',
		"shortname": '金城江区',
		"parentid": '451200'
	},
	{
		"id": '451302',
		"shortname": '兴宾区',
		"parentid": '451300'
	},
	{
		"id": '451321',
		"shortname": '忻城县',
		"parentid": '451300'
	},
	{
		"id": '451322',
		"shortname": '象州县',
		"parentid": '451300'
	},
	{
		"id": '451323',
		"shortname": '武宣县',
		"parentid": '451300'
	},
	{
		"id": '451324',
		"shortname": '金秀瑶族自治县',
		"parentid": '451300'
	},
	{
		"id": '451381',
		"shortname": '合山市',
		"parentid": '451300'
	},
	{
		"id": '451421',
		"shortname": '扶绥县',
		"parentid": '451400'
	},
	{
		"id": '451422',
		"shortname": '宁明县',
		"parentid": '451400'
	},
	{
		"id": '451423',
		"shortname": '龙州县',
		"parentid": '451400'
	},
	{
		"id": '451424',
		"shortname": '大新县',
		"parentid": '451400'
	},
	{
		"id": '451425',
		"shortname": '天等县',
		"parentid": '451400'
	},
	{
		"id": '451481',
		"shortname": '凭祥市',
		"parentid": '451400'
	},
	{
		"id": '451402',
		"shortname": '江州区',
		"parentid": '451400'
	},
	{
		"id": '460105',
		"shortname": '秀英区',
		"parentid": '460100'
	},
	{
		"id": '460106',
		"shortname": '龙华区',
		"parentid": '460100'
	},
	{
		"id": '460107',
		"shortname": '琼山区',
		"parentid": '460100'
	},
	{
		"id": '460108',
		"shortname": '美兰区',
		"parentid": '460100'
	},
	{
		"id": '469001',
		"shortname": '五指山市',
		"parentid": '469000'
	},
	{
		"id": '469002',
		"shortname": '琼海市',
		"parentid": '469000'
	},
	{
		"id": '469003',
		"shortname": '儋州市',
		"parentid": '469000'
	},
	{
		"id": '469005',
		"shortname": '文昌市',
		"parentid": '469000'
	},
	{
		"id": '469006',
		"shortname": '万宁市',
		"parentid": '469000'
	},
	{
		"id": '469007',
		"shortname": '东方市',
		"parentid": '469000'
	},
	{
		"id": '469021',
		"shortname": '定安县',
		"parentid": '469000'
	},
	{
		"id": '469022',
		"shortname": '屯昌县',
		"parentid": '469000'
	},
	{
		"id": '469023',
		"shortname": '澄迈县',
		"parentid": '469000'
	},
	{
		"id": '469024',
		"shortname": '临高县',
		"parentid": '469000'
	},
	{
		"id": '469025',
		"shortname": '白沙黎族自治县',
		"parentid": '469000'
	},
	{
		"id": '469026',
		"shortname": '昌江黎族自治县',
		"parentid": '469000'
	},
	{
		"id": '469027',
		"shortname": '乐东黎族自治县',
		"parentid": '469000'
	},
	{
		"id": '469028',
		"shortname": '陵水黎族自治县',
		"parentid": '469000'
	},
	{
		"id": '469029',
		"shortname": '保亭黎族苗族自治县',
		"parentid": '469000'
	},
	{
		"id": '469030',
		"shortname": '琼中黎族苗族自治县',
		"parentid": '469000'
	},
	{
		"id": '500101',
		"shortname": '万州区',
		"parentid": '509900'
	},
	{
		"id": '500102',
		"shortname": '涪陵区',
		"parentid": '509900'
	},
	{
		"id": '500103',
		"shortname": '渝中区',
		"parentid": '509900'
	},
	{
		"id": '500104',
		"shortname": '大渡口区',
		"parentid": '509900'
	},
	{
		"id": '500105',
		"shortname": '江北区',
		"parentid": '509900'
	},
	{
		"id": '500106',
		"shortname": '沙坪坝区',
		"parentid": '509900'
	},
	{
		"id": '500107',
		"shortname": '九龙坡区',
		"parentid": '509900'
	},
	{
		"id": '500108',
		"shortname": '南岸区',
		"parentid": '509900'
	},
	{
		"id": '500109',
		"shortname": '北碚区',
		"parentid": '509900'
	},
	{
		"id": '500112',
		"shortname": '渝北区',
		"parentid": '509900'
	},
	{
		"id": '500113',
		"shortname": '巴南区',
		"parentid": '509900'
	},
	{
		"id": '500114',
		"shortname": '黔江区',
		"parentid": '509900'
	},
	{
		"id": '500115',
		"shortname": '长寿区',
		"parentid": '509900'
	},
	{
		"id": '500116',
		"shortname": '江津区',
		"parentid": '509900'
	},
	{
		"id": '500117',
		"shortname": '合川区',
		"parentid": '509900'
	},
	{
		"id": '500118',
		"shortname": '永川区',
		"parentid": '509900'
	},
	{
		"id": '500119',
		"shortname": '南川区',
		"parentid": '509900'
	},
	{
		"id": '500142',
		"shortname": '北部新区',
		"parentid": '509900'
	},
	{
		"id": '500222',
		"shortname": '綦江县',
		"parentid": '509900'
	},
	{
		"id": '500110',
		"shortname": '綦江区',
		"parentid": '509900'
	},
	{
		"id": '500111',
		"shortname": '大足区',
		"parentid": '509900'
	},
	{
		"id": '500223',
		"shortname": '潼南县',
		"parentid": '509900'
	},
	{
		"id": '500224',
		"shortname": '铜梁县',
		"parentid": '509900'
	},
	{
		"id": '500225',
		"shortname": '大足县',
		"parentid": '509900'
	},
	{
		"id": '500226',
		"shortname": '荣昌县',
		"parentid": '509900'
	},
	{
		"id": '500227',
		"shortname": '璧山县',
		"parentid": '509900'
	},
	{
		"id": '500228',
		"shortname": '梁平县',
		"parentid": '509900'
	},
	{
		"id": '500229',
		"shortname": '城口县',
		"parentid": '509900'
	},
	{
		"id": '500230',
		"shortname": '丰都县',
		"parentid": '509900'
	},
	{
		"id": '500231',
		"shortname": '垫江县',
		"parentid": '509900'
	},
	{
		"id": '500232',
		"shortname": '武隆县',
		"parentid": '509900'
	},
	{
		"id": '500233',
		"shortname": '忠县',
		"parentid": '509900'
	},
	{
		"id": '500234',
		"shortname": '开县',
		"parentid": '509900'
	},
	{
		"id": '500235',
		"shortname": '云阳县',
		"parentid": '509900'
	},
	{
		"id": '500236',
		"shortname": '奉节县',
		"parentid": '509900'
	},
	{
		"id": '500237',
		"shortname": '巫山县',
		"parentid": '509900'
	},
	{
		"id": '500238',
		"shortname": '巫溪县',
		"parentid": '509900'
	},
	{
		"id": '500240',
		"shortname": '石柱土家族自治县',
		"parentid": '509900'
	},
	{
		"id": '500241',
		"shortname": '秀山土家族苗族自治县',
		"parentid": '509900'
	},
	{
		"id": '500242',
		"shortname": '酉阳土家族苗族自治县',
		"parentid": '509900'
	},
	{
		"id": '500243',
		"shortname": '彭水苗族土家族自治县',
		"parentid": '509900'
	},
	{
		"id": '510104',
		"shortname": '锦江区',
		"parentid": '510100'
	},
	{
		"id": '510105',
		"shortname": '青羊区',
		"parentid": '510100'
	},
	{
		"id": '510106',
		"shortname": '金牛区',
		"parentid": '510100'
	},
	{
		"id": '510107',
		"shortname": '武侯区',
		"parentid": '510100'
	},
	{
		"id": '510108',
		"shortname": '成华区',
		"parentid": '510100'
	},
	{
		"id": '510112',
		"shortname": '龙泉驿区',
		"parentid": '510100'
	},
	{
		"id": '510113',
		"shortname": '青白江区',
		"parentid": '510100'
	},
	{
		"id": '510114',
		"shortname": '新都区',
		"parentid": '510100'
	},
	{
		"id": '510115',
		"shortname": '温江区',
		"parentid": '510100'
	},
	{
		"id": '510121',
		"shortname": '金堂县',
		"parentid": '510100'
	},
	{
		"id": '510122',
		"shortname": '双流县',
		"parentid": '510100'
	},
	{
		"id": '510124',
		"shortname": '郫县',
		"parentid": '510100'
	},
	{
		"id": '510129',
		"shortname": '大邑县',
		"parentid": '510100'
	},
	{
		"id": '510131',
		"shortname": '蒲江县',
		"parentid": '510100'
	},
	{
		"id": '510132',
		"shortname": '新津县',
		"parentid": '510100'
	},
	{
		"id": '510140',
		"shortname": '高新区',
		"parentid": '510100'
	},
	{
		"id": '510181',
		"shortname": '都江堰市',
		"parentid": '510100'
	},
	{
		"id": '510182',
		"shortname": '彭州市',
		"parentid": '510100'
	},
	{
		"id": '510183',
		"shortname": '邛崃市',
		"parentid": '510100'
	},
	{
		"id": '510184',
		"shortname": '崇州市',
		"parentid": '510100'
	},
	{
		"id": '510302',
		"shortname": '自流井区',
		"parentid": '510300'
	},
	{
		"id": '510303',
		"shortname": '贡井区',
		"parentid": '510300'
	},
	{
		"id": '510304',
		"shortname": '大安区',
		"parentid": '510300'
	},
	{
		"id": '510311',
		"shortname": '沿滩区',
		"parentid": '510300'
	},
	{
		"id": '510321',
		"shortname": '荣县',
		"parentid": '510300'
	},
	{
		"id": '510322',
		"shortname": '富顺县',
		"parentid": '510300'
	},
	{
		"id": '510402',
		"shortname": '东区',
		"parentid": '510400'
	},
	{
		"id": '510403',
		"shortname": '西区',
		"parentid": '510400'
	},
	{
		"id": '510411',
		"shortname": '仁和区',
		"parentid": '510400'
	},
	{
		"id": '510421',
		"shortname": '米易县',
		"parentid": '510400'
	},
	{
		"id": '510422',
		"shortname": '盐边县',
		"parentid": '510400'
	},
	{
		"id": '510502',
		"shortname": '江阳区',
		"parentid": '510500'
	},
	{
		"id": '510503',
		"shortname": '纳溪区',
		"parentid": '510500'
	},
	{
		"id": '510504',
		"shortname": '龙马潭区',
		"parentid": '510500'
	},
	{
		"id": '510521',
		"shortname": '泸县',
		"parentid": '510500'
	},
	{
		"id": '510522',
		"shortname": '合江县',
		"parentid": '510500'
	},
	{
		"id": '510524',
		"shortname": '叙永县',
		"parentid": '510500'
	},
	{
		"id": '510525',
		"shortname": '古蔺县',
		"parentid": '510500'
	},
	{
		"id": '510603',
		"shortname": '旌阳区',
		"parentid": '510600'
	},
	{
		"id": '510623',
		"shortname": '中江县',
		"parentid": '510600'
	},
	{
		"id": '510626',
		"shortname": '罗江县',
		"parentid": '510600'
	},
	{
		"id": '510681',
		"shortname": '广汉市',
		"parentid": '510600'
	},
	{
		"id": '510683',
		"shortname": '绵竹市',
		"parentid": '510600'
	},
	{
		"id": '510682',
		"shortname": '什邡市',
		"parentid": '510600'
	},
	{
		"id": '510703',
		"shortname": '涪城区',
		"parentid": '510700'
	},
	{
		"id": '510704',
		"shortname": '游仙区',
		"parentid": '510700'
	},
	{
		"id": '510722',
		"shortname": '三台县',
		"parentid": '510700'
	},
	{
		"id": '510723',
		"shortname": '盐亭县',
		"parentid": '510700'
	},
	{
		"id": '510724',
		"shortname": '安县',
		"parentid": '510700'
	},
	{
		"id": '510726',
		"shortname": '北川羌族自治县',
		"parentid": '510700'
	},
	{
		"id": '510727',
		"shortname": '平武县',
		"parentid": '510700'
	},
	{
		"id": '510740',
		"shortname": '高新区',
		"parentid": '510700'
	},
	{
		"id": '510781',
		"shortname": '江油市',
		"parentid": '510700'
	},
	{
		"id": '510725',
		"shortname": '梓潼县',
		"parentid": '510700'
	},
	{
		"id": '510811',
		"shortname": '昭化区',
		"parentid": '510800'
	},
	{
		"id": '510802',
		"shortname": '利州区',
		"parentid": '510800'
	},
	{
		"id": '510812',
		"shortname": '朝天区',
		"parentid": '510800'
	},
	{
		"id": '510822',
		"shortname": '青川县',
		"parentid": '510800'
	},
	{
		"id": '510823',
		"shortname": '剑阁县',
		"parentid": '510800'
	},
	{
		"id": '510824',
		"shortname": '苍溪县',
		"parentid": '510800'
	},
	{
		"id": '510821',
		"shortname": '旺苍县',
		"parentid": '510800'
	},
	{
		"id": '510903',
		"shortname": '船山区',
		"parentid": '510900'
	},
	{
		"id": '510904',
		"shortname": '安居区',
		"parentid": '510900'
	},
	{
		"id": '510921',
		"shortname": '蓬溪县',
		"parentid": '510900'
	},
	{
		"id": '510922',
		"shortname": '射洪县',
		"parentid": '510900'
	},
	{
		"id": '510923',
		"shortname": '大英县',
		"parentid": '510900'
	},
	{
		"id": '511002',
		"shortname": '市中区',
		"parentid": '511000'
	},
	{
		"id": '511011',
		"shortname": '东兴区',
		"parentid": '511000'
	},
	{
		"id": '511024',
		"shortname": '威远县',
		"parentid": '511000'
	},
	{
		"id": '511025',
		"shortname": '资中县',
		"parentid": '511000'
	},
	{
		"id": '511028',
		"shortname": '隆昌县',
		"parentid": '511000'
	},
	{
		"id": '511102',
		"shortname": '市中区',
		"parentid": '511100'
	},
	{
		"id": '511111',
		"shortname": '沙湾区',
		"parentid": '511100'
	},
	{
		"id": '511112',
		"shortname": '五通桥区',
		"parentid": '511100'
	},
	{
		"id": '511113',
		"shortname": '金口河区',
		"parentid": '511100'
	},
	{
		"id": '511123',
		"shortname": '犍为县',
		"parentid": '511100'
	},
	{
		"id": '511124',
		"shortname": '井研县',
		"parentid": '511100'
	},
	{
		"id": '511126',
		"shortname": '夹江县',
		"parentid": '511100'
	},
	{
		"id": '511132',
		"shortname": '峨边彝族自治县',
		"parentid": '511100'
	},
	{
		"id": '511133',
		"shortname": '马边彝族自治县',
		"parentid": '511100'
	},
	{
		"id": '511181',
		"shortname": '峨眉山市',
		"parentid": '511100'
	},
	{
		"id": '511129',
		"shortname": '沐川县',
		"parentid": '511100'
	},
	{
		"id": '511302',
		"shortname": '顺庆区',
		"parentid": '511300'
	},
	{
		"id": '511303',
		"shortname": '高坪区',
		"parentid": '511300'
	},
	{
		"id": '511304',
		"shortname": '嘉陵区',
		"parentid": '511300'
	},
	{
		"id": '511322',
		"shortname": '营山县',
		"parentid": '511300'
	},
	{
		"id": '511323',
		"shortname": '蓬安县',
		"parentid": '511300'
	},
	{
		"id": '511324',
		"shortname": '仪陇县',
		"parentid": '511300'
	},
	{
		"id": '511325',
		"shortname": '西充县',
		"parentid": '511300'
	},
	{
		"id": '511381',
		"shortname": '阆中市',
		"parentid": '511300'
	},
	{
		"id": '511321',
		"shortname": '南部县',
		"parentid": '511300'
	},
	{
		"id": '511402',
		"shortname": '东坡区',
		"parentid": '511400'
	},
	{
		"id": '511421',
		"shortname": '仁寿县',
		"parentid": '511400'
	},
	{
		"id": '511423',
		"shortname": '洪雅县',
		"parentid": '511400'
	},
	{
		"id": '511424',
		"shortname": '丹棱县',
		"parentid": '511400'
	},
	{
		"id": '511425',
		"shortname": '青神县',
		"parentid": '511400'
	},
	{
		"id": '511422',
		"shortname": '彭山县',
		"parentid": '511400'
	},
	{
		"id": '511502',
		"shortname": '翠屏区',
		"parentid": '511500'
	},
	{
		"id": '511521',
		"shortname": '宜宾县',
		"parentid": '511500'
	},
	{
		"id": '511522',
		"shortname": '南溪县',
		"parentid": '511500'
	},
	{
		"id": '511523',
		"shortname": '江安县',
		"parentid": '511500'
	},
	{
		"id": '511524',
		"shortname": '长宁县',
		"parentid": '511500'
	},
	{
		"id": '511525',
		"shortname": '高县',
		"parentid": '511500'
	},
	{
		"id": '511526',
		"shortname": '珙县',
		"parentid": '511500'
	},
	{
		"id": '511527',
		"shortname": '筠连县',
		"parentid": '511500'
	},
	{
		"id": '511528',
		"shortname": '兴文县',
		"parentid": '511500'
	},
	{
		"id": '511529',
		"shortname": '屏山县',
		"parentid": '511500'
	},
	{
		"id": '511540',
		"shortname": '临港开发区',
		"parentid": '511500'
	},
	{
		"id": '511602',
		"shortname": '广安区',
		"parentid": '511600'
	},
	{
		"id": '511621',
		"shortname": '岳池县',
		"parentid": '511600'
	},
	{
		"id": '511622',
		"shortname": '武胜县',
		"parentid": '511600'
	},
	{
		"id": '511623',
		"shortname": '邻水县',
		"parentid": '511600'
	},
	{
		"id": '511681',
		"shortname": '华蓥市',
		"parentid": '511600'
	},
	{
		"id": '511702',
		"shortname": '通川区',
		"parentid": '511700'
	},
	{
		"id": '511721',
		"shortname": '达县',
		"parentid": '511700'
	},
	{
		"id": '511722',
		"shortname": '宣汉县',
		"parentid": '511700'
	},
	{
		"id": '511723',
		"shortname": '开江县',
		"parentid": '511700'
	},
	{
		"id": '511724',
		"shortname": '大竹县',
		"parentid": '511700'
	},
	{
		"id": '511725',
		"shortname": '渠县',
		"parentid": '511700'
	},
	{
		"id": '511781',
		"shortname": '万源市',
		"parentid": '511700'
	},
	{
		"id": '511802',
		"shortname": '雨城区',
		"parentid": '511800'
	},
	{
		"id": '511821',
		"shortname": '名山县',
		"parentid": '511800'
	},
	{
		"id": '511822',
		"shortname": '荥经县',
		"parentid": '511800'
	},
	{
		"id": '511823',
		"shortname": '汉源县',
		"parentid": '511800'
	},
	{
		"id": '511824',
		"shortname": '石棉县',
		"parentid": '511800'
	},
	{
		"id": '511825',
		"shortname": '天全县',
		"parentid": '511800'
	},
	{
		"id": '511826',
		"shortname": '芦山县',
		"parentid": '511800'
	},
	{
		"id": '511827',
		"shortname": '宝兴县',
		"parentid": '511800'
	},
	{
		"id": '511902',
		"shortname": '巴州区',
		"parentid": '511900'
	},
	{
		"id": '511921',
		"shortname": '通江县',
		"parentid": '511900'
	},
	{
		"id": '511922',
		"shortname": '南江县',
		"parentid": '511900'
	},
	{
		"id": '511923',
		"shortname": '平昌县',
		"parentid": '511900'
	},
	{
		"id": '512002',
		"shortname": '雁江区',
		"parentid": '512000'
	},
	{
		"id": '512021',
		"shortname": '安岳县',
		"parentid": '512000'
	},
	{
		"id": '512022',
		"shortname": '乐至县',
		"parentid": '512000'
	},
	{
		"id": '512081',
		"shortname": '简阳市',
		"parentid": '512000'
	},
	{
		"id": '513221',
		"shortname": '汶川县',
		"parentid": '513200'
	},
	{
		"id": '513222',
		"shortname": '理县',
		"parentid": '513200'
	},
	{
		"id": '513223',
		"shortname": '茂县',
		"parentid": '513200'
	},
	{
		"id": '513224',
		"shortname": '松潘县',
		"parentid": '513200'
	},
	{
		"id": '513225',
		"shortname": '九寨沟县',
		"parentid": '513200'
	},
	{
		"id": '513226',
		"shortname": '金川县',
		"parentid": '513200'
	},
	{
		"id": '513227',
		"shortname": '小金县',
		"parentid": '513200'
	},
	{
		"id": '513228',
		"shortname": '黑水县',
		"parentid": '513200'
	},
	{
		"id": '513229',
		"shortname": '马尔康县',
		"parentid": '513200'
	},
	{
		"id": '513230',
		"shortname": '壤塘县',
		"parentid": '513200'
	},
	{
		"id": '513231',
		"shortname": '阿坝县',
		"parentid": '513200'
	},
	{
		"id": '513232',
		"shortname": '若尔盖县',
		"parentid": '513200'
	},
	{
		"id": '513233',
		"shortname": '红原县',
		"parentid": '513200'
	},
	{
		"id": '513240',
		"shortname": '卧龙特区',
		"parentid": '513200'
	},
	{
		"id": '513321',
		"shortname": '康定县',
		"parentid": '513300'
	},
	{
		"id": '513322',
		"shortname": '泸定县',
		"parentid": '513300'
	},
	{
		"id": '513323',
		"shortname": '丹巴县',
		"parentid": '513300'
	},
	{
		"id": '513324',
		"shortname": '九龙县',
		"parentid": '513300'
	},
	{
		"id": '513325',
		"shortname": '雅江县',
		"parentid": '513300'
	},
	{
		"id": '513326',
		"shortname": '道孚县',
		"parentid": '513300'
	},
	{
		"id": '513327',
		"shortname": '炉霍县',
		"parentid": '513300'
	},
	{
		"id": '513328',
		"shortname": '甘孜县',
		"parentid": '513300'
	},
	{
		"id": '513329',
		"shortname": '新龙县',
		"parentid": '513300'
	},
	{
		"id": '513330',
		"shortname": '德格县',
		"parentid": '513300'
	},
	{
		"id": '513331',
		"shortname": '白玉县',
		"parentid": '513300'
	},
	{
		"id": '513332',
		"shortname": '石渠县',
		"parentid": '513300'
	},
	{
		"id": '513333',
		"shortname": '色达县',
		"parentid": '513300'
	},
	{
		"id": '513334',
		"shortname": '理塘县',
		"parentid": '513300'
	},
	{
		"id": '513335',
		"shortname": '巴塘县',
		"parentid": '513300'
	},
	{
		"id": '513336',
		"shortname": '乡城县',
		"parentid": '513300'
	},
	{
		"id": '513337',
		"shortname": '稻城县',
		"parentid": '513300'
	},
	{
		"id": '513338',
		"shortname": '得荣县',
		"parentid": '513300'
	},
	{
		"id": '513437',
		"shortname": '雷波县',
		"parentid": '513400'
	},
	{
		"id": '513401',
		"shortname": '西昌市',
		"parentid": '513400'
	},
	{
		"id": '513422',
		"shortname": '木里藏族自治县',
		"parentid": '513400'
	},
	{
		"id": '513423',
		"shortname": '盐源县',
		"parentid": '513400'
	},
	{
		"id": '513424',
		"shortname": '德昌县',
		"parentid": '513400'
	},
	{
		"id": '513425',
		"shortname": '会理县',
		"parentid": '513400'
	},
	{
		"id": '513426',
		"shortname": '会东县',
		"parentid": '513400'
	},
	{
		"id": '513427',
		"shortname": '宁南县',
		"parentid": '513400'
	},
	{
		"id": '513428',
		"shortname": '普格县',
		"parentid": '513400'
	},
	{
		"id": '513429',
		"shortname": '布拖县',
		"parentid": '513400'
	},
	{
		"id": '513430',
		"shortname": '金阳县',
		"parentid": '513400'
	},
	{
		"id": '513431',
		"shortname": '昭觉县',
		"parentid": '513400'
	},
	{
		"id": '513432',
		"shortname": '喜德县',
		"parentid": '513400'
	},
	{
		"id": '513434',
		"shortname": '越西县',
		"parentid": '513400'
	},
	{
		"id": '513435',
		"shortname": '甘洛县',
		"parentid": '513400'
	},
	{
		"id": '513436',
		"shortname": '美姑县',
		"parentid": '513400'
	},
	{
		"id": '513433',
		"shortname": '冕宁县',
		"parentid": '513400'
	},
	{
		"id": '520102',
		"shortname": '南明区',
		"parentid": '520100'
	},
	{
		"id": '520103',
		"shortname": '云岩区',
		"parentid": '520100'
	},
	{
		"id": '520111',
		"shortname": '花溪区',
		"parentid": '520100'
	},
	{
		"id": '520112',
		"shortname": '乌当区',
		"parentid": '520100'
	},
	{
		"id": '520113',
		"shortname": '白云区',
		"parentid": '520100'
	},
	{
		"id": '520114',
		"shortname": '小河区',
		"parentid": '520100'
	},
	{
		"id": '520121',
		"shortname": '开阳县',
		"parentid": '520100'
	},
	{
		"id": '520122',
		"shortname": '息烽县',
		"parentid": '520100'
	},
	{
		"id": '520123',
		"shortname": '修文县',
		"parentid": '520100'
	},
	{
		"id": '520181',
		"shortname": '清镇市',
		"parentid": '520100'
	},
	{
		"id": '520201',
		"shortname": '钟山区',
		"parentid": '520200'
	},
	{
		"id": '520203',
		"shortname": '六枝特区',
		"parentid": '520200'
	},
	{
		"id": '520221',
		"shortname": '水城县',
		"parentid": '520200'
	},
	{
		"id": '520222',
		"shortname": '盘县',
		"parentid": '520200'
	},
	{
		"id": '520302',
		"shortname": '红花岗区',
		"parentid": '520300'
	},
	{
		"id": '520303',
		"shortname": '汇川区',
		"parentid": '520300'
	},
	{
		"id": '520321',
		"shortname": '遵义县',
		"parentid": '520300'
	},
	{
		"id": '520322',
		"shortname": '桐梓县',
		"parentid": '520300'
	},
	{
		"id": '520323',
		"shortname": '绥阳县',
		"parentid": '520300'
	},
	{
		"id": '520324',
		"shortname": '正安县',
		"parentid": '520300'
	},
	{
		"id": '520325',
		"shortname": '道真仡佬族苗族自治县',
		"parentid": '520300'
	},
	{
		"id": '520326',
		"shortname": '务川仡佬族苗族自治县',
		"parentid": '520300'
	},
	{
		"id": '520327',
		"shortname": '凤冈县',
		"parentid": '520300'
	},
	{
		"id": '520328',
		"shortname": '湄潭县',
		"parentid": '520300'
	},
	{
		"id": '520329',
		"shortname": '余庆县',
		"parentid": '520300'
	},
	{
		"id": '520330',
		"shortname": '习水县',
		"parentid": '520300'
	},
	{
		"id": '520381',
		"shortname": '赤水市',
		"parentid": '520300'
	},
	{
		"id": '520382',
		"shortname": '仁怀市',
		"parentid": '520300'
	},
	{
		"id": '520402',
		"shortname": '西秀区',
		"parentid": '520400'
	},
	{
		"id": '520421',
		"shortname": '平坝县',
		"parentid": '520400'
	},
	{
		"id": '520422',
		"shortname": '普定县',
		"parentid": '520400'
	},
	{
		"id": '520423',
		"shortname": '镇宁布依族苗族自治县',
		"parentid": '520400'
	},
	{
		"id": '520424',
		"shortname": '关岭布依族苗族自治县',
		"parentid": '520400'
	},
	{
		"id": '520425',
		"shortname": '紫云苗族布依族自治县',
		"parentid": '520400'
	},
	{
		"id": '520440',
		"shortname": '经济技术开发区',
		"parentid": '520400'
	},
	{
		"id": '520441',
		"shortname": '黄果树管委会',
		"parentid": '520400'
	},
	{
		"id": '522201',
		"shortname": '铜仁市',
		"parentid": '522200'
	},
	{
		"id": '522222',
		"shortname": '江口县',
		"parentid": '522200'
	},
	{
		"id": '522223',
		"shortname": '玉屏侗族自治县',
		"parentid": '522200'
	},
	{
		"id": '522224',
		"shortname": '石阡县',
		"parentid": '522200'
	},
	{
		"id": '522225',
		"shortname": '思南县',
		"parentid": '522200'
	},
	{
		"id": '522226',
		"shortname": '印江土家族苗族自治县',
		"parentid": '522200'
	},
	{
		"id": '522227',
		"shortname": '德江县',
		"parentid": '522200'
	},
	{
		"id": '522228',
		"shortname": '沿河土家族自治县',
		"parentid": '522200'
	},
	{
		"id": '522229',
		"shortname": '松桃苗族自治县',
		"parentid": '522200'
	},
	{
		"id": '522230',
		"shortname": '万山特区',
		"parentid": '522200'
	},
	{
		"id": '522301',
		"shortname": '兴义市',
		"parentid": '522300'
	},
	{
		"id": '522322',
		"shortname": '兴仁县',
		"parentid": '522300'
	},
	{
		"id": '522323',
		"shortname": '普安县',
		"parentid": '522300'
	},
	{
		"id": '522324',
		"shortname": '晴隆县',
		"parentid": '522300'
	},
	{
		"id": '522325',
		"shortname": '贞丰县',
		"parentid": '522300'
	},
	{
		"id": '522326',
		"shortname": '望谟县',
		"parentid": '522300'
	},
	{
		"id": '522327',
		"shortname": '册亨县',
		"parentid": '522300'
	},
	{
		"id": '522328',
		"shortname": '安龙县',
		"parentid": '522300'
	},
	{
		"id": '522340',
		"shortname": '顶效经济技术开发区',
		"parentid": '522300'
	},
	{
		"id": '522401',
		"shortname": '毕节市',
		"parentid": '522400'
	},
	{
		"id": '522422',
		"shortname": '大方县',
		"parentid": '522400'
	},
	{
		"id": '522423',
		"shortname": '黔西县',
		"parentid": '522400'
	},
	{
		"id": '522424',
		"shortname": '金沙县',
		"parentid": '522400'
	},
	{
		"id": '522425',
		"shortname": '织金县',
		"parentid": '522400'
	},
	{
		"id": '522426',
		"shortname": '纳雍县',
		"parentid": '522400'
	},
	{
		"id": '522427',
		"shortname": '威宁彝族回族苗族自治县',
		"parentid": '522400'
	},
	{
		"id": '522428',
		"shortname": '赫章县',
		"parentid": '522400'
	},
	{
		"id": '522440',
		"shortname": '百里杜鹃管理区',
		"parentid": '522400'
	},
	{
		"id": '522601',
		"shortname": '凯里市',
		"parentid": '522600'
	},
	{
		"id": '522622',
		"shortname": '黄平县',
		"parentid": '522600'
	},
	{
		"id": '522623',
		"shortname": '施秉县',
		"parentid": '522600'
	},
	{
		"id": '522624',
		"shortname": '三穗县',
		"parentid": '522600'
	},
	{
		"id": '522625',
		"shortname": '镇远县',
		"parentid": '522600'
	},
	{
		"id": '522626',
		"shortname": '岑巩县',
		"parentid": '522600'
	},
	{
		"id": '522627',
		"shortname": '天柱县',
		"parentid": '522600'
	},
	{
		"id": '522628',
		"shortname": '锦屏县',
		"parentid": '522600'
	},
	{
		"id": '522629',
		"shortname": '剑河县',
		"parentid": '522600'
	},
	{
		"id": '522630',
		"shortname": '台江县',
		"parentid": '522600'
	},
	{
		"id": '522631',
		"shortname": '黎平县',
		"parentid": '522600'
	},
	{
		"id": '522632',
		"shortname": '榕江县',
		"parentid": '522600'
	},
	{
		"id": '522633',
		"shortname": '从江县',
		"parentid": '522600'
	},
	{
		"id": '522634',
		"shortname": '雷山县',
		"parentid": '522600'
	},
	{
		"id": '522635',
		"shortname": '麻江县',
		"parentid": '522600'
	},
	{
		"id": '522636',
		"shortname": '丹寨县',
		"parentid": '522600'
	},
	{
		"id": '522701',
		"shortname": '都匀市',
		"parentid": '522700'
	},
	{
		"id": '522702',
		"shortname": '福泉市',
		"parentid": '522700'
	},
	{
		"id": '522722',
		"shortname": '荔波县',
		"parentid": '522700'
	},
	{
		"id": '522723',
		"shortname": '贵定县',
		"parentid": '522700'
	},
	{
		"id": '522725',
		"shortname": '瓮安县',
		"parentid": '522700'
	},
	{
		"id": '522726',
		"shortname": '独山县',
		"parentid": '522700'
	},
	{
		"id": '522727',
		"shortname": '平塘县',
		"parentid": '522700'
	},
	{
		"id": '522728',
		"shortname": '罗甸县',
		"parentid": '522700'
	},
	{
		"id": '522729',
		"shortname": '长顺县',
		"parentid": '522700'
	},
	{
		"id": '522730',
		"shortname": '龙里县',
		"parentid": '522700'
	},
	{
		"id": '522731',
		"shortname": '惠水县',
		"parentid": '522700'
	},
	{
		"id": '522732',
		"shortname": '三都水族自治县',
		"parentid": '522700'
	},
	{
		"id": '530102',
		"shortname": '五华区',
		"parentid": '530100'
	},
	{
		"id": '530103',
		"shortname": '盘龙区',
		"parentid": '530100'
	},
	{
		"id": '530111',
		"shortname": '官渡区',
		"parentid": '530100'
	},
	{
		"id": '530112',
		"shortname": '西山区',
		"parentid": '530100'
	},
	{
		"id": '530113',
		"shortname": '东川区',
		"parentid": '530100'
	},
	{
		"id": '530121',
		"shortname": '呈贡县',
		"parentid": '530100'
	},
	{
		"id": '530122',
		"shortname": '晋宁县',
		"parentid": '530100'
	},
	{
		"id": '530124',
		"shortname": '富民县',
		"parentid": '530100'
	},
	{
		"id": '530125',
		"shortname": '宜良县',
		"parentid": '530100'
	},
	{
		"id": '530126',
		"shortname": '石林彝族自治县',
		"parentid": '530100'
	},
	{
		"id": '530127',
		"shortname": '嵩明县',
		"parentid": '530100'
	},
	{
		"id": '530128',
		"shortname": '禄劝彝族苗族自治县',
		"parentid": '530100'
	},
	{
		"id": '530129',
		"shortname": '寻甸回族彝族自治县',
		"parentid": '530100'
	},
	{
		"id": '530181',
		"shortname": '安宁市',
		"parentid": '530100'
	},
	{
		"id": '530302',
		"shortname": '麒麟区',
		"parentid": '530300'
	},
	{
		"id": '530321',
		"shortname": '马龙县',
		"parentid": '530300'
	},
	{
		"id": '530322',
		"shortname": '陆良县',
		"parentid": '530300'
	},
	{
		"id": '530323',
		"shortname": '师宗县',
		"parentid": '530300'
	},
	{
		"id": '530324',
		"shortname": '罗平县',
		"parentid": '530300'
	},
	{
		"id": '530326',
		"shortname": '会泽县',
		"parentid": '530300'
	},
	{
		"id": '530328',
		"shortname": '沾益县',
		"parentid": '530300'
	},
	{
		"id": '530381',
		"shortname": '宣威市',
		"parentid": '530300'
	},
	{
		"id": '530325',
		"shortname": '富源县',
		"parentid": '530300'
	},
	{
		"id": '530402',
		"shortname": '红塔区',
		"parentid": '530400'
	},
	{
		"id": '530421',
		"shortname": '江川县',
		"parentid": '530400'
	},
	{
		"id": '530422',
		"shortname": '澄江县',
		"parentid": '530400'
	},
	{
		"id": '530424',
		"shortname": '华宁县',
		"parentid": '530400'
	},
	{
		"id": '530425',
		"shortname": '易门县',
		"parentid": '530400'
	},
	{
		"id": '530426',
		"shortname": '峨山彝族自治县',
		"parentid": '530400'
	},
	{
		"id": '530427',
		"shortname": '新平彝族傣族自治县',
		"parentid": '530400'
	},
	{
		"id": '530428',
		"shortname": '元江哈尼族彝族傣族自治县',
		"parentid": '530400'
	},
	{
		"id": '530423',
		"shortname": '通海县',
		"parentid": '530400'
	},
	{
		"id": '530502',
		"shortname": '隆阳区',
		"parentid": '530500'
	},
	{
		"id": '530522',
		"shortname": '腾冲县',
		"parentid": '530500'
	},
	{
		"id": '530523',
		"shortname": '龙陵县',
		"parentid": '530500'
	},
	{
		"id": '530524',
		"shortname": '昌宁县',
		"parentid": '530500'
	},
	{
		"id": '530521',
		"shortname": '施甸县',
		"parentid": '530500'
	},
	{
		"id": '530602',
		"shortname": '昭阳区',
		"parentid": '530600'
	},
	{
		"id": '530621',
		"shortname": '鲁甸县',
		"parentid": '530600'
	},
	{
		"id": '530622',
		"shortname": '巧家县',
		"parentid": '530600'
	},
	{
		"id": '530624',
		"shortname": '大关县',
		"parentid": '530600'
	},
	{
		"id": '530625',
		"shortname": '永善县',
		"parentid": '530600'
	},
	{
		"id": '530626',
		"shortname": '绥江县',
		"parentid": '530600'
	},
	{
		"id": '530627',
		"shortname": '镇雄县',
		"parentid": '530600'
	},
	{
		"id": '530628',
		"shortname": '彝良县',
		"parentid": '530600'
	},
	{
		"id": '530629',
		"shortname": '威信县',
		"parentid": '530600'
	},
	{
		"id": '530630',
		"shortname": '水富县',
		"parentid": '530600'
	},
	{
		"id": '530623',
		"shortname": '盐津县',
		"parentid": '530600'
	},
	{
		"id": '530702',
		"shortname": '古城区',
		"parentid": '530700'
	},
	{
		"id": '530721',
		"shortname": '玉龙纳西族自治县',
		"parentid": '530700'
	},
	{
		"id": '530722',
		"shortname": '永胜县',
		"parentid": '530700'
	},
	{
		"id": '530723',
		"shortname": '华坪县',
		"parentid": '530700'
	},
	{
		"id": '530724',
		"shortname": '宁蒗彝族自治县',
		"parentid": '530700'
	},
	{
		"id": '530802',
		"shortname": '思茅区',
		"parentid": '530800'
	},
	{
		"id": '530821',
		"shortname": '宁洱哈尼族彝族自治县',
		"parentid": '530800'
	},
	{
		"id": '530822',
		"shortname": '墨江哈尼族自治县',
		"parentid": '530800'
	},
	{
		"id": '530823',
		"shortname": '景东彝族自治县',
		"parentid": '530800'
	},
	{
		"id": '530824',
		"shortname": '景谷傣族彝族自治县',
		"parentid": '530800'
	},
	{
		"id": '530825',
		"shortname": '镇沅彝族哈尼族拉祜族自治县',
		"parentid": '530800'
	},
	{
		"id": '530826',
		"shortname": '江城哈尼族彝族自治县',
		"parentid": '530800'
	},
	{
		"id": '530827',
		"shortname": '孟连傣族拉祜族佤族自治县',
		"parentid": '530800'
	},
	{
		"id": '530828',
		"shortname": '澜沧拉祜族自治县',
		"parentid": '530800'
	},
	{
		"id": '530829',
		"shortname": '西盟佤族自治县',
		"parentid": '530800'
	},
	{
		"id": '530902',
		"shortname": '临翔区',
		"parentid": '530900'
	},
	{
		"id": '530921',
		"shortname": '凤庆县',
		"parentid": '530900'
	},
	{
		"id": '530922',
		"shortname": '云县',
		"parentid": '530900'
	},
	{
		"id": '530923',
		"shortname": '永德县',
		"parentid": '530900'
	},
	{
		"id": '530924',
		"shortname": '镇康县',
		"parentid": '530900'
	},
	{
		"id": '530925',
		"shortname": '双江拉祜族佤族布朗族傣族自治县',
		"parentid": '530900'
	},
	{
		"id": '530926',
		"shortname": '耿马傣族佤族自治县',
		"parentid": '530900'
	},
	{
		"id": '530927',
		"shortname": '沧源佤族自治县',
		"parentid": '530900'
	},
	{
		"id": '532301',
		"shortname": '楚雄市',
		"parentid": '532300'
	},
	{
		"id": '532322',
		"shortname": '双柏县',
		"parentid": '532300'
	},
	{
		"id": '532324',
		"shortname": '南华县',
		"parentid": '532300'
	},
	{
		"id": '532325',
		"shortname": '姚安县',
		"parentid": '532300'
	},
	{
		"id": '532326',
		"shortname": '大姚县',
		"parentid": '532300'
	},
	{
		"id": '532327',
		"shortname": '永仁县',
		"parentid": '532300'
	},
	{
		"id": '532328',
		"shortname": '元谋县',
		"parentid": '532300'
	},
	{
		"id": '532329',
		"shortname": '武定县',
		"parentid": '532300'
	},
	{
		"id": '532331',
		"shortname": '禄丰县',
		"parentid": '532300'
	},
	{
		"id": '532323',
		"shortname": '牟定县',
		"parentid": '532300'
	},
	{
		"id": '532501',
		"shortname": '个旧市',
		"parentid": '532500'
	},
	{
		"id": '532502',
		"shortname": '开远市',
		"parentid": '532500'
	},
	{
		"id": '532522',
		"shortname": '蒙自县',
		"parentid": '532500'
	},
	{
		"id": '532523',
		"shortname": '屏边苗族自治县',
		"parentid": '532500'
	},
	{
		"id": '532524',
		"shortname": '建水县',
		"parentid": '532500'
	},
	{
		"id": '532525',
		"shortname": '石屏县',
		"parentid": '532500'
	},
	{
		"id": '532526',
		"shortname": '弥勒县',
		"parentid": '532500'
	},
	{
		"id": '532527',
		"shortname": '泸西县',
		"parentid": '532500'
	},
	{
		"id": '532528',
		"shortname": '元阳县',
		"parentid": '532500'
	},
	{
		"id": '532529',
		"shortname": '红河县',
		"parentid": '532500'
	},
	{
		"id": '532530',
		"shortname": '金平苗族瑶族傣族自治县',
		"parentid": '532500'
	},
	{
		"id": '532531',
		"shortname": '绿春县',
		"parentid": '532500'
	},
	{
		"id": '532532',
		"shortname": '河口瑶族自治县',
		"parentid": '532500'
	},
	{
		"id": '532621',
		"shortname": '文山县',
		"parentid": '532600'
	},
	{
		"id": '532622',
		"shortname": '砚山县',
		"parentid": '532600'
	},
	{
		"id": '532623',
		"shortname": '西畴县',
		"parentid": '532600'
	},
	{
		"id": '532624',
		"shortname": '麻栗坡县',
		"parentid": '532600'
	},
	{
		"id": '532625',
		"shortname": '马关县',
		"parentid": '532600'
	},
	{
		"id": '532626',
		"shortname": '丘北县',
		"parentid": '532600'
	},
	{
		"id": '532627',
		"shortname": '广南县',
		"parentid": '532600'
	},
	{
		"id": '532628',
		"shortname": '富宁县',
		"parentid": '532600'
	},
	{
		"id": '532801',
		"shortname": '景洪市',
		"parentid": '532800'
	},
	{
		"id": '532822',
		"shortname": '勐海县',
		"parentid": '532800'
	},
	{
		"id": '532823',
		"shortname": '勐腊县',
		"parentid": '532800'
	},
	{
		"id": '532901',
		"shortname": '大理市',
		"parentid": '532900'
	},
	{
		"id": '532922',
		"shortname": '漾濞彝族自治县',
		"parentid": '532900'
	},
	{
		"id": '532923',
		"shortname": '祥云县',
		"parentid": '532900'
	},
	{
		"id": '532924',
		"shortname": '宾川县',
		"parentid": '532900'
	},
	{
		"id": '532925',
		"shortname": '弥渡县',
		"parentid": '532900'
	},
	{
		"id": '532926',
		"shortname": '南涧彝族自治县',
		"parentid": '532900'
	},
	{
		"id": '532927',
		"shortname": '巍山彝族回族自治县',
		"parentid": '532900'
	},
	{
		"id": '532928',
		"shortname": '永平县',
		"parentid": '532900'
	},
	{
		"id": '532929',
		"shortname": '云龙县',
		"parentid": '532900'
	},
	{
		"id": '532930',
		"shortname": '洱源县',
		"parentid": '532900'
	},
	{
		"id": '532931',
		"shortname": '剑川县',
		"parentid": '532900'
	},
	{
		"id": '532932',
		"shortname": '鹤庆县',
		"parentid": '532900'
	},
	{
		"id": '533103',
		"shortname": '芒市',
		"parentid": '533100'
	},
	{
		"id": '533102',
		"shortname": '瑞丽市',
		"parentid": '533100'
	},
	{
		"id": '533122',
		"shortname": '梁河县',
		"parentid": '533100'
	},
	{
		"id": '533123',
		"shortname": '盈江县',
		"parentid": '533100'
	},
	{
		"id": '533124',
		"shortname": '陇川县',
		"parentid": '533100'
	},
	{
		"id": '533321',
		"shortname": '泸水县',
		"parentid": '533300'
	},
	{
		"id": '533323',
		"shortname": '福贡县',
		"parentid": '533300'
	},
	{
		"id": '533324',
		"shortname": '贡山独龙族怒族自治县',
		"parentid": '533300'
	},
	{
		"id": '533325',
		"shortname": '兰坪白族普米族自治县',
		"parentid": '533300'
	},
	{
		"id": '533421',
		"shortname": '香格里拉县',
		"parentid": '533400'
	},
	{
		"id": '533422',
		"shortname": '德钦县',
		"parentid": '533400'
	},
	{
		"id": '533423',
		"shortname": '维西傈僳族自治县',
		"parentid": '533400'
	},
	{
		"id": '540102',
		"shortname": '城关区',
		"parentid": '540100'
	},
	{
		"id": '540121',
		"shortname": '林周县',
		"parentid": '540100'
	},
	{
		"id": '540122',
		"shortname": '当雄县',
		"parentid": '540100'
	},
	{
		"id": '540123',
		"shortname": '尼木县',
		"parentid": '540100'
	},
	{
		"id": '540124',
		"shortname": '曲水县',
		"parentid": '540100'
	},
	{
		"id": '540125',
		"shortname": '堆龙德庆县',
		"parentid": '540100'
	},
	{
		"id": '540126',
		"shortname": '达孜县',
		"parentid": '540100'
	},
	{
		"id": '540127',
		"shortname": '墨竹工卡县',
		"parentid": '540100'
	},
	{
		"id": '542121',
		"shortname": '昌都县',
		"parentid": '542100'
	},
	{
		"id": '542122',
		"shortname": '江达县',
		"parentid": '542100'
	},
	{
		"id": '542123',
		"shortname": '贡觉县',
		"parentid": '542100'
	},
	{
		"id": '542124',
		"shortname": '类乌齐县',
		"parentid": '542100'
	},
	{
		"id": '542125',
		"shortname": '丁青县',
		"parentid": '542100'
	},
	{
		"id": '542126',
		"shortname": '察雅县',
		"parentid": '542100'
	},
	{
		"id": '542127',
		"shortname": '八宿县',
		"parentid": '542100'
	},
	{
		"id": '542128',
		"shortname": '左贡县',
		"parentid": '542100'
	},
	{
		"id": '542129',
		"shortname": '芒康县',
		"parentid": '542100'
	},
	{
		"id": '542132',
		"shortname": '洛隆县',
		"parentid": '542100'
	},
	{
		"id": '542133',
		"shortname": '边坝县',
		"parentid": '542100'
	},
	{
		"id": '542221',
		"shortname": '乃东县',
		"parentid": '542200'
	},
	{
		"id": '542222',
		"shortname": '扎囊县',
		"parentid": '542200'
	},
	{
		"id": '542223',
		"shortname": '贡嘎县',
		"parentid": '542200'
	},
	{
		"id": '542224',
		"shortname": '桑日县',
		"parentid": '542200'
	},
	{
		"id": '542225',
		"shortname": '琼结县',
		"parentid": '542200'
	},
	{
		"id": '542226',
		"shortname": '曲松县',
		"parentid": '542200'
	},
	{
		"id": '542227',
		"shortname": '措美县',
		"parentid": '542200'
	},
	{
		"id": '542228',
		"shortname": '洛扎县',
		"parentid": '542200'
	},
	{
		"id": '542229',
		"shortname": '加查县',
		"parentid": '542200'
	},
	{
		"id": '542231',
		"shortname": '隆子县',
		"parentid": '542200'
	},
	{
		"id": '542232',
		"shortname": '错那县',
		"parentid": '542200'
	},
	{
		"id": '542233',
		"shortname": '浪卡子县',
		"parentid": '542200'
	},
	{
		"id": '542322',
		"shortname": '南木林县',
		"parentid": '542300'
	},
	{
		"id": '542323',
		"shortname": '江孜县',
		"parentid": '542300'
	},
	{
		"id": '542324',
		"shortname": '定日县',
		"parentid": '542300'
	},
	{
		"id": '542325',
		"shortname": '萨迦县',
		"parentid": '542300'
	},
	{
		"id": '542326',
		"shortname": '拉孜县',
		"parentid": '542300'
	},
	{
		"id": '542327',
		"shortname": '昂仁县',
		"parentid": '542300'
	},
	{
		"id": '542328',
		"shortname": '谢通门县',
		"parentid": '542300'
	},
	{
		"id": '542330',
		"shortname": '仁布县',
		"parentid": '542300'
	},
	{
		"id": '542331',
		"shortname": '康马县',
		"parentid": '542300'
	},
	{
		"id": '542332',
		"shortname": '定结县',
		"parentid": '542300'
	},
	{
		"id": '542333',
		"shortname": '仲巴县',
		"parentid": '542300'
	},
	{
		"id": '542334',
		"shortname": '亚东县',
		"parentid": '542300'
	},
	{
		"id": '542335',
		"shortname": '吉隆县',
		"parentid": '542300'
	},
	{
		"id": '542336',
		"shortname": '聂拉木县',
		"parentid": '542300'
	},
	{
		"id": '542337',
		"shortname": '萨嘎县',
		"parentid": '542300'
	},
	{
		"id": '542338',
		"shortname": '岗巴县',
		"parentid": '542300'
	},
	{
		"id": '542301',
		"shortname": '日喀则市',
		"parentid": '542300'
	},
	{
		"id": '542329',
		"shortname": '白朗县',
		"parentid": '542300'
	},
	{
		"id": '542421',
		"shortname": '那曲县',
		"parentid": '542400'
	},
	{
		"id": '542422',
		"shortname": '嘉黎县',
		"parentid": '542400'
	},
	{
		"id": '542423',
		"shortname": '比如县',
		"parentid": '542400'
	},
	{
		"id": '542424',
		"shortname": '聂荣县',
		"parentid": '542400'
	},
	{
		"id": '542425',
		"shortname": '安多县',
		"parentid": '542400'
	},
	{
		"id": '542426',
		"shortname": '申扎县',
		"parentid": '542400'
	},
	{
		"id": '542427',
		"shortname": '索县',
		"parentid": '542400'
	},
	{
		"id": '542428',
		"shortname": '班戈县',
		"parentid": '542400'
	},
	{
		"id": '542429',
		"shortname": '巴青县',
		"parentid": '542400'
	},
	{
		"id": '542430',
		"shortname": '尼玛县',
		"parentid": '542400'
	},
	{
		"id": '542521',
		"shortname": '普兰县',
		"parentid": '542500'
	},
	{
		"id": '542522',
		"shortname": '札达县',
		"parentid": '542500'
	},
	{
		"id": '542523',
		"shortname": '噶尔县',
		"parentid": '542500'
	},
	{
		"id": '542524',
		"shortname": '日土县',
		"parentid": '542500'
	},
	{
		"id": '542525',
		"shortname": '革吉县',
		"parentid": '542500'
	},
	{
		"id": '542526',
		"shortname": '改则县',
		"parentid": '542500'
	},
	{
		"id": '542527',
		"shortname": '措勤县',
		"parentid": '542500'
	},
	{
		"id": '542621',
		"shortname": '林芝县',
		"parentid": '542600'
	},
	{
		"id": '542622',
		"shortname": '工布江达县',
		"parentid": '542600'
	},
	{
		"id": '542623',
		"shortname": '米林县',
		"parentid": '542600'
	},
	{
		"id": '542624',
		"shortname": '墨脱县',
		"parentid": '542600'
	},
	{
		"id": '542625',
		"shortname": '波密县',
		"parentid": '542600'
	},
	{
		"id": '542626',
		"shortname": '察隅县',
		"parentid": '542600'
	},
	{
		"id": '542627',
		"shortname": '朗县',
		"parentid": '542600'
	},
	{
		"id": '610102',
		"shortname": '新城区',
		"parentid": '610100'
	},
	{
		"id": '610103',
		"shortname": '碑林区',
		"parentid": '610100'
	},
	{
		"id": '610104',
		"shortname": '莲湖区',
		"parentid": '610100'
	},
	{
		"id": '610111',
		"shortname": '灞桥区',
		"parentid": '610100'
	},
	{
		"id": '610112',
		"shortname": '未央区',
		"parentid": '610100'
	},
	{
		"id": '610113',
		"shortname": '雁塔区',
		"parentid": '610100'
	},
	{
		"id": '610115',
		"shortname": '临潼区',
		"parentid": '610100'
	},
	{
		"id": '610116',
		"shortname": '长安区',
		"parentid": '610100'
	},
	{
		"id": '610122',
		"shortname": '蓝田县',
		"parentid": '610100'
	},
	{
		"id": '610124',
		"shortname": '周至县',
		"parentid": '610100'
	},
	{
		"id": '610125',
		"shortname": '户县',
		"parentid": '610100'
	},
	{
		"id": '610126',
		"shortname": '高陵县',
		"parentid": '610100'
	},
	{
		"id": '610141',
		"shortname": '经济开发区',
		"parentid": '610100'
	},
	{
		"id": '610114',
		"shortname": '阎良区',
		"parentid": '610100'
	},
	{
		"id": '610140',
		"shortname": '高新技术产业开发区',
		"parentid": '610100'
	},
	{
		"id": '610202',
		"shortname": '王益区',
		"parentid": '610200'
	},
	{
		"id": '610203',
		"shortname": '印台区',
		"parentid": '610200'
	},
	{
		"id": '610204',
		"shortname": '耀州区',
		"parentid": '610200'
	},
	{
		"id": '610222',
		"shortname": '宜君县',
		"parentid": '610200'
	},
	{
		"id": '610302',
		"shortname": '渭滨区',
		"parentid": '610300'
	},
	{
		"id": '610303',
		"shortname": '金台区',
		"parentid": '610300'
	},
	{
		"id": '610304',
		"shortname": '陈仓区',
		"parentid": '610300'
	},
	{
		"id": '610322',
		"shortname": '凤翔县',
		"parentid": '610300'
	},
	{
		"id": '610323',
		"shortname": '岐山县',
		"parentid": '610300'
	},
	{
		"id": '610324',
		"shortname": '扶风县',
		"parentid": '610300'
	},
	{
		"id": '610326',
		"shortname": '眉县',
		"parentid": '610300'
	},
	{
		"id": '610327',
		"shortname": '陇县',
		"parentid": '610300'
	},
	{
		"id": '610328',
		"shortname": '千阳县',
		"parentid": '610300'
	},
	{
		"id": '610329',
		"shortname": '麟游县',
		"parentid": '610300'
	},
	{
		"id": '610330',
		"shortname": '凤县',
		"parentid": '610300'
	},
	{
		"id": '610331',
		"shortname": '太白县',
		"parentid": '610300'
	},
	{
		"id": '610423',
		"shortname": '泾阳县',
		"parentid": '610400'
	},
	{
		"id": '610424',
		"shortname": '乾县',
		"parentid": '610400'
	},
	{
		"id": '610425',
		"shortname": '礼泉县',
		"parentid": '610400'
	},
	{
		"id": '610426',
		"shortname": '永寿县',
		"parentid": '610400'
	},
	{
		"id": '610427',
		"shortname": '彬县',
		"parentid": '610400'
	},
	{
		"id": '610428',
		"shortname": '长武县',
		"parentid": '610400'
	},
	{
		"id": '610429',
		"shortname": '旬邑县',
		"parentid": '610400'
	},
	{
		"id": '610430',
		"shortname": '淳化县',
		"parentid": '610400'
	},
	{
		"id": '610431',
		"shortname": '武功县',
		"parentid": '610400'
	},
	{
		"id": '610481',
		"shortname": '兴平市',
		"parentid": '610400'
	},
	{
		"id": '610402',
		"shortname": '秦都区',
		"parentid": '610400'
	},
	{
		"id": '610404',
		"shortname": '渭城区',
		"parentid": '610400'
	},
	{
		"id": '610422',
		"shortname": '三原县',
		"parentid": '610400'
	},
	{
		"id": '610502',
		"shortname": '临渭区',
		"parentid": '610500'
	},
	{
		"id": '610521',
		"shortname": '华县',
		"parentid": '610500'
	},
	{
		"id": '610522',
		"shortname": '潼关县',
		"parentid": '610500'
	},
	{
		"id": '610523',
		"shortname": '大荔县',
		"parentid": '610500'
	},
	{
		"id": '610524',
		"shortname": '合阳县',
		"parentid": '610500'
	},
	{
		"id": '610525',
		"shortname": '澄城县',
		"parentid": '610500'
	},
	{
		"id": '610526',
		"shortname": '蒲城县',
		"parentid": '610500'
	},
	{
		"id": '610527',
		"shortname": '白水县',
		"parentid": '610500'
	},
	{
		"id": '610528',
		"shortname": '富平县',
		"parentid": '610500'
	},
	{
		"id": '610540',
		"shortname": '高新技术产业开发区',
		"parentid": '610500'
	},
	{
		"id": '610581',
		"shortname": '韩城市',
		"parentid": '610500'
	},
	{
		"id": '610582',
		"shortname": '华阴市',
		"parentid": '610500'
	},
	{
		"id": '610602',
		"shortname": '宝塔区',
		"parentid": '610600'
	},
	{
		"id": '610621',
		"shortname": '延长县',
		"parentid": '610600'
	},
	{
		"id": '610622',
		"shortname": '延川县',
		"parentid": '610600'
	},
	{
		"id": '610623',
		"shortname": '子长县',
		"parentid": '610600'
	},
	{
		"id": '610624',
		"shortname": '安塞县',
		"parentid": '610600'
	},
	{
		"id": '610625',
		"shortname": '志丹县',
		"parentid": '610600'
	},
	{
		"id": '610626',
		"shortname": '吴起县',
		"parentid": '610600'
	},
	{
		"id": '610627',
		"shortname": '甘泉县',
		"parentid": '610600'
	},
	{
		"id": '610628',
		"shortname": '富县',
		"parentid": '610600'
	},
	{
		"id": '610629',
		"shortname": '洛川县',
		"parentid": '610600'
	},
	{
		"id": '610630',
		"shortname": '宜川县',
		"parentid": '610600'
	},
	{
		"id": '610631',
		"shortname": '黄龙县',
		"parentid": '610600'
	},
	{
		"id": '610632',
		"shortname": '黄陵县',
		"parentid": '610600'
	},
	{
		"id": '610702',
		"shortname": '汉台区',
		"parentid": '610700'
	},
	{
		"id": '610721',
		"shortname": '南郑县',
		"parentid": '610700'
	},
	{
		"id": '610722',
		"shortname": '城固县',
		"parentid": '610700'
	},
	{
		"id": '610723',
		"shortname": '洋县',
		"parentid": '610700'
	},
	{
		"id": '610724',
		"shortname": '西乡县',
		"parentid": '610700'
	},
	{
		"id": '610725',
		"shortname": '勉县',
		"parentid": '610700'
	},
	{
		"id": '610726',
		"shortname": '宁强县',
		"parentid": '610700'
	},
	{
		"id": '610727',
		"shortname": '略阳县',
		"parentid": '610700'
	},
	{
		"id": '610728',
		"shortname": '镇巴县',
		"parentid": '610700'
	},
	{
		"id": '610729',
		"shortname": '留坝县',
		"parentid": '610700'
	},
	{
		"id": '610730',
		"shortname": '佛坪县',
		"parentid": '610700'
	},
	{
		"id": '610802',
		"shortname": '榆阳区',
		"parentid": '610800'
	},
	{
		"id": '610821',
		"shortname": '神木县',
		"parentid": '610800'
	},
	{
		"id": '610822',
		"shortname": '府谷县',
		"parentid": '610800'
	},
	{
		"id": '610823',
		"shortname": '横山县',
		"parentid": '610800'
	},
	{
		"id": '610824',
		"shortname": '靖边县',
		"parentid": '610800'
	},
	{
		"id": '610825',
		"shortname": '定边县',
		"parentid": '610800'
	},
	{
		"id": '610826',
		"shortname": '绥德县',
		"parentid": '610800'
	},
	{
		"id": '610827',
		"shortname": '米脂县',
		"parentid": '610800'
	},
	{
		"id": '610828',
		"shortname": '佳县',
		"parentid": '610800'
	},
	{
		"id": '610829',
		"shortname": '吴堡县',
		"parentid": '610800'
	},
	{
		"id": '610830',
		"shortname": '清涧县',
		"parentid": '610800'
	},
	{
		"id": '610831',
		"shortname": '子洲县',
		"parentid": '610800'
	},
	{
		"id": '610902',
		"shortname": '汉滨区',
		"parentid": '610900'
	},
	{
		"id": '610921',
		"shortname": '汉阴县',
		"parentid": '610900'
	},
	{
		"id": '610922',
		"shortname": '石泉县',
		"parentid": '610900'
	},
	{
		"id": '610923',
		"shortname": '宁陕县',
		"parentid": '610900'
	},
	{
		"id": '610924',
		"shortname": '紫阳县',
		"parentid": '610900'
	},
	{
		"id": '610925',
		"shortname": '岚皋县',
		"parentid": '610900'
	},
	{
		"id": '610926',
		"shortname": '平利县',
		"parentid": '610900'
	},
	{
		"id": '610927',
		"shortname": '镇坪县',
		"parentid": '610900'
	},
	{
		"id": '610928',
		"shortname": '旬阳县',
		"parentid": '610900'
	},
	{
		"id": '610929',
		"shortname": '白河县',
		"parentid": '610900'
	},
	{
		"id": '611022',
		"shortname": '丹凤县',
		"parentid": '611000'
	},
	{
		"id": '611023',
		"shortname": '商南县',
		"parentid": '611000'
	},
	{
		"id": '611024',
		"shortname": '山阳县',
		"parentid": '611000'
	},
	{
		"id": '611025',
		"shortname": '镇安县',
		"parentid": '611000'
	},
	{
		"id": '611026',
		"shortname": '柞水县',
		"parentid": '611000'
	},
	{
		"id": '611002',
		"shortname": '商州区',
		"parentid": '611000'
	},
	{
		"id": '611021',
		"shortname": '洛南县',
		"parentid": '611000'
	},
	{
		"id": '620121',
		"shortname": '永登县',
		"parentid": '620100'
	},
	{
		"id": '620122',
		"shortname": '皋兰县',
		"parentid": '620100'
	},
	{
		"id": '620123',
		"shortname": '榆中县',
		"parentid": '620100'
	},
	{
		"id": '620102',
		"shortname": '城关区',
		"parentid": '620100'
	},
	{
		"id": '620104',
		"shortname": '西固区',
		"parentid": '620100'
	},
	{
		"id": '620105',
		"shortname": '安宁区',
		"parentid": '620100'
	},
	{
		"id": '620111',
		"shortname": '红古区',
		"parentid": '620100'
	},
	{
		"id": '620103',
		"shortname": '七里河区',
		"parentid": '620100'
	},
	{
		"id": '620302',
		"shortname": '金川区',
		"parentid": '620300'
	},
	{
		"id": '620321',
		"shortname": '永昌县',
		"parentid": '620300'
	},
	{
		"id": '620402',
		"shortname": '白银区',
		"parentid": '620400'
	},
	{
		"id": '620403',
		"shortname": '平川区',
		"parentid": '620400'
	},
	{
		"id": '620421',
		"shortname": '靖远县',
		"parentid": '620400'
	},
	{
		"id": '620422',
		"shortname": '会宁县',
		"parentid": '620400'
	},
	{
		"id": '620423',
		"shortname": '景泰县',
		"parentid": '620400'
	},
	{
		"id": '620502',
		"shortname": '秦州区',
		"parentid": '620500'
	},
	{
		"id": '620503',
		"shortname": '麦积区',
		"parentid": '620500'
	},
	{
		"id": '620521',
		"shortname": '清水县',
		"parentid": '620500'
	},
	{
		"id": '620522',
		"shortname": '秦安县',
		"parentid": '620500'
	},
	{
		"id": '620523',
		"shortname": '甘谷县',
		"parentid": '620500'
	},
	{
		"id": '620524',
		"shortname": '武山县',
		"parentid": '620500'
	},
	{
		"id": '620525',
		"shortname": '张家川回族自治县',
		"parentid": '620500'
	},
	{
		"id": '620602',
		"shortname": '凉州区',
		"parentid": '620600'
	},
	{
		"id": '620621',
		"shortname": '民勤县',
		"parentid": '620600'
	},
	{
		"id": '620622',
		"shortname": '古浪县',
		"parentid": '620600'
	},
	{
		"id": '620623',
		"shortname": '天祝藏族自治县',
		"parentid": '620600'
	},
	{
		"id": '620702',
		"shortname": '甘州区',
		"parentid": '620700'
	},
	{
		"id": '620721',
		"shortname": '肃南裕固族自治县',
		"parentid": '620700'
	},
	{
		"id": '620722',
		"shortname": '民乐县',
		"parentid": '620700'
	},
	{
		"id": '620724',
		"shortname": '高台县',
		"parentid": '620700'
	},
	{
		"id": '620725',
		"shortname": '山丹县',
		"parentid": '620700'
	},
	{
		"id": '620723',
		"shortname": '临泽县',
		"parentid": '620700'
	},
	{
		"id": '620802',
		"shortname": '崆峒区',
		"parentid": '620800'
	},
	{
		"id": '620821',
		"shortname": '泾川县',
		"parentid": '620800'
	},
	{
		"id": '620822',
		"shortname": '灵台县',
		"parentid": '620800'
	},
	{
		"id": '620823',
		"shortname": '崇信县',
		"parentid": '620800'
	},
	{
		"id": '620824',
		"shortname": '华亭县',
		"parentid": '620800'
	},
	{
		"id": '620825',
		"shortname": '庄浪县',
		"parentid": '620800'
	},
	{
		"id": '620826',
		"shortname": '静宁县',
		"parentid": '620800'
	},
	{
		"id": '620902',
		"shortname": '肃州区',
		"parentid": '620900'
	},
	{
		"id": '620921',
		"shortname": '金塔县',
		"parentid": '620900'
	},
	{
		"id": '620922',
		"shortname": '瓜州县',
		"parentid": '620900'
	},
	{
		"id": '620923',
		"shortname": '肃北蒙古族自治县',
		"parentid": '620900'
	},
	{
		"id": '620924',
		"shortname": '阿克塞哈萨克族自治县',
		"parentid": '620900'
	},
	{
		"id": '620981',
		"shortname": '玉门市',
		"parentid": '620900'
	},
	{
		"id": '620982',
		"shortname": '敦煌市',
		"parentid": '620900'
	},
	{
		"id": '621002',
		"shortname": '西峰区',
		"parentid": '621000'
	},
	{
		"id": '621021',
		"shortname": '庆城县',
		"parentid": '621000'
	},
	{
		"id": '621022',
		"shortname": '环县',
		"parentid": '621000'
	},
	{
		"id": '621023',
		"shortname": '华池县',
		"parentid": '621000'
	},
	{
		"id": '621024',
		"shortname": '合水县',
		"parentid": '621000'
	},
	{
		"id": '621025',
		"shortname": '正宁县',
		"parentid": '621000'
	},
	{
		"id": '621026',
		"shortname": '宁县',
		"parentid": '621000'
	},
	{
		"id": '621027',
		"shortname": '镇原县',
		"parentid": '621000'
	},
	{
		"id": '621102',
		"shortname": '安定区',
		"parentid": '621100'
	},
	{
		"id": '621121',
		"shortname": '通渭县',
		"parentid": '621100'
	},
	{
		"id": '621122',
		"shortname": '陇西县',
		"parentid": '621100'
	},
	{
		"id": '621123',
		"shortname": '渭源县',
		"parentid": '621100'
	},
	{
		"id": '621124',
		"shortname": '临洮县',
		"parentid": '621100'
	},
	{
		"id": '621125',
		"shortname": '漳县',
		"parentid": '621100'
	},
	{
		"id": '621126',
		"shortname": '岷县',
		"parentid": '621100'
	},
	{
		"id": '621202',
		"shortname": '武都区',
		"parentid": '621200'
	},
	{
		"id": '621221',
		"shortname": '成县',
		"parentid": '621200'
	},
	{
		"id": '621222',
		"shortname": '文县',
		"parentid": '621200'
	},
	{
		"id": '621223',
		"shortname": '宕昌县',
		"parentid": '621200'
	},
	{
		"id": '621224',
		"shortname": '康县',
		"parentid": '621200'
	},
	{
		"id": '621225',
		"shortname": '西和县',
		"parentid": '621200'
	},
	{
		"id": '621226',
		"shortname": '礼县',
		"parentid": '621200'
	},
	{
		"id": '621227',
		"shortname": '徽县',
		"parentid": '621200'
	},
	{
		"id": '621228',
		"shortname": '两当县',
		"parentid": '621200'
	},
	{
		"id": '622901',
		"shortname": '临夏市',
		"parentid": '622900'
	},
	{
		"id": '622921',
		"shortname": '临夏县',
		"parentid": '622900'
	},
	{
		"id": '622922',
		"shortname": '康乐县',
		"parentid": '622900'
	},
	{
		"id": '622923',
		"shortname": '永靖县',
		"parentid": '622900'
	},
	{
		"id": '622924',
		"shortname": '广河县',
		"parentid": '622900'
	},
	{
		"id": '622925',
		"shortname": '和政县',
		"parentid": '622900'
	},
	{
		"id": '622926',
		"shortname": '东乡族自治县',
		"parentid": '622900'
	},
	{
		"id": '622927',
		"shortname": '积石山保安族东乡族撒拉族自治县',
		"parentid": '622900'
	},
	{
		"id": '623001',
		"shortname": '合作市',
		"parentid": '623000'
	},
	{
		"id": '623021',
		"shortname": '临潭县',
		"parentid": '623000'
	},
	{
		"id": '623022',
		"shortname": '卓尼县',
		"parentid": '623000'
	},
	{
		"id": '623023',
		"shortname": '舟曲县',
		"parentid": '623000'
	},
	{
		"id": '623024',
		"shortname": '迭部县',
		"parentid": '623000'
	},
	{
		"id": '623025',
		"shortname": '玛曲县',
		"parentid": '623000'
	},
	{
		"id": '623026',
		"shortname": '碌曲县',
		"parentid": '623000'
	},
	{
		"id": '623027',
		"shortname": '夏河县',
		"parentid": '623000'
	},
	{
		"id": '630102',
		"shortname": '城东区',
		"parentid": '630100'
	},
	{
		"id": '630103',
		"shortname": '城中区',
		"parentid": '630100'
	},
	{
		"id": '630104',
		"shortname": '城西区',
		"parentid": '630100'
	},
	{
		"id": '630105',
		"shortname": '城北区',
		"parentid": '630100'
	},
	{
		"id": '630121',
		"shortname": '大通回族土族自治县',
		"parentid": '630100'
	},
	{
		"id": '630122',
		"shortname": '湟中县',
		"parentid": '630100'
	},
	{
		"id": '630123',
		"shortname": '湟源县',
		"parentid": '630100'
	},
	{
		"id": '632121',
		"shortname": '平安县',
		"parentid": '632100'
	},
	{
		"id": '632122',
		"shortname": '民和回族土族自治县',
		"parentid": '632100'
	},
	{
		"id": '632123',
		"shortname": '乐都县',
		"parentid": '632100'
	},
	{
		"id": '632126',
		"shortname": '互助土族自治县',
		"parentid": '632100'
	},
	{
		"id": '632127',
		"shortname": '化隆回族自治县',
		"parentid": '632100'
	},
	{
		"id": '632128',
		"shortname": '循化撒拉族自治县',
		"parentid": '632100'
	},
	{
		"id": '632221',
		"shortname": '门源回族自治县',
		"parentid": '632200'
	},
	{
		"id": '632222',
		"shortname": '祁连县',
		"parentid": '632200'
	},
	{
		"id": '632223',
		"shortname": '海晏县',
		"parentid": '632200'
	},
	{
		"id": '632224',
		"shortname": '刚察县',
		"parentid": '632200'
	},
	{
		"id": '632321',
		"shortname": '同仁县',
		"parentid": '632300'
	},
	{
		"id": '632322',
		"shortname": '尖扎县',
		"parentid": '632300'
	},
	{
		"id": '632323',
		"shortname": '泽库县',
		"parentid": '632300'
	},
	{
		"id": '632324',
		"shortname": '河南蒙古族自治县',
		"parentid": '632300'
	},
	{
		"id": '632340',
		"shortname": '李家峡',
		"parentid": '632300'
	},
	{
		"id": '632521',
		"shortname": '共和县',
		"parentid": '632500'
	},
	{
		"id": '632522',
		"shortname": '同德县',
		"parentid": '632500'
	},
	{
		"id": '632523',
		"shortname": '贵德县',
		"parentid": '632500'
	},
	{
		"id": '632524',
		"shortname": '兴海县',
		"parentid": '632500'
	},
	{
		"id": '632525',
		"shortname": '贵南县',
		"parentid": '632500'
	},
	{
		"id": '632540',
		"shortname": '龙羊峡',
		"parentid": '632500'
	},
	{
		"id": '632621',
		"shortname": '玛沁县',
		"parentid": '632600'
	},
	{
		"id": '632622',
		"shortname": '班玛县',
		"parentid": '632600'
	},
	{
		"id": '632623',
		"shortname": '甘德县',
		"parentid": '632600'
	},
	{
		"id": '632624',
		"shortname": '达日县',
		"parentid": '632600'
	},
	{
		"id": '632625',
		"shortname": '久治县',
		"parentid": '632600'
	},
	{
		"id": '632626',
		"shortname": '玛多县',
		"parentid": '632600'
	},
	{
		"id": '632721',
		"shortname": '玉树县',
		"parentid": '632700'
	},
	{
		"id": '632722',
		"shortname": '杂多县',
		"parentid": '632700'
	},
	{
		"id": '632723',
		"shortname": '称多县',
		"parentid": '632700'
	},
	{
		"id": '632724',
		"shortname": '治多县',
		"parentid": '632700'
	},
	{
		"id": '632725',
		"shortname": '囊谦县',
		"parentid": '632700'
	},
	{
		"id": '632726',
		"shortname": '曲麻莱县',
		"parentid": '632700'
	},
	{
		"id": '632801',
		"shortname": '格尔木市',
		"parentid": '632800'
	},
	{
		"id": '632802',
		"shortname": '德令哈市',
		"parentid": '632800'
	},
	{
		"id": '632821',
		"shortname": '乌兰县',
		"parentid": '632800'
	},
	{
		"id": '632822',
		"shortname": '都兰县',
		"parentid": '632800'
	},
	{
		"id": '632823',
		"shortname": '天峻县',
		"parentid": '632800'
	},
	{
		"id": '632840',
		"shortname": '茫崖行委',
		"parentid": '632800'
	},
	{
		"id": '632841',
		"shortname": '大柴旦行委',
		"parentid": '632800'
	},
	{
		"id": '632842',
		"shortname": '冷湖行委',
		"parentid": '632800'
	},
	{
		"id": '632843',
		"shortname": '省石油管理局',
		"parentid": '632800'
	},
	{
		"id": '640121',
		"shortname": '永宁县',
		"parentid": '640100'
	},
	{
		"id": '640122',
		"shortname": '贺兰县',
		"parentid": '640100'
	},
	{
		"id": '640181',
		"shortname": '灵武市',
		"parentid": '640100'
	},
	{
		"id": '640221',
		"shortname": '平罗县',
		"parentid": '640200'
	},
	{
		"id": '640303',
		"shortname": '红寺堡区',
		"parentid": '640300'
	},
	{
		"id": '640323',
		"shortname": '盐池县',
		"parentid": '640300'
	},
	{
		"id": '640324',
		"shortname": '同心县',
		"parentid": '640300'
	},
	{
		"id": '640381',
		"shortname": '青铜峡市',
		"parentid": '640300'
	},
	{
		"id": '640422',
		"shortname": '西吉县',
		"parentid": '640400'
	},
	{
		"id": '640423',
		"shortname": '隆德县',
		"parentid": '640400'
	},
	{
		"id": '640424',
		"shortname": '泾源县',
		"parentid": '640400'
	},
	{
		"id": '640425',
		"shortname": '彭阳县',
		"parentid": '640400'
	},
	{
		"id": '640521',
		"shortname": '中宁县',
		"parentid": '640500'
	},
	{
		"id": '640522',
		"shortname": '海原县',
		"parentid": '640500'
	},
	{
		"id": '650102',
		"shortname": '天山区',
		"parentid": '650100'
	},
	{
		"id": '650103',
		"shortname": '沙依巴克区',
		"parentid": '650100'
	},
	{
		"id": '650104',
		"shortname": '新市区',
		"parentid": '650100'
	},
	{
		"id": '650105',
		"shortname": '水磨沟区',
		"parentid": '650100'
	},
	{
		"id": '650106',
		"shortname": '头屯河区',
		"parentid": '650100'
	},
	{
		"id": '650107',
		"shortname": '达坂城区',
		"parentid": '650100'
	},
	{
		"id": '650109',
		"shortname": '米东区',
		"parentid": '650100'
	},
	{
		"id": '650121',
		"shortname": '乌鲁木齐县',
		"parentid": '650100'
	},
	{
		"id": '650140',
		"shortname": '经济技术开发区',
		"parentid": '650100'
	},
	{
		"id": '650202',
		"shortname": '独山子区',
		"parentid": '650200'
	},
	{
		"id": '650203',
		"shortname": '克拉玛依区',
		"parentid": '650200'
	},
	{
		"id": '650204',
		"shortname": '白碱滩区',
		"parentid": '650200'
	},
	{
		"id": '650205',
		"shortname": '乌尔禾区',
		"parentid": '650200'
	},
	{
		"id": '652101',
		"shortname": '吐鲁番市',
		"parentid": '652100'
	},
	{
		"id": '652122',
		"shortname": '鄯善县',
		"parentid": '652100'
	},
	{
		"id": '652123',
		"shortname": '托克逊县',
		"parentid": '652100'
	},
	{
		"id": '652201',
		"shortname": '哈密市',
		"parentid": '652200'
	},
	{
		"id": '652222',
		"shortname": '巴里坤哈萨克自治县',
		"parentid": '652200'
	},
	{
		"id": '652223',
		"shortname": '伊吾县',
		"parentid": '652200'
	},
	{
		"id": '652301',
		"shortname": '昌吉市',
		"parentid": '652300'
	},
	{
		"id": '652302',
		"shortname": '阜康市',
		"parentid": '652300'
	},
	{
		"id": '652323',
		"shortname": '呼图壁县',
		"parentid": '652300'
	},
	{
		"id": '652324',
		"shortname": '玛纳斯县',
		"parentid": '652300'
	},
	{
		"id": '652325',
		"shortname": '奇台县',
		"parentid": '652300'
	},
	{
		"id": '652327',
		"shortname": '吉木萨尔县',
		"parentid": '652300'
	},
	{
		"id": '652328',
		"shortname": '木垒哈萨克自治县',
		"parentid": '652300'
	},
	{
		"id": '652722',
		"shortname": '精河县',
		"parentid": '652700'
	},
	{
		"id": '652723',
		"shortname": '温泉县',
		"parentid": '652700'
	},
	{
		"id": '652701',
		"shortname": '博乐市',
		"parentid": '652700'
	},
	{
		"id": '652801',
		"shortname": '库尔勒市',
		"parentid": '652800'
	},
	{
		"id": '652822',
		"shortname": '轮台县',
		"parentid": '652800'
	},
	{
		"id": '652823',
		"shortname": '尉犁县',
		"parentid": '652800'
	},
	{
		"id": '652824',
		"shortname": '若羌县',
		"parentid": '652800'
	},
	{
		"id": '652826',
		"shortname": '焉耆回族自治县',
		"parentid": '652800'
	},
	{
		"id": '652827',
		"shortname": '和静县',
		"parentid": '652800'
	},
	{
		"id": '652828',
		"shortname": '和硕县',
		"parentid": '652800'
	},
	{
		"id": '652829',
		"shortname": '博湖县',
		"parentid": '652800'
	},
	{
		"id": '652825',
		"shortname": '且末县',
		"parentid": '652800'
	},
	{
		"id": '652924',
		"shortname": '沙雅县',
		"parentid": '652900'
	},
	{
		"id": '652901',
		"shortname": '阿克苏市',
		"parentid": '652900'
	},
	{
		"id": '652922',
		"shortname": '温宿县',
		"parentid": '652900'
	},
	{
		"id": '652923',
		"shortname": '库车县',
		"parentid": '652900'
	},
	{
		"id": '652925',
		"shortname": '新和县',
		"parentid": '652900'
	},
	{
		"id": '652926',
		"shortname": '拜城县',
		"parentid": '652900'
	},
	{
		"id": '652927',
		"shortname": '乌什县',
		"parentid": '652900'
	},
	{
		"id": '652928',
		"shortname": '阿瓦提县',
		"parentid": '652900'
	},
	{
		"id": '652929',
		"shortname": '柯坪县',
		"parentid": '652900'
	},
	{
		"id": '653001',
		"shortname": '阿图什市',
		"parentid": '653000'
	},
	{
		"id": '653022',
		"shortname": '阿克陶县',
		"parentid": '653000'
	},
	{
		"id": '653023',
		"shortname": '阿合奇县',
		"parentid": '653000'
	},
	{
		"id": '653024',
		"shortname": '乌恰县',
		"parentid": '653000'
	},
	{
		"id": '653121',
		"shortname": '疏附县',
		"parentid": '653100'
	},
	{
		"id": '653122',
		"shortname": '疏勒县',
		"parentid": '653100'
	},
	{
		"id": '653123',
		"shortname": '英吉沙县',
		"parentid": '653100'
	},
	{
		"id": '653124',
		"shortname": '泽普县',
		"parentid": '653100'
	},
	{
		"id": '653125',
		"shortname": '莎车县',
		"parentid": '653100'
	},
	{
		"id": '653126',
		"shortname": '叶城县',
		"parentid": '653100'
	},
	{
		"id": '653127',
		"shortname": '麦盖提县',
		"parentid": '653100'
	},
	{
		"id": '653128',
		"shortname": '岳普湖县',
		"parentid": '653100'
	},
	{
		"id": '653129',
		"shortname": '伽师县',
		"parentid": '653100'
	},
	{
		"id": '653130',
		"shortname": '巴楚县',
		"parentid": '653100'
	},
	{
		"id": '653131',
		"shortname": '塔什库尔干塔吉克自治县',
		"parentid": '653100'
	},
	{
		"id": '653101',
		"shortname": '喀什市',
		"parentid": '653100'
	},
	{
		"id": '653201',
		"shortname": '和田市',
		"parentid": '653200'
	},
	{
		"id": '653221',
		"shortname": '和田县',
		"parentid": '653200'
	},
	{
		"id": '653222',
		"shortname": '墨玉县',
		"parentid": '653200'
	},
	{
		"id": '653223',
		"shortname": '皮山县',
		"parentid": '653200'
	},
	{
		"id": '653224',
		"shortname": '洛浦县',
		"parentid": '653200'
	},
	{
		"id": '653225',
		"shortname": '策勒县',
		"parentid": '653200'
	},
	{
		"id": '653226',
		"shortname": '于田县',
		"parentid": '653200'
	},
	{
		"id": '653227',
		"shortname": '民丰县',
		"parentid": '653200'
	},
	{
		"id": '654002',
		"shortname": '伊宁市',
		"parentid": '654000'
	},
	{
		"id": '654003',
		"shortname": '奎屯市',
		"parentid": '654000'
	},
	{
		"id": '654021',
		"shortname": '伊宁县',
		"parentid": '654000'
	},
	{
		"id": '654022',
		"shortname": '察布查尔锡伯自治县',
		"parentid": '654000'
	},
	{
		"id": '654023',
		"shortname": '霍城县',
		"parentid": '654000'
	},
	{
		"id": '654024',
		"shortname": '巩留县',
		"parentid": '654000'
	},
	{
		"id": '654025',
		"shortname": '新源县',
		"parentid": '654000'
	},
	{
		"id": '654026',
		"shortname": '昭苏县',
		"parentid": '654000'
	},
	{
		"id": '654027',
		"shortname": '特克斯县',
		"parentid": '654000'
	},
	{
		"id": '654028',
		"shortname": '尼勒克县',
		"parentid": '654000'
	},
	{
		"id": '654040',
		"shortname": '霍尔果斯特殊经济开发区',
		"parentid": '654000'
	},
	{
		"id": '654201',
		"shortname": '塔城市',
		"parentid": '654200'
	},
	{
		"id": '654202',
		"shortname": '乌苏市',
		"parentid": '654200'
	},
	{
		"id": '654221',
		"shortname": '额敏县',
		"parentid": '654200'
	},
	{
		"id": '654223',
		"shortname": '沙湾县',
		"parentid": '654200'
	},
	{
		"id": '654224',
		"shortname": '托里县',
		"parentid": '654200'
	},
	{
		"id": '654225',
		"shortname": '裕民县',
		"parentid": '654200'
	},
	{
		"id": '654226',
		"shortname": '和布克赛尔蒙古自治县',
		"parentid": '654200'
	},
	{
		"id": '654301',
		"shortname": '阿勒泰市',
		"parentid": '654300'
	},
	{
		"id": '654321',
		"shortname": '布尔津县',
		"parentid": '654300'
	},
	{
		"id": '654322',
		"shortname": '富蕴县',
		"parentid": '654300'
	},
	{
		"id": '654323',
		"shortname": '福海县',
		"parentid": '654300'
	},
	{
		"id": '654324',
		"shortname": '哈巴河县',
		"parentid": '654300'
	},
	{
		"id": '654325',
		"shortname": '青河县',
		"parentid": '654300'
	},
	{
		"id": '654326',
		"shortname": '吉木乃县',
		"parentid": '654300'
	},
	{
		"id": '310104000000',
		"shortname": '徐汇区',
		"parentid": '310000000000'
	},
	{
		"id": '310105000000',
		"shortname": '长宁区',
		"parentid": '310000000000'
	},
	{
		"id": '310106000000',
		"shortname": '静安区',
		"parentid": '310000000000'
	},
	{
		"id": '310107000000',
		"shortname": '普陀区',
		"parentid": '310000000000'
	},
	{
		"id": '310108000000',
		"shortname": '闸北区',
		"parentid": '310000000000'
	},
	{
		"id": '310109000000',
		"shortname": '虹口区',
		"parentid": '310000000000'
	},
	{
		"id": '310110000000',
		"shortname": '杨浦区',
		"parentid": '310000000000'
	},
	{
		"id": '310112000000',
		"shortname": '闵行区',
		"parentid": '310000000000'
	},
	{
		"id": '310113000000',
		"shortname": '宝山区',
		"parentid": '310000000000'
	},
	{
		"id": '310114000000',
		"shortname": '嘉定区',
		"parentid": '310000000000'
	},
	{
		"id": '310115000000',
		"shortname": '浦东新区',
		"parentid": '310000000000'
	},
	{
		"id": '310116000000',
		"shortname": '金山区',
		"parentid": '310000000000'
	},
	{
		"id": '310117000000',
		"shortname": '松江区',
		"parentid": '310000000000'
	},
	{
		"id": '310118000000',
		"shortname": '青浦区',
		"parentid": '310000000000'
	},
	{
		"id": '310120000000',
		"shortname": '奉贤区',
		"parentid": '310000000000'
	},
	{
		"id": '310230000000',
		"shortname": '崇明区',
		"parentid": '310000000000'
	},
	{
		"id": '310101000000',
		"shortname": '黄浦区',
		"parentid": '310000000000'
	}
]

// ===================================================================
// 【居住地址】 - 选择【区县】onChange
function selectShCounty(county) {
	// 清空联动的下拉框值
	$("#shStreet").empty(); //街镇	
	$("#shStreet").html('<option  class="col1" value="">' + "选择街/镇" + '</option>');
	$('#stShStreet').val("");
	$('#stShStreetId').val("");

	// 【区】【hidden赋值】
	var countyId = $("#" + county + " option:selected").val();
	var countyName = $("#" + county + " option:selected").text();
	$('#stShCountyId').val(countyId);
	$('#stShCounty').val(countyId == "" ? "" : countyName);

	// 【街/镇】【联动】
	var street = "";
	for(var i = 0; i < shStreet.length; i++) {
		if(shStreet[i].parentid == countyId) {
			street += '<option  class="col1" value="' + shStreet[i].id + '">' + shStreet[i].shortname + '</option>';
		}
	}
	$(street).appendTo("#shStreet");
}

// 【居住地址】 - 选择【街道】onChange
function selectShStreet(street) {
	var streetId = $("#" + street + " option:selected").val();
	var streetName = $("#" + street + " option:selected").text();
	// 【街/镇】【hidden赋值】
	$('#stShStreetId').val(streetId);
	$('#stShStreet').val(streetId == "" ? "" : streetName);
}

// 【户籍地址】 - 选择【市】onChange
function selectCity(city) {
	// 清空联动的下拉框值
	$("#county").empty(); //区县
	$("#county").html('<option  class="col1" value="">' + "选择区/县" + '</option>');
	$('#stCounty').val("");
	$('#stCountyId').val("");

	// 【市】【hidden赋值】
	var cityId = $("#" + city + " option:selected").val();
	var cityName = $("#" + city + " option:selected").text();
	$('#stCityId').val(cityId);
	$('#stCity').val(cityId == "" ? "" : cityName);

	// 【区县】【联动】
	var countyOption = "";
	for(var i = 0; i < county.length; i++) {
		if(county[i].parentid == cityId) {
			countyOption += '<option  class="col1" value="' + county[i].id + '">' + county[i].shortname + '</option>';
		}
	}
	$(countyOption).appendTo("#county");
}

// 【户籍地址】 - 选择【区县】onChange
function selectCounty(county) {
	var countyId = $("#" + county + " option:selected").val();
	var countyName = $("#" + county + " option:selected").text();
	// 【区县】【hidden赋值】
	$('#stCountyId').val(countyId);
	$('#stCounty').val(countyId == "" ? "" : countyName);
}

// 【民族】 - 选择【民族】onChange
function selectNation(nation) {
	var nationId = $("#" + nation + " option:selected").val();
	var nationName = $("#" + nation + " option:selected").text();
	// 【民族】【hidden赋值】
	$('#stNationId').val(nationId);
	$('#stNation').val(nationId == "" ? "" : nationName);
}

/*--------------------------------2019.5.23  通用地址选择 -----------------------------
	province_id:省份select的id
	city_id：城市select的id
	county_id：区县select的id
	street_id：街道select的id
-----------------------------------------------------------------------------------------*/

// 【省】
function selectProvince(province_id, city_id, county_id, street_id,neighborhood_id) {
	// 【省】【hidden赋值】
	var provinceId = $("#" + province_id + " option:selected").val();
	var provinceName = $("#" + province_id + " option:selected").text();
	$("#" + province_id).attr("vId", provinceId);
	$("#" + province_id).attr("vName", provinceId == "" ? "" : provinceName);

	if("" != city) { //【城市】
		// 清空值
		$("#" + city_id).attr("vId", "");
		$("#" + city_id).attr("vName", "");
		$("#" + city_id).empty();
		$("#" + city_id).html('<option  class="col1" value="">' + "选择城市" + '</option>');

		// 联动
		var cityOption = "";
		for(var i = 0; i < city.length; i++) {
			if(city[i].parentid == provinceId) {
				cityOption += '<option  class="col1" value="' + city[i].id + '">' + city[i].shortname + '</option>';
			}
		}
		$(cityOption).appendTo("#" + city_id);
	}

	if("" != county_id) { //【区县】
		// 清空值
		$("#" + county_id).attr("vId", "");
		$("#" + county_id).attr("vName", "");
		$("#" + county_id).empty();
		$("#" + county_id).html('<option  class="col1" value="">' + "选择区/县" + '</option>');
	}

	if("" != street_id) { // 【街镇】
		// 清空值
		$("#" + street_id).attr("vId", "");
		$("#" + street_id).attr("vName", "");
		$("#" + street_id).empty();
		$("#" + street_id).html('<option  class="col1" value="">' + "选择街/镇" + '</option>');
		$("#" + street_id).attr("disabled", true);

		if("上海市" == provinceName) {
			$("#" + street_id).attr("disabled", false);
		}
	}
	if("" != neighborhood_id) { // 【居委】
		// 清空值
		$("#" + neighborhood_id).attr("vId", "");
		$("#" + neighborhood_id).attr("vName", "");
		$("#" + neighborhood_id).empty();
		$("#" + neighborhood_id).html('<option  class="col1" value="">' + "选择居委" + '</option>');
		$("#" + neighborhood_id).attr("disabled", true);

		if("上海市" == provinceName) {
			$("#" + neighborhood_id).attr("disabled", false);
		}
	}
}

//  【市】
function selectCity(city_id, county_id, street_id,neighborhood_id) {
	// 【市】【hidden赋值】
	var cityId = $("#" + city_id + " option:selected").val();
	var cityName = $("#" + city_id + " option:selected").text();
	$("#" + city_id).attr("vId", cityId);
	$("#" + city_id).attr("vName", cityName == "" ? "" : cityName);

	if("" != county_id) { //【区县】
		// 清空值
		$("#" + county_id).attr("vId", "");
		$("#" + county_id).attr("vName", "");
		$("#" + county_id).empty();
		$("#" + county_id).html('<option  class="col1" value="">' + "选择区/县" + '</option>');

		// 联动
		var countyOption = "";
		for(var i = 0; i < county.length; i++) {
			if(county[i].parentid == cityId) {
				countyOption += '<option  class="col1" value="' + county[i].id + '">' + county[i].shortname + '</option>';
			}
		}
		$(countyOption).appendTo("#" + county_id);
	}

	if("" != street_id) { // 【街镇】
		// 清空值
		$("#" + street_id).attr("vId", "");
		$("#" + street_id).attr("vName", "");
		$("#" + street_id).empty();
		$("#" + street_id).html('<option  class="col1" value="">' + "选择街/镇" + '</option>');
	}
	if("" != neighborhood_id) { // 【居委】
		// 清空值
		$("#" + neighborhood_id).attr("vId", "");
		$("#" + neighborhood_id).attr("vName", "");
		$("#" + neighborhood_id).empty();
		$("#" + neighborhood_id).html('<option  class="col1" value="">' + "选择居委" + '</option>');
	}
}

// 【区县】
function selectCounty(county_id, street_id,neighborhood_id) {
	// 【区】【hidden赋值】
	var countyId = $("#" + county_id + " option:selected").val();
	var countyName = $("#" + county_id + " option:selected").text();
	$("#" + county_id).attr("vId", countyId);
	$("#" + county_id).attr("vName", countyName == "" ? "" : countyName);

	if("" != street_id) { // 【街镇】
		// 清空值
		$("#" + street_id).attr("vId", "");
		$("#" + street_id).attr("vName", "");
		$("#" + street_id).empty();
		$("#" + street_id).html('<option  class="col1" value="">' + "选择街/镇" + '</option>');

		if($("#" + street_id).prop("disabled") == false) {
			// 联动
			var street = "";
			for(var i = 0; i < shStreet.length; i++) {
				if(shStreet[i].parentid == countyId) {
					street += '<option  class="col1" value="' + shStreet[i].id + '">' + shStreet[i].shortname + '</option>';
				}
			}
			$(street).appendTo("#" + street_id);
		}
	}
	if("" != neighborhood_id) { // 【居委】
		// 清空值
		$("#" + neighborhood_id).attr("vId", "");
		$("#" + neighborhood_id).attr("vName", "");
		$("#" + neighborhood_id).empty();
		$("#" + neighborhood_id).html('<option  class="col1" value="">' + "选择居委" + '</option>');
	}
}

//【街道】
function selectStreet(street_id,neighborhood_id) {
	// 【街/镇】【hidden赋值】
	var streetId = $("#" + street_id + " option:selected").val();
	var streetName = $("#" + street_id + " option:selected").text();
	$("#" + street_id).attr("vId", streetId);
	$("#" + street_id).attr("vName", streetName == "" ? "" : streetName);
	
	if("" != neighborhood_id) { // 【居委】
		// 清空值
		$("#" + neighborhood_id).attr("vId", "");
		$("#" + neighborhood_id).attr("vName", "");
		$("#" + neighborhood_id).empty();
		$("#" + neighborhood_id).html('<option  class="col1" value="">' + "选择居委" + '</option>');

		if($("#" + neighborhood_id).prop("disabled") == false) {
			// 联动
			var neighborhood = "";
			for(var i = 0; i < shNeighborhood.length; i++) {
				if(shNeighborhood[i].parentid == streetId) {
					neighborhood += '<option  class="col1" value="' + shNeighborhood[i].id + '">' + shNeighborhood[i].shortname + '</option>';
				}
			}
			$(neighborhood).appendTo("#" + neighborhood_id);
		}
	}
}

//【居委】
function selectNeighborhood(neighborhood_id) {
	// 【街/镇】【hidden赋值】
	var neighborhood_idId = $("#" + neighborhood_id + " option:selected").val();
	var neighborhood_idName = $("#" + neighborhood_id + " option:selected").text();
	$("#" + neighborhood_id).attr("vId", neighborhood_idId);
	$("#" + neighborhood_id).attr("vName", neighborhood_idName == "" ? "" : neighborhood_idName);
}

// 【民族】
function selectNationById(nation_id) {
	// 【民族】【hidden赋值】
	var nationId = $("#" + nation_id + " option:selected").val();
	var nationName = $("#" + nation_id + " option:selected").text();
	$("#" + nation_id).attr("vId", nationId);
	$("#" + nation_id).attr("vName", nationName == "" ? "" : nationName);
}
// 【社区事务受理中心 - 区】
function selectCenterCounty(county_id, center_id) {
	// 【区】【hidden赋值】
	var countyId = $("#" + county_id + " option:selected").val();
	var countyName = $("#" + county_id + " option:selected").text();
	$("#" + county_id).attr("vId", countyId);
	$("#" + county_id).attr("vName", countyName == "" ? "" : countyName);

	if("" != center_id) { // 【中心】
		// 清空值
		$("#" + center_id).attr("vId", "");
		$("#" + center_id).attr("vName", "");
		$("#" + center_id).empty();
		$("#" + center_id).html('<option  class="col1" value="">' + "请选择" + '</option>');

		if($("#" + center_id).prop("disabled") == false) {
			// 联动
			var centerOp = "";
			for(var i = 0; i < center.length; i++) {
				if(center[i].parentid == countyId) {
					centerOp += '<option  class="col1" value="' + center[i].id + '">' + center[i].shortname + '</option>';
				}
			}
			$(centerOp).appendTo("#" + center_id);
		}
	}
}

// 【社区事务受理中心 - 中心】
function selectCenter(center_id) {
	// 【中心】【hidden赋值】
	var centerId = $("#" + center_id + " option:selected").val();
	var centerName = $("#" + center_id + " option:selected").text();
	$("#" + center_id).attr("vId", centerId);
	$("#" + center_id).attr("vName", centerName == "" ? "" : centerName);
}

function setSelectChecked(selectId, checkValue) {
	var select = document.getElementById(selectId);

	for(var i = 0; i < select.options.length; i++) {
		if(select.options[i].value == checkValue) {
			select.options[i].selected = true;
			$("#" + selectId).attr("vId", checkValue);
			$("#" + selectId).attr("vName", select.options[i].text);
			break;
		}
	}
}

function setSelectCheckedByText(selectId, checkText) {
	var select = document.getElementById(selectId);
	for(var i = 0; i < select.options.length; i++) {
		if(select.options[i].text == checkText) {
			select.options[i].selected = true;
			$("#" + selectId).attr("vId", select.options[i].value);
			$("#" + selectId).attr("vName", select.options[i].text);
			break;
		}
	}
}

function setHjAdress(province, city, county, street, neighborhood,hjp, hjc, hjco, hjs,hjn) {
	setSelectChecked(province, hjp);
	selectProvince(province, city, county, street,neighborhood);
	setSelectChecked(city, hjc);
	selectCity(city, county, street,neighborhood);
	setSelectChecked(county, hjco);
	selectCounty(county, street,neighborhood);
	if(hjs!=null&&hjs!=undefined){
		setSelectChecked(street, hjs);
		selectStreet(street,neighborhood);
	}
	if(hjn!=null &&hjn!=undefined){
		setSelectChecked(neighborhood, hjn);
		selectNeighborhood(neighborhood);
	}
}

function setHjAdressText(province, city, county, street,neighborhood, hjp, hjc, hjco, hjs,hjn) {
	setSelectCheckedByText(province, hjp);
	selectProvince(province, city, county, street,neighborhood);
	setSelectCheckedByText(city, hjc);
	selectCity(city, county, street,neighborhood);
	setSelectCheckedByText(county, hjco);
	selectCounty(county, street,neighborhood);
	console.log(hjs);
	console.log(hjn);
	if(hjs!=null&&hjs!=undefined){
		setSelectCheckedByText(street, hjs);
		selectStreet(street,neighborhood);
	}
	if(hjn!=null &&hjn!=undefined){
		setSelectCheckedByText(neighborhood, hjn);
	selectNeighborhood(neighborhood);
	}
}

//function setShouliCenter(stCenterCounty,stCenter,scc,sc){
//	setSelectCheckedByText(stCenterCounty, scc);
//	selectCenterCounty(stCenterCounty,stCenter);
//	setSelectCheckedByText(stCenter, sc);
//	selectCenterCounty(selectCenter);
//}

function setSelectP(id) {
	for(var i = 0; i < province.length; i++) {
		if(id == province[i].id) {
			return province[i].shortname;
		}
	}
}

function setSelectC(id) {
	for(var i = 0; i < city.length; i++) {
		if(id == city[i].id) {
			return city[i].shortname;
		}
	}
}

function setSelectCo(id) {
	for(var i = 0; i < county.length; i++) {
		if(id == shCounty[i].id) {
			return shCounty[i].shortname;
		} else if(id == county[i].id) {
			return county[i].shortname;
		}
	}
}

function setSelectS(id) {
	for(var i = 0; i < shStreet.length; i++) {
		if(id == shStreet[i].id) {
			return shStreet[i].shortname;
		}
	}
}

function setCenter() {
	console.log(1);
	setSelectCheckedByText('stCenterCounty', '静安区');
	selectCenterCounty('stCenterCounty', 'stCenter');
	setSelectCheckedByText('stCenter', '临汾路街道社区事务受理中心');
}