// 单位类型
var aST_ORG_TYPE = [
	{name: '企业', value: 'a'},
	{name: '事业', value: 'b'},
	{name: '社会团体', value: 'c'},
	{name: '其他组织', value: 'd'}
];
// 审批方式
var aSHENPI = [
	{name: '告知承诺方式', value: '告知承诺方式'},
	{name: '审批方式', value: '审批方式'}
]
// 行政区
var aDISTRICTS = [
	{name: '黄浦区', value: '黄浦区'},
	{name: '徐汇区', value: '徐汇区'},
	{name: '长宁区', value: '长宁区'},
	{name: '静安区', value: '静安区'},
	{name: '普陀区', value: '普陀区'},
	{name: '虹口区', value: '虹口区'},
	{name: '杨浦区', value: '杨浦区'},
	{name: '闵行区', value: '闵行区'},
	{name: '宝山区', value: '宝山区'},
	{name: '嘉定区', value: '嘉定区'},
	{name: '浦东新区', value: '浦东新区'},
	{name: '金山区', value: '金山区'},
	{name: '松江区', value: '松江区'},
	{name: '青浦区', value: '青浦区'},
	{name: '奉贤区', value: '奉贤区'},
	{name: '崇明区', value: '崇明区'}
];
// 申请单位
var aAPPLIER = [
	{name: '上海城投原水有限公司', value: '上海城投原水有限公司'},
	{name: '上海浦东威立雅自来水有限公司', value: '上海浦东威立雅自来水有限公司'},
	{name: '上海城投水务（集团）有限公司', value: '上海城投水务（集团）有限公司'},
	{name: '上海城投水务（集团）有限公司制水分公司', value: '上海城投水务（集团）有限公司制水分公司'},
	{name: '上海城投水务（集团）有限公司供水分公司', value: '上海城投水务（集团）有限公司供水分公司'}
];
// 申请内容
var aAPPLICONTENT1 = [
	{name: '原水供水企业临时停止对制水厂供水的', value: '原水供水企业临时停止对制水厂供水的'},
	{name: '公共供水企业临时停止供水且断水用户数达到1000户以上的', value: '公共供水企业临时停止供水且断水用户数达到1000户以上的'},
	{name: '原水供水企业供应制水厂进厂压力低于规定要求的', value: '原水供水企业供应制水厂进厂压力低于规定要求的'},
	{name: '公共供水企业操作DN800以上管道阀门且降低区域管网压力的', value: '公共供水企业操作DN800以上管道阀门且降低区域管网压力的'},
	{name: '水厂实际日供水能力低于核定日供水能力80%且降低日常出厂压力的', value: '水厂实际日供水能力低于核定日供水能力80%且降低日常出厂压力的'},
]

