//各接口的API_ID参数	A：申请登记受理查询    B：审核结果查看     C：浏览全文接口      D：打印出证接口  
var perjsonStr1 = [{
		"stuffName": "参加个人城镇基本养老保险缴费情况",
		"code": "310195323433",
		"type":"jfqk",
		"img": "social.png",
	},
	{
		"stuffName": "个人享受城镇基本养老金情况",
		"code": "310195593409",
		"type":"yljqk",
		"img": "social.png",
	},
	{
		"stuffName": "上年度养老保险个人权益记录单",
		"type":"qyd",
		"code": "310192365426",
		"img": "social.png",
	},
	{
		"stuffName": "灵活就业人员电子对账单",
		"code": "310193163220",
		"type":"dzdzd",
		"img": "social.png",
	},
	{
		"stuffName": "转往外省市缴费凭证",
		"code": "312014501000",
		"type":"ydzy",
		"img": "social.png",
	},
];
var perjsonStr2 = [	
	{
		"stuffName": "城乡居保缴费情况",
		"code": "310199154354",
		"type":"cxjbjfqk",
		"img": "social.png",
	},
	{
		"stuffName": "享受城乡居保养老金情况",
		"code": "310196434305",
		"type":"xsyljqk",
		"img": "social.png",
	},
	{
		"stuffName": "上年度养老保险个人权益记录单（城乡居保）",
		"code": "310191773194",
		"type":"cxjbqyd",
		"img": "social.png",
	},
	{
		"stuffName": "业务审核办结情况",
		"code": "310199034560",//"",
		"type":"ywshbjqk",
		"img": "social.png",
	}]
var perjsonStr3 = [	
	{
		"stuffName": "居住证积分查询",
		"code": "xxxx",
		"type":"residencePermit",
		"img": "social.png",
	}]

//业务审核办结情况   核定表选择
var parentList = [{
	"code":"750080",
	"name": "城乡居民基本养老信息表",
	"id": "01",
}, {
	"code":"750034",
	"name": "注销登记业务核定表",
	"id": "02",
}, {
	"code":"",
	"name": "通知书",
	"id": "03",
}, {
	"code":"",
	"name": "业务核定表",
	"id": "04",
}, {
	"code":"",
	"name": "业务受理确认表",
	"id": "05",
}, {
	"code":"",
	"name": "城乡居民基本养老保险关系转入/出",
	"id": "06",
}, {
	"code":"",
	"name": "城乡居民基本养老保险月支付汇总表",
	"id": "07",
}, {
	"code":"",
	"name": "其他",
	"id": "08",
}];

var childList = [{
	"code":"750053",
	"name": "多支出退费通知书",
	"pid": "03",
}, {
	"code":"750059",
	"name": "企事业补缴业务缴费通知书",
	"pid": "03",
}, {
	"code":"750198",
	"name": "企事业退费通知书",
	"pid": "03",
}, {
	"code":"750087",
	"name": "异地转移支出通知书",
	"pid": "03",
}, {
	"code":"750016",
	"name": "业务核定表（变更登记）",
	"pid": "04",
}, {
	"code":"750014",
	"name": "业务核定表（参保登记）",
	"pid": "04",
}, {
	"code":"750084",
	"name": "业务核定表（城乡养老保险制度衔接）",
	"pid": "04",
}, {
	"code":"750037",
	"name": "业务核定表（待遇领取）",
	"pid": "04",
}, {
	"code":"750048",
	"name": "业务核定表（待遇调整（成批））",
	"pid": "04",
}, {
	"code":"750079",
	"name": "业务核定表（待遇调整）",
	"pid": "04",
}, {
	"code":"750503",
	"name": "业务核定表（待遇终止发放）",
	"pid": "04",
}, {
	"code":"750058",
	"name": "业务核定表（个人账户调整）",
	"pid": "04",
}, {
	"code":"750507",
	"name": "业务核定表（个人账户余额领取）",
	"pid": "04",
}, {
	"code":"750049",
	"name": "业务核定表（恢复发放）",
	"pid": "04",
}, {
	"code":"750046",
	"name": "业务核定表（历年补缴记录拆分）",
	"pid": "04",
}, {
	"code":"750064",
	"name": "业务核定表（领取人信息调整）",
	"pid": "04",
}, {
	"code":"750056",
	"name": "业务核定表（企事业补缴）",
	"pid": "04",
}, {
	"code":"750067",
	"name": "业务核定表（企事业退费）",
	"pid": "04",
}, {
	"code":"750083",
	"name": "业务核定表（养老保险关系转入）",
	"pid": "04",
}, {
	"code":"750062",
	"name": "业务核定表（养老转缴费）",
	"pid": "04",
}, {
	"code":"750069",
	"name": "业务核定表（账户恢复）",
	"pid": "04",
}, {
	"code":"750026",
	"name": "业务核定表（政府代缴清退）",
	"pid": "04",
}, {
	"code":"750045",
	"name": "业务核定表（注销登记）",
	"pid": "04",
}, {
	"code":"750076",
	"name": "业务受理确认表(集体组织变更登记)",
	"pid": "05",
}, {
	"code":"750075",
	"name": "业务受理确认表（集体组织登记）",
	"pid": "05",
}, {
	"code":"750060",
	"name": "业务受理确认表（延续缴费）",
	"pid": "05",
}, {
	"code":"750047",
	"name": "业务受理确认表（预折算信息确认）",
	"pid": "05",
}, {
	"code":"750086",
	"name": "城乡居民基本养老保险关系转出审批表",
	"pid": "06",
}, {
	"code":"750082",
	"name": "城乡居民基本养老保险关系转入接收函",
	"pid": "06",
}, {
	"code":"750081",
	"name": "城乡居民基本养老保险关系转入申请表",
	"pid": "06",
}, {
	"code":"750501",
	"name": "城乡居民基本养老保险月支付汇总表1",
	"pid": "07",
}, {
	"code":"750502",
	"name": "城乡居民基本养老保险月支付汇总表2",
	"pid": "07",
}, {
	"code":"750054",
	"name": "授权书(追回)",
	"pid": "08",
}, {
	"code":"750089",
	"name": "城乡养老保险制度衔接联系函",
	"pid": "08",
}, {
	"code":"750038",
	"name": "城乡养老保险重复缴费清退表",
	"pid": "08",
}, {
	"code":"750031",
	"name": "待遇领取业务核定表(参保登记审核)",
	"pid": "08",
}, {
	"code":"750024",
	"name": "上海市城乡居民基本养老保险残疾人代缴核定清单",
	"pid": "08",
}, {
	"code":"750039",
	"name": "社会保险关系转移衔接至农保核定表",
	"pid": "08",
}];
