//农行事项列表
var nhListJsonName = {};
//人社
nhListJsonName.RSList = [{
	'name': '灵活就业登记'
}, {
	'name': '申请大龄失业就业岗位补贴'
}, {
	'name': '失业登记'
}, {
	'name': '养老金卡（折）调整'
}, {
	'name': '城乡居保缴费情况'
}, {
	'name': '上年度养老保险个人权益记录单'
}, {
	'name': '享受城乡居保养老金情况'
}, {
	'name': '参加个人城镇基本养老保险缴费情况'
}, {
	'name': '个人享受城镇基本养老金情况'
}, {
	'name': '业务审核办结情况'
}, {
	'name': '灵活就业人员电子对账单'
}, {
	'name': '转往外省市缴费凭证'
}, {
	'name': '居住证积分查询'
}];
//市残联
nhListJsonName.CL_List = [{
	'name': '残疾人交通补贴申请'
}, {
	'name': '盲人有声读物阅览室（角）信息查询'
}, {
	'name': '无障碍电影放映点信息查询'
}];
//市交通委
nhListJsonName.JTW_List = [{
	'name': '公交卡余额查询'
}, {
	'name': '驾照考点查询'
}, {
	'name': '交通卡服务网点查询'
}];
//市医保局  商业保险机构网点信息查询   医保诊疗项目约定服务医院查询 长护险护理机构查询  本市开展异地就医的医院查询
nhListJsonName.YB_List = [{
	'name': '办理结算服务项目的相关手续'
}, {
	'name': '办理居民医保受理登记'
}, {
	'name': '办理医保网站密码变更'
}, {
	'name': '办理医疗卡挂失及撤销'
}, {
	'name': '帮困补助进度查询'
}, {
	'name': '帮困登记缴费进度查询'
}, {
	'name': '年度累计医疗费用信息查询'
}, {
	'name': '医保就医明细查询'
}, {
	'name': '帐户清算信息查询'
}, {
	'name': '医保个人信息'
}, {
	'name': '医保综合减负试算'
}, {
	'name': '本市开展异地就医的医院查询'
}, {
	'name': '医保及相关服务机构查询'
}, {
	'name': '医保诊疗项目约定服务医院查询'
}, {
	'name': '零星报销进度查询'
}, {
	'name': '参保人员待遇查询'
}, {
	'name': '商业保险机构网点信息查询'
}, {
	'name': '药品及床位费支付标准查询'
}, {
	'name': '医疗费用分担模拟计算器'
}, {
	'name': '医疗机构查询'
}, {
	'name': '长护险护理机构查询'
}];
//市民政局
nhListJsonName.MZ_List = [{
	'name': '城乡居民最低生活保障家庭证明出具'
}, {
	'name': '低收入困难家庭证明开具'
}, {
	'name': '定期定量生活补贴人员证明出具'
}, {
	'name': '特困人员证明出具'
}, {
	'name': '因病支出型贫困家庭证明开具'
}, {
	'name': '婚姻登记预约'
}];
//市公安局
nhListJsonName.GA_List = [{
	'name': '出入境记录查询'
}, {
	'name': '非上海生源高校毕业生落户查询'
}, {
	'name': '属地派出所查询'
}];

//市教委
nhListJsonName.JW_List = [{
	'name': '上海市计算机等级考试成绩查询'
}, {
	'name': '民办教育机构查询'
}, {
	'name': '全市示范高中信息查询'
}, {
	'name': '中外合作办学信息查询'
}, {
	'name': '小升初报名信息查询(公办、民办)'
}, {
	'name': '幼升小报名信息查询(公办、民办)'
}, {
	'name': '3岁以下幼儿托育服务机构查询'
}, {
	'name': '民办非学历培训机构查询'
}];
//市市场监管局
nhListJsonName.SCJG_List = [{
	'name': '餐饮脸谱查询'
}, {
	'name': '社会公用计量标准查询'
}, {
	'name': '法定计量检定机构考评员查询'
}, {
	'name': '计量标准考评员查询'
}, {
	'name': '二级注册计量师查询'
}, {
	'name': '企业名称状态查询'
}, {
	'name': '合同示范文本查询'
}, {
	'name': '广告发布登记查询'
}];
//市住建委
nhListJsonName.ZJ_List = [{
	'name': '公积金贷款试算'
}, {
	'name': '公积金还款计算'
}, {
	'name': '公积金缴存计算'
}, {
	'name': '公积金区管理部查询'
}, {
	'name': '公积金缴存提取经办银行查询'
}, {
	'name': '纯公积金贷款受理网点'
}, {
	'name': '公积金缴存表查询'
}, {
	'name': '物业企业信息查询'
}, {
	'name': '小区信息查询'
}];
//市档案局
//nhListJsonName.DA_List = [{
//	'name': '婚姻登记档案查询'
//}, {
//	'name': '独生子女证档案查询'
//}, {
//	'name': '知青上山下乡档案查询'
//}, {
//	'name': '知青返城档案查询'
//}, {
//	'name': '知青子女入户档案查询'
//}, {
//	'name': '再生育子女审批档案查询'
//}, {
//	'name': '工伤认定档案查询'
//}, {
//	'name': '学籍档案查询'
//}, {
//	'name': '复员退伍军人档案查询'
//}, {
//	'name': '兵役档案查询'
//}, {
//	'name': '人才引进审批档案查询'
//}, {
//	'name': '三峡移民档案查询'
//}, {
//	'name': '涉外婚姻登记档案查询'
//}, {
//	'name': '市级人才引进审批档案查询'
//}, {
//	'name': '专业技术干部的农村家属迁往城镇审批档案查询'
//}];
//市发改委
nhListJsonName.FGW_List = [{
	'name': '个人信用报告查询'
}];
//规划资源局服务
nhListJsonName.GH_List = [{
	'name': '不动产登记信息自助查询、打印'
},{
	'name': '地质资料档案查询'
}];
//市经信委 1
nhListJsonName.JXW_List = [{
	'name': '市民网上实名认证服务'
}];
//市规划资源局
//nhListJsonName.GHZY_List = [{
//	'name': '地质资料档案查询'
//}];
//市农业委员会
nhListJsonName.NW_List = [{
	'name': '宠物诊疗机构查询'
}];
//市税务局 
nhListJsonName.SWJ_List = [{
	'name': '房产税查询'
}];
//市卫健委
nhListJsonName.WJW_List = [{
	'name': '护士执业资格信息查询'
}, {
	'name': '医师执业资格信息查询'
}];
//市应急局
nhListJsonName.YJGL_List = [{
	'name': '上海市禁止、限制和控制危险化学品目录（第三批）查询'
}, {
	'name': '危险化学品生产企业安全生产许可证查询'
}, {
	'name': '危险化学品经营许可证核发查询'
}, {
	'name': '危险化学品建设项目信息查询'
}, {
	'name': '安全评价机构资质许可查询'
}, {
	'name': '安全生产检测检验机构资质认可查询'
}, {
	'name': '安全生产协会会员培训机构条件核实情况查询'
}];
//区绿容
nhListJsonName.QLR_List = [{
	'name': '崇明绿化树种推荐'
},{
	'name':'崇明区居住绿地树种推荐'
}];