let waringType = [{
	"id": '2',
	"value": '红灯违规'
}, {
	"id": '1',
	"value": '黄灯警示'
}, {
	"id": '3',
	"value": '严重失信'
}]

let addReason3 = [{
	"id": "1",
	"value": "停业、歇业或者服务场所迁移未对单用途卡兑付、退卡等事项作出妥善安排且无法联络"
}, {
	"id": "2",
	"value": "违反资金管理措施，拒不改正"
}, {
	"id": "3",
	"value": "一年内因违反本规定受到两次以上行政处罚"
}, {
	"id": "4",
	"value": "非法吸收公众存款或者集资诈骗"
}, {
	"id": "5",
	"value": "其他涉及单用途卡的严重失信行为"
}]
let addReason12 = [{
	"id": "0",
	"value": "未准确传送发卡信息或报送经营信息"
}, {
	"id": "1",
	"value": "被举报未按照规定公示信息对接标识 "
}, {
	"id": "2",
	"value": "被举报出现停业歇业或者经营场所迁移等情形，未按约定继续履行或者退回单用途卡余额"
}, {
	"id": "3",
	"value": "被举报未根据消费者需求签订购卡协议 "
}, {
	"id": "4",
	"value": "被举报未公示购卡章程                                                          "
}, {
	"id": "5",
	"value": "其他违反《管理规定》或本办法的情形"
}, {
	"id": "6",
	"value": "单张卡超额"
}, {
	"id": "7",
	"value": "预收资金余额超过风险警示标准，而经营者未采取风险防范措施"
}, {
	"id": "8",
	"value": "未及时（完整）传送信息或者提交有关材料 "
}, {
	"id": "10",
	"value": "设立不满一年，超过风险警示标准，未按规定采取银行专用存款账户管理等风险防范措施"
}, {
	"id": "12",
	"value": "预收资金超过特别风险警示标准，未按规定采取银行专用存款账户管理等风险防范措施"
}, {
	"id": "14",
	"value": "预收资金超过一般风险警示标准，未按规定采取银行专用存款账户管理等风险防范措施"
}, {
	"id": "15",
	"value": "预收资金余额达到一般风险警示标准的80%"
}, {
	"id": "16",
	"value": "预收资金余额达到特别风险警示标准的80%"
}, {
	"id": "17",
	"value": "履约保证保险方式且保险合同期限届满不足一个月"
}, {
	"id": "18",
	"value": "上季度信息未及时上报"
}, {
	"id": "20",
	"value": "日常卡交易数据未及时上报"
}, {
	"id": "30",
	"value": "未进行季度上报"
}]